{
  "pages": [
    {
      "title": "Noether's theorem on rationality for surfaces",
      "url": "https://en.wikipedia.org/wiki/Noether%27s_theorem_on_rationality_for_surfaces",
      "text": "In mathematics, Noether's theorem on rationality for surfaces is a classical result of Max Noether on complex algebraic surfaces, giving a criterion for a rational surface. Let S be an algebraic surface that is non-singular and projective. Suppose there is a morphism φ from S to the projective line, with general fibre also a projective line. Then the theorem states that S is rational.\n\nSee also\nHirzebruch surface\nList of complex and algebraic surfaces\n\nReferences\nCastelnuovo’s Theorem\n\nNotes\n\nCategory:Algebraic surfaces\nCategory:Theorems in algebraic geometry"
    },
    {
      "title": "Poincaré duality",
      "url": "https://en.wikipedia.org/wiki/Poincar%C3%A9_duality",
      "text": "In mathematics, the Poincaré duality theorem, named after Henri Poincaré, is a basic result on the structure of the homology and cohomology groups of manifolds.  It states that if M is an n-dimensional oriented closed manifold (compact and without boundary), then the kth cohomology group of M is isomorphic to the (n − k)th homology group of M, for all integers k \n\nPoincaré duality holds for any coefficient ring, so long as one has taken an orientation with respect to that coefficient ring; in particular, since every manifold has a unique orientation mod 2, Poincaré duality holds mod 2 without any assumption of orientation.\n\n History \nA form of Poincaré duality was first stated, without proof, by Henri Poincaré in 1893. It was stated in terms of Betti numbers: The kth and th Betti numbers of a closed (i.e. compact and without boundary) orientable n-manifold are equal. The cohomology concept was at that time about 40 years from being clarified. In his 1895 paper Analysis Situs, Poincaré tried to prove the theorem using topological intersection theory, which he had invented. Criticism of his work by Poul Heegaard led him to realize that his proof was seriously flawed. In the first two complements to Analysis Situs, Poincaré gave a new proof in terms of dual triangulations.\n\nPoincaré duality did not take on its modern form until the advent of cohomology in the 1930s, when Eduard Čech and Hassler Whitney invented the cup and cap products and formulated Poincaré duality in these new terms.\n\n Modern formulation \nThe modern statement of the Poincaré duality theorem is in terms of homology and cohomology: if  is a closed oriented n-manifold, and  is a natural number smaller than , then there is a canonically defined isomorphism from the -th cohomology group  to the th homology group . (Here, homology and cohomology is integral, but the isomorphism holds for any coefficient ring.) Specifically, one maps an element of  to its cap product with a fundamental class of , which will exist for oriented . In particular, the map  given by  is an isomorphism.\n\nFor non-compact oriented manifolds, one has to replace cohomology by cohomology with compact support.\n\nHomology and cohomology groups are defined to be zero for negative degrees, so Poincaré duality in particular implies that the homology and cohomology groups of orientable closed n-manifolds are zero for degrees bigger than n.\n\n Dual cell structures \nGiven a triangulated manifold, there is a corresponding dual polyhedral decomposition.  The dual polyhedral decomposition is a cell decomposition of the manifold such that the k-cells of the dual polyhedral decomposition are in bijective correspondence with the (n − k)-cells of the triangulation, generalising the notion of dual polyhedra.\n\nthumb|350px|right| – a picture of the parts of the dual-cells in a top-dimensional simplex.\n\nPrecisely, let T be a triangulation of an n-manifold M.  Let S be a simplex of T.  We denote the dual cell (to be defined precisely) corresponding to S by DS.  Let  be a top-dimensional simplex of T containing S.  So we can think of S as a subset of the vertices of .  Then  is defined to be the convex hull (in ) of the barycentres of all subsets of the vertices of  that contain .  One can check that if S is i-dimensional, then DS is an (n − i)-dimensional cell.  Moreover, the dual cells to T form a CW-decomposition of M, and the only (n − i)-dimensional dual cell that intersects an i-cell S is DS.  Thus the pairing  given by taking intersections induces an isomorphism , where  is the cellular homology of the triangulation T, and  and  are the cellular homologies and cohomologies of the dual polyhedral/CW decomposition the manifold respectively.  The fact that this is an isomorphism of chain complexes is a proof of Poincaré Duality.  Roughly speaking, this amounts to the fact that the boundary relation for the triangulation T is the incidence relation for the dual polyhedral decomposition under the correspondence .\n\n Naturality \nNote that Hk is a contravariant functor while Hn − k is covariant. The family of isomorphisms\n\nDM : Hk(M) → Hn − k(M)\n\nis natural in the following sense: if\n\nf : M → N\n\nis a continuous map between two oriented n-manifolds which is compatible with orientation, i.e. which maps the fundamental class of M to the fundamental class of N, then\n\nDN = f∗ DM f∗,\n\nwhere f∗ and f∗ are the maps induced by f in homology and cohomology, respectively.\n\nNote the very strong and crucial hypothesis that f maps the fundamental class of M to the fundamental class of N.  Naturality does not hold for an arbitrary continuous map f, since in general f∗ is not an injection on cohomology.  For example, if f is a covering map then it maps the fundamental class of M to a multiple of the fundamental class of N.  This multiple is the degree of the map f.\n\n Bilinear pairings formulation \n\nAssuming M is compact boundaryless and orientable,　let\n\ndenote the torsion subgroup of  and let\n\nbe the free part – all homology groups taken with integer coefficients in this section. Then there are bilinear maps which are duality pairings (explained below).\n\nand\n\n(Here  is the quotient of the rationals by the integers, taken as an additive group.)\n(Notice that in the torsion linking form, there is a −1 in the dimension, so the paired dimensions add up to  rather than to )\n\nThe first form is typically called the intersection product and the 2nd the torsion linking form.  Assuming the manifold M is smooth, the intersection product is computed by perturbing the homology classes to be transverse and computing their oriented intersection number.  For the torsion linking form, one computes the pairing of x and y by realizing nx as the boundary of some class z.  The form is the fraction with numerator the transverse intersection number of z with y and denominator n.\n\nThe statement that the pairings are duality pairings means that the adjoint maps \n\nand \n\nare isomorphisms of groups.\n\nThis result is an application of Poincaré Duality\n\ntogether with the universal coefficient theorem which gives an identification \n\nand \n.\nThus, Poincaré duality says that  and  are isomorphic, although there is no natural map giving the isomorphism, and similarly  and  are also isomorphic, though not naturally.\n\nMiddle dimension\nWhile for most dimensions, Poincaré duality induces a bilinear pairing between different homology groups, in the middle dimension it induces a bilinear form on a single homology group. The resulting intersection form is a very important topological invariant.\n\nWhat is meant by \"middle dimension\" depends on parity. For even dimension  which is more common, this is literally the middle dimension k, and there is a form on the free part of the middle homology:\n\nBy contrast, for odd dimension  which is less commonly discussed, it is most simply the lower middle dimension k, and there is a form on the torsion part of the homology in that dimension:\n\nHowever, there is also a pairing between the free part of the homology in the lower middle dimension k and in the upper middle dimension k+1:\n\nThe resulting groups, while not a single group with a bilinear form, are a simple chain complex and are studied in algebraic L-theory.\n\nApplications\nThis approach to Poincaré duality was used by Przytycki and Yasuhara to give an elementary homotopy and diffeomorphism classification of 3-dimensional lens spaces.\n\n Thom Isomorphism Formulation \n\nPoincaré Duality is closely related to the Thom Isomorphism Theorem, as we will explain here.  For this exposition, let  be a compact, boundaryless oriented n-manifold.  Let  be the product of  with itself, let  be an open tubular neighbourhood of the diagonal in . Consider the maps:\n\n  the Homology Cross Product\n\n  inclusion.\n\n  excision map where  is the normal disc bundle of the diagonal in .\n\n  the Thom Isomorphism. This map is well-defined as there is a standard identification  which is an oriented bundle, so the Thom Isomorphism applies.\n\nCombined, this gives a map , which is the intersection product—strictly speaking it is a generalization of the intersection product above, but it is also called the intersection product.  A similar argument with the Künneth theorem gives the torsion linking form.\n\nThis formulation of Poincaré Duality has become quite popular as it provides a means to define Poincaré Duality for any generalized homology theory provided one has a Thom Isomorphism for that homology theory. A Thom isomorphism theorem for a homology theory is now accepted as the generalized notion of orientability for a homology theory.  For example, a -structure on a manifold turns out to be precisely what is needed to be orientable in the sense of complex topological k-theory.\n\n Generalizations and related results \nThe Poincaré–Lefschetz duality theorem is a generalisation for manifolds with boundary. In the non-orientable case, taking into account the sheaf of local orientations, one can give a statement that is independent of orientability: see Twisted Poincaré duality.\n\nBlanchfield duality is a version of Poincaré duality which provides an isomorphism between the homology of an abelian covering space of a manifold and the corresponding cohomology with compact supports.  It is used to get basic structural results about the Alexander module and can be used to define the signatures of a knot.\n\nWith the development of homology theory to include K-theory and other extraordinary theories from about 1955, it was realised that the homology H* could be replaced by other theories, once the products on manifolds were constructed; and there are now textbook treatments in generality.  More specifically, there is a general Poincaré duality theorem for a generalized homology theory which requires a notion of orientation with respect to a homology theory, and is formulated in terms of a generalized Thom Isomorphism Theorem.  The Thom Isomorphism Theorem in this regard can be considered as the germinal idea for Poincaré duality for generalized homology theories.\n\nVerdier duality is the appropriate generalization to (possibly singular) geometric objects, such as analytic spaces or schemes, while intersection homology was developed R. MacPherson and M. Goresky for stratified spaces, such as real or complex algebraic varieties, precisely so as to generalise Poincaré duality to such stratified spaces.\n\nThere are many other forms of geometric duality in algebraic topology, including Lefschetz duality, Alexander duality, Hodge duality, and S-duality.\n\nMore algebraically, one can abstract the notion of a Poincaré complex, which is an algebraic object that behaves like the singular chain complex of a manifold, notably satisfying Poincaré duality on its homology groups, with respect to a distinguished element (corresponding to the fundamental class). These are used in surgery theory to algebraicize questions about manifolds. A Poincaré space is one whose singular chain complex is a Poincaré complex. These are not all manifolds, but their failure to be manifolds can be measured by obstruction theory.\n\n See also \n Bruhat decomposition\n Fundamental class\n Weyl group\n\nReferences\n\nFurther reading\n\n \n\n External links \nIntersection form at the Manifold Atlas\nLinking form at the Manifold Atlas\n\nCategory:Homology theory\nCategory:Manifolds\nCategory:Duality theories\nCategory:Theorems in algebraic geometry"
    },
    {
      "title": "Popescu's theorem",
      "url": "https://en.wikipedia.org/wiki/Popescu%27s_theorem",
      "text": "In commutative algebra and algebraic geometry, Popescu's theorem, introduced by Dorin Popescu,\nstates:, Theorem 1.3.\nLet A be a Noetherian ring and B a Noetherian algebra over it. Then, the structure map A →B is a regular morphism if and only if B is a direct limit of smooth A-algebras.\n\nFor example, if A is a local G-ring (e.g., a local excellent ring) and B its completion, then the map A →B is regular by definition and the theorem applies.\n\nAnother proof of Popescu's theorem was given by Tetsushi Ogoma, while an exposition of the result was provided by Richard Swan.\n\nThe usual proof of the Artin approximation theorem relies crucially on Popescu's theorem. Popescu's result was proved by an alternate method, and somewhat strengthened, by Mark Spivakovsky.\n\n See also \nRing with the approximation property\n\n References \n\n External links \n\nCategory:Theorems in algebraic geometry"
    },
    {
      "title": "Porteous formula",
      "url": "https://en.wikipedia.org/wiki/Porteous_formula",
      "text": "In mathematics, the Porteous formula, or Thom–Porteous formula, or Giambelli–Thom–Porteous formula, is an expression for the fundamental class of a degeneracy locus (or determinantal variety) of a morphism of vector bundles in terms of Chern classes. Giambelli's formula is roughly the special case when the vector bundles are sums of line bundles over projective space.  pointed out that the fundamental class  must be a polynomial in the Chern classes  and found this polynomial in a few special cases, and  found the polynomial in general.  proved a more general version, and  generalized it further.\n\nStatement\n\nGiven a morphism of vector bundles E, F of ranks m and n over a smooth variety, its k-th degeneracy locus (k ≤ min(m,n)) is the variety of points where it has rank at most k. If all components of the degeneracy locus have the expected codimension (m – k)(n – k) then Porteous's formula states that its fundamental class is the determinant of the matrix of size m – k whose (i, j) entry is the Chern class cn–k+j–i(F – E).\n\nReferences\n\nCategory:Theorems in algebraic geometry"
    },
    {
      "title": "Projection formula",
      "url": "https://en.wikipedia.org/wiki/Projection_formula",
      "text": "In algebraic geometry, the projection formula states that,http://math.stanford.edu/~vakil/0708-216/216class38.pdf for a quasi-compact separated morphism of schemes , a quasi-coherent sheaf  on X, a locally free sheaf  on Y, the natural maps of sheaves\n\nare isomorphisms.\n\nThere is yet another projection formula in the setting of étale cohomology.\n\n See also \nIntegration along fibers#Projection formula\n\n References \n\nCategory:Theorems in algebraic geometry"
    },
    {
      "title": "Ramanujam vanishing theorem",
      "url": "https://en.wikipedia.org/wiki/Ramanujam_vanishing_theorem",
      "text": "In algebraic geometry, the Ramanujam vanishing theorem is an extension of the Kodaira vanishing theorem due to , that in particular gives conditions for the vanishing of first cohomology groups of coherent sheaves on a surface. The Kawamata–Viehweg vanishing theorem generalizes it.\n\nSee also\n\nMumford vanishing theorem\n\nReferences\n\nCategory:Theorems in algebraic geometry"
    },
    {
      "title": "Ramanujam–Samuel theorem",
      "url": "https://en.wikipedia.org/wiki/Ramanujam%E2%80%93Samuel_theorem",
      "text": "In algebraic geometry, the Ramanujam–Samuel theorem gives conditions for a divisor of a local ring to be principal.\n\nIt was introduced independently by  in answer to a question of Grothendieck and by C. P. Ramanujam in an appendix to a paper by , and was generalized by .\n\nStatement\n\nGrothendieck's version of the Ramanujam–Samuel theorem  is as follows.\nSuppose that A is a local Noetherian ring with maximal ideal m, whose completion is integral and integrally closed, and ρ is a local homomorphism from A to a local Noetherian ring B of larger dimension such that B is formally smooth over A and the residue field of B is finite over that of A. Then a cycle of codimension 1 in Spec(B) that is principal at the point mB is principal.\n\nReferences\n\nCategory:Theorems in algebraic geometry"
    },
    {
      "title": "Raynaud's isogeny theorem",
      "url": "https://en.wikipedia.org/wiki/Raynaud%27s_isogeny_theorem",
      "text": "In mathematics, Raynaud's isogeny theorem, proved by , relates the Faltings heights of two isogeneous elliptic curves.\n\nReferences\n\nCategory:Elliptic curves\nCategory:Theorems in algebraic geometry"
    },
    {
      "title": "Regular embedding",
      "url": "https://en.wikipedia.org/wiki/Regular_embedding",
      "text": "In algebraic geometry, a closed immersion  of schemes is a regular embedding of codimension r if each point x in X has an open affine neighborhood U in Y such that the ideal of  is generated by a regular sequence of length r. A regular embedding of codimension one is precisely an effective Cartier divisor.\n\n Examples and usage \nFor example, if X and Y are smooth over a scheme S and if i is an S-morphism, then i is a regular embedding. In particular, every section of a smooth morphism is a regular embedding. If  is regularly embedded into a regular scheme, then B is a complete intersection ring.\n\nThe notion is used, for instance, in an essential way in Fulton's approach to intersection theory. The important fact is that when i is a regular embedding, if I is the ideal sheaf of X in Y, then the normal sheaf, the dual of , is locally free (thus a vector bundle) and the natural map  is an isomorphism: the normal cone  coincides with the normal bundle.\n\nA morphism of finite type  is called a (local) complete intersection morphism if each point x in X has an open affine neighborhood U so that f |U factors as  where j is a regular embedding and g is smooth. For example, if f is a morphism between smooth varieties, then f factors as  where the first map is the graph morphism and so is a complete intersection morphism.\n\n Non Examples \nOne non-example is a scheme which isn't equidimensional. For example, the scheme\n\nis the union of  and . Then, the embedding  isn't regular since taking any non-origin point on the -axis is of dimension  while any non-origin point on the -plane is of dimension .\n\n Non-noetherian case \nSGA 6 Expo VII uses the following weakened form of the notion of a regular embedding, that agrees with the usual one for Noetherian schemes.\n\nFirst, given a projective module E over a commutative ring A, an A-linear map  is called Koszul-regular if the Koszul complex determined by it is acyclic in dimension > 0 (consequently, it is a resolution of the cokernel of u). NB: We follow the terminology of the Stacks project.\n\nThen a closed immersion  is called Koszul-regular if the ideal sheaf determined by it is such that, locally, there are a finite free A-module E and a Koszul-regular surjection from E to the ideal sheaf.\n\n(This complication is because the discussion of a zero-divisor is tricky for Non-noetherian rings in that one cannot use the theory of associated primes.)\n\n See also \nregular submanifold\n\n Notes \n\n References \n\n, section B.7\nE. Sernesi: Deformations of algebraic schemes\n\nCategory:Theorems in algebraic geometry\nCategory:Morphisms of schemes"
    },
    {
      "title": "Reider's theorem",
      "url": "https://en.wikipedia.org/wiki/Reider%27s_theorem",
      "text": "In algebraic geometry, Reider's theorem gives conditions for a line bundle on a projective surface to be very ample.\n\nStatement\nLet D be a nef divisor on a smooth projective surface X. Denote by KX the canonical divisor of X.\n If D2 > 4, then the linear system |KX+D| has no base points unless there exists a nonzero effective divisor E such that\n , or\n ;\n If D2 > 8, then the linear system |KX+D| is very ample unless there exists a nonzero effective divisor E satisfying one of the following:\n  or ;\n  or ;\n ;\n \n\nApplications\nReider's theorem implies the surface case of the Fujita conjecture. Let L be an ample line bundle on a smooth projective surface X. If m > 2, then for D=mL we have \n D2 = m2 L2 ≥ m2 > 4;\n for any effective divisor E the ampleness of L implies D · E = m(L · E) ≥ m > 2.\nThus by the first part of Reider's theorem |KX+mL| is base-point-free. Similarly, for any m > 3 the linear system |KX+mL| is very ample.\n\nReferences\n\nCategory:Algebraic surfaces\nCategory:Theorems in algebraic geometry"
    },
    {
      "title": "Reiss relation",
      "url": "https://en.wikipedia.org/wiki/Reiss_relation",
      "text": "In algebraic geometry, the Reiss relation, introduced by ,  is a condition on the second-order elements of the points of a plane algebraic curve meeting a given line.\n\nStatement\n\nIf C is a complex plane curve given by the zeros of a polynomial f(x,y) of two variables, and L is a line meeting C transversely and not meeting C at infinity, then\n\nwhere the sum is over the points of intersection of C and L, and fx, fxy and so on stand for partial derivatives of f  .\nThis can also be written as\n\nwhere κ is the curvature of the curve C and θ is the angle its tangent line makes with L, and the sum is again over the points of intersection of C and L .\n\nReferences\n\nAkivis, M. A.; Goldberg, V. V.: Projective differential geometry of submanifolds. North-Holland Mathematical Library, 49. North-Holland Publishing Co., Amsterdam, 1993 (chapter 8).\n\nCategory:Theorems in algebraic geometry\nCategory:Algebraic curves"
    },
    {
      "title": "Ribet's theorem",
      "url": "https://en.wikipedia.org/wiki/Ribet%27s_theorem",
      "text": "In mathematics, Ribet's theorem (earlier called the epsilon conjecture or ε-conjecture) is a statement in number theory concerning properties of Galois representations associated with modular forms. It was proposed by Jean-Pierre Serre and proven by Ken Ribet. The proof of the epsilon conjecture was a significant step towards the proof of Fermat's Last Theorem. As shown by Serre and Ribet, the Taniyama–Shimura conjecture (whose status was unresolved at the time) and the epsilon conjecture together imply that Fermat's Last Theorem is true.\n\nIn mathematical terms, Ribet's theorem shows that if the Galois representation associated with an elliptic curve has certain properties, then that curve cannot be modular (in the sense that there cannot exist a modular form which gives rise to the same Galois representation).\n\n Statement \n\nLet f be a weight 2 newform on Γ0(qN)–i.e. of level qN where q does not divide N–with absolutely irreducible 2-dimensional mod p Galois representation ρf,p unramified at q if q ≠ p and finite flat at q = p.  Then there exists a weight 2 newform g of level N such that\n\nIn particular, if E is an elliptic curve over  with conductor qN, then the modularity theorem guarantees that there exists a weight 2 newform f of level qN such that the 2-dimensional mod p Galois representation ρf, p of f is isomorphic to the 2-dimensional mod p Galois representation ρE, p of E.  To apply Ribet's Theorem to ρE, p, it suffices to check the irreducibility and ramification of ρE, p.  Using the theory of the Tate curve, one can prove that ρE, p is unramified at q ≠ p and finite flat at q = p if p divides the power to which q appears in the minimal discriminant ΔE.  Then Ribet's theorem implies that there exists a weight 2 newform g of level N such that ρg, p ≈ ρE, p.\n\n The result of level lowering \n\nNote that Ribet's theorem does not guarantee that if one begins with an elliptic curve E of conductor qN, there exists an elliptic curve E'  of level N such that ρE, p ≈ ρE′, p.  The newform g of level N may not have rational Fourier coefficients, and hence may be associated to a higher-dimensional Abelian variety, not an elliptic curve.  For example, elliptic curve 4171a1 in the Cremona database given by the equation\n\nwith conductor 43×97 and discriminant 437 × 973 does not level-lower mod 7 to an elliptic curve of conductor 97.  Rather, the mod p Galois representation is isomorphic to the mod p Galois representation of an irrational newform g of level 97.\n\nHowever, for p large enough compared to the level N of the level-lowered newform, a rational newform (e.g. an elliptic curve) must level-lower to another rational newform (e.g. elliptic curve).  In particular for p ≫ NN1+ε, the mod p Galois representation of a rational newform cannot be isomorphic to that of an irrational newform of level N.\n\nSimilarly, the Frey-Mazur conjecture predicts that for p large enough (independent of the conductor N), elliptic curves with isomorphic mod p Galois representations are in fact isogenous, and hence have the same conductor.  Thus non-trivial level-lowering between rational newforms is not predicted to occur for large p (in particular p > 17).\n\n History \nIn his thesis,  came up with the idea of associating solutions (a,b,c) of Fermat's equation with a completely different mathematical object: an elliptic curve.\nIf p is an odd prime and a, b, and c are positive integers such that\n\nthen a corresponding Frey curve is an algebraic curve given by the equation\n\nThis is a nonsingular algebraic curve of genus one defined over , and its projective completion is an elliptic curve over .\n\nIn 1982 Gerhard Frey called attention to the unusual properties of the same curve as Hellegouarch, now called a Frey curve. This provided a bridge between Fermat and Taniyama by showing that a counterexample to Fermat's Last Theorem would create such a curve that would not be modular. The conjecture attracted considerable interest when Frey (1986) suggested that the Taniyama–Shimura–Weil conjecture implies Fermat's Last Theorem.  However, his argument was not complete. In 1985 Jean-Pierre Serre proposed that a Frey curve could not be modular and provided a partial proof of this. This showed that a proof of the semistable case of the Taniyama–Shimura conjecture would imply Fermat's Last Theorem. Serre did not provide a complete proof and what was missing became known as the epsilon conjecture or ε-conjecture. In the summer of 1986, Kenneth Alan Ribet proved the epsilon conjecture, thereby proving that the Taniyama–Shimura–Weil conjecture implied Fermat's Last Theorem.\n\n Implications for Fermat's Last Theorem \nSuppose that the Fermat equation with exponent p ≥ 5 had a solution in non-zero integers a, b, c. Let us form the corresponding Frey curve Eap,bp,cp. It is an elliptic curve and one can show that its minimal discriminant Δ is equal to 2−8 (abc)2p and its conductor N is the radical of abc, i.e. the product of all distinct primes dividing abc.  By an elementary consideration of the equation ap + bp = cp, it is clear that one of a, b, c is even and hence so is N. By the Taniyama–Shimura conjecture, E is a modular elliptic curve. Since all odd primes dividing a,b,c in N appear to a pth power in the minimal discriminant Δ, by Ribet's theorem one can perform level descent modulo p repetitively to strip off all odd primes from the conductor.  However, there are no newforms of level 2 as the genus of the modular curve X0(2) is zero (and newforms of level N are differentials on X0(N)).\n\n See also \n abc conjecture\n Wiles' proof of Fermat's Last Theorem\n\n Notes \n\n References \n\n Kenneth Ribet, From the Taniyama-Shimura conjecture to Fermat's last theorem. Annales de la faculté des sciences de Toulouse Sér. 5, 11 no. 1 (1990), p. 116–139.\n \n \n Frey Curve and Ribet's Theorem\n\n External links \nKen Ribet and Fermat's Last Theorem by Kevin Buzzard June 28, 2008\n\nCategory:Algebraic curves\nCategory:Riemann surfaces\nCategory:Modular forms\nCategory:Theorems in number theory\nCategory:Theorems in algebraic geometry\nCategory:Fermat's Last Theorem"
    },
    {
      "title": "Riemann–Roch theorem",
      "url": "https://en.wikipedia.org/wiki/Riemann%E2%80%93Roch_theorem",
      "text": "The Riemann–Roch theorem is an important theorem in mathematics, specifically in complex analysis and algebraic geometry, for the computation of the dimension of the space of meromorphic functions with prescribed zeroes and allowed poles. It relates the complex analysis of a connected compact Riemann surface with the surface's purely topological genus g, in a way that can be carried over into purely algebraic settings.\n\nInitially proved as Riemann's inequality by , the theorem reached its definitive form for Riemann surfaces after work of Riemann's short-lived student . It was later generalized to algebraic curves, to higher-dimensional varieties and beyond.\n\n Preliminary notions\nright|thumb|A Riemann surface of genus 3.\nA Riemann surface X is a topological space that is locally homeomorphic to an open subset of C, the set of complex numbers. In addition, the transition maps between these open subsets are required to be holomorphic. The latter condition allows one to transfer the notions and methods of complex analysis dealing with holomorphic and meromorphic functions on C to the surface X. For the purposes of the Riemann–Roch theorem, the surface X is always assumed to be compact. Colloquially speaking, the genus g of a Riemann surface is its number of handles; for example the genus of the Riemann surface shown at the right is three. More precisely, the genus is defined as half of the first Betti number, i.e., half of the C-dimension of the first singular homology group H1(X, C) with complex coefficients. The genus classifies compact Riemann surfaces up to homeomorphism, i.e., two such surfaces are homeomorphic if and only if their genus is the same. Therefore, the genus is an important topological invariant of a Riemann surface. On the other hand, Hodge theory shows that the genus coincides with the (C-)dimension of the space of holomorphic one-forms on X, so the genus also encodes complex-analytic information about the Riemann surface.Griffith, Harris, p. 116, 117\n\nA divisor D is an element of the free abelian group on the points of the surface. Equivalently, a divisor is a finite linear combination of points of the surface with integer coefficients.\n\nAny meromorphic function f gives rise to a divisor denoted (f) defined as\n\nwhere R(f) is the set of all zeroes and poles of f, and sν is given by\n\nThe set R(f) is known to be finite; this is a consequence of X being compact and the fact that the zeros of a (non-zero) holomorphic function do not have an accumulation point. Therefore, (f) is well-defined. Any divisor of this form is called a principal divisor. Two divisors that differ by a principal divisor are called linearly equivalent. The divisor of a meromorphic 1-form is defined similarly. A divisor of a global meromorphic 1-form is called the canonical divisor (usually denoted K). Any two meromorphic 1-forms will yield linearly equivalent divisors, so the canonical divisor is uniquely determined up to linear equivalence (hence \"the\" canonical divisor).\n\nThe symbol deg(D) denotes the degree (occasionally also called index) of the divisor D, i.e. the sum of the coefficients occurring in D. It can be shown that the divisor of a global meromorphic function always has degree 0, so the degree of the divisor depends only on the linear equivalence class.\n\nThe number ℓ(D) is the quantity that is of primary interest: the dimension (over C) of the vector space of meromorphic functions h on the surface, such that all the coefficients of (h) + D are non-negative. Intuitively, we can think of this as being all meromorphic functions whose poles at every point are no worse than the corresponding coefficient in D; if the coefficient in D at z is negative, then we require that h has a zero of at least that multiplicity at z – if the coefficient in D is positive, h can have a pole of at most that order. The vector spaces for linearly equivalent divisors are naturally isomorphic through multiplication with the global meromorphic function (which is well-defined up to a scalar).\n\n Statement of the theorem \n\nThe Riemann–Roch theorem for a compact Riemann surface of genus g with canonical divisor K states\n\nTypically, the number ℓ(D) is the one of interest, while ℓ(K − D) is thought of as a correction term (also called index of specialityStichtenoth p.22Mukai pp.295–297) so the theorem may be roughly paraphrased by saying\ndimension − correction = degree − genus + 1.\nThe correction term ℓ(K − D) is always non-negative, so that\n\nThis is called Riemann's inequality. Roch's part of the statement is the description of the possible difference between the sides of the inequality. On a general Riemann surface of genus g, K has degree 2g − 2, independently of the meromorphic form chosen to represent the divisor. This follows from putting D = K in the theorem. In particular, as long as D has degree at least 2g − 1, the correction term is 0, so that\n\nThe theorem will now be illustrated for surfaces of low genus. There are also a number other closely related theorems: an equivalent formulation of this theorem using line bundles and a generalization of the theorem to algebraic curves.\n\nExamples\nThe theorem will be illustrated by picking a point P on the surface in question and regarding the sequence of numbers\n\ni.e., the dimension of the space of functions that are holomorphic everywhere except at P where the function is allowed to have a pole of order at most n. For n = 0, the functions are thus required to be entire, i.e., holomorphic on the whole surface X. By Liouville's theorem, such a function is necessarily constant. Therefore, ℓ(0) = 1. In general, the sequence ℓ(n · P) is an increasing sequence.\n\nGenus zero\nThe Riemann sphere (also called complex projective line) is simply-connected and hence its first singular homology is zero. In particular its genus is zero. The sphere can be covered by two copies of C, with transition map being given by\n\nTherefore, the form ω = dz on one copy of C extends to a meromorphic form on the Riemann sphere: it has a double pole at infinity, since\n\nThus, its divisor K := div(ω) = −2P (where P is the point at infinity).\n\nTherefore, the theorem says that the sequence ℓ(n · P) reads\n\n 1, 2, 3, ... .\n\nThis sequence can also be read off from the theory of partial fractions. Conversely if this sequence starts this way, then g must be zero.\n\nGenus one\nright|thumb|A torus.\nThe next case is a Riemann surface of genus g = 1, such as a torus C / Λ, where Λ is a two-dimensional lattice (a group isomorphic to Z2). Its genus is one: its first singular homology group is freely generated by two loops, as shown in the illustration at the right. The standard complex coordinate z on C yields a one-form ω = dz on X that is everywhere holomorphic, i.e., has no poles at all. Therefore, K, the divisor of ω is zero.\n\nOn this surface, this sequence is\n\n1, 1, 2, 3, 4, 5 ... ;\n\nand this characterises the case g = 1. Indeed, for D = 0, ℓ(K − D) = ℓ(0) = 1, as was mentioned above. For D = nP with n > 0, the degree of K − D is strictly negative, so that the correction term is 0. The sequence of dimensions can also be derived from the theory of elliptic functions.\n\nGenus two and beyond\nFor g = 2, the sequence mentioned above is\n\n1, 1, ?, 2, 3, ... .\n\nIt is shown from this that the ? term of degree 2 is either 1 or 2, depending on the point. It can be proven that in any genus 2 curve there are exactly six points whose sequences are 1, 1, 2, 2, ... and the rest of the points have the generic sequence 1, 1, 1, 2, ... In particular, a genus 2 curve is a hyperelliptic curve. For g > 2 it is always true that at most points the sequence starts with g+1 ones and there are finitely many points with other sequences (see Weierstrass points).\n\nRiemann–Roch for line bundles\nUsing the close correspondence between divisors and holomorphic line bundles on a Riemann surface, the theorem can also be stated in a different, yet equivalent way: let L be a holomorphic line bundle on X. Let  denote the space of holomorphic sections of L. This space will be finite-dimensional; its dimension is denoted . Let K denote the canonical bundle on X. Then, the Riemann–Roch theorem states that\n\nThe theorem of the previous section is the special case of when L is a point bundle.\n\nThe theorem can be applied to show that there are g linearly independent holomorphic sections of K, or one-forms on X, as follows. Taking L to be the trivial bundle,  since the only holomorphic functions on X are constants. The degree of L is zero, and  is the trivial bundle. Thus,\n\nTherefore, , proving that there are g holomorphic one-forms.\n\nRiemann–Roch theorem for algebraic curves\nEvery item in the above formulation of the Riemann–Roch theorem for divisors on Riemann surfaces has an analogue in algebraic geometry. The analogue of a Riemann surface is a non-singular algebraic curve C over a field k. The difference in terminology (curve vs. surface) is because the dimension of a Riemann surface as a real manifold is two, but one as a complex manifold. The compactness of a Riemann surface is paralleled by the condition that the algebraic curve be complete, which is equivalent to being projective. Over a general field k, there is no good notion of singular (co)homology. The so-called geometric genus is defined as\n\ni.e., as the dimension of the space of globally defined (algebraic) one-forms (see Kähler differential). Finally, meromorphic functions on a Riemann surface are locally represented as fractions of holomorphic functions. Hence they are replaced by rational functions which are locally fractions of regular functions. Thus, writing ℓ(D) for the dimension (over k) of the space of rational functions on the curve whose poles at every point are not worse than the corresponding coefficient in D, the very same formula as above holds:\n\nwhere C is a projective non-singular algebraic curve over an algebraically closed field k. In fact, the same formula holds for projective curves over any field, except that the degree of a divisor needs to take into account multiplicities coming from the possible extensions of the base field and the residue fields of the points supporting the divisor., Section 7.3 Finally, for a proper curve over an Artinian ring, the Euler characteristic of the line bundle associated to a divisor is given by the degree of the divisor (appropriately defined) plus the Euler characteristic of the structural sheaf .* , Theorem VIII.1.4., p. 164\n\nThe smoothness assumption in the theorem can be relaxed, as well: for a (projective) curve over an algebraically closed field, all of whose local rings are Gorenstein rings, the same statement as above holds, provided that the geometric genus as defined above is replaced by the arithmetic genus ga, defined as\n\n(For smooth curves, the geometric genus agrees with the arithmetic one.) The theorem has also been extended to general singular curves (and higher-dimensional varieties).\n\n Proof \nThe statement for algebraic curves can be proved using Serre duality. The integer ℓ(D) is the dimension of the space of global sections of the line bundle  associated to D (cf. Cartier divisor). In terms of sheaf cohomology, we therefore have , and likewise . But Serre duality for non-singular projective varieties in the particular case of a curve states that  is isomorphic to the dual . The left hand side thus equals the Euler characteristic of the divisor D. When D = 0, we find the Euler characteristic for the structure sheaf is  by definition. To prove the theorem for general divisor, one can then proceed by adding points one by one to the divisor and ensure that the Euler characteristic transforms accordingly to the right hand side.\n\nThe theorem for compact Riemann surfaces can be deduced from the algebraic version using Chow's Theorem and the GAGA principle: in fact, every compact Riemann surface is defined by algebraic equations in some complex projective space. (Chow's Theorem says that any closed analytic subvariety of projective space is defined by algebraic equations, and the GAGA principle says that sheaf cohomology of an algebraic variety is the same as the sheaf cohomology of the analytic variety defined by the same equations).\n\n Applications \nAn irreducible plane algebraic curve of degree d has (d − 1)(d − 2)/2 − g singularities, when properly counted. It follows that, if a curve has (d − 1)(d − 2)/2 different singularities, it is a rational curve and, thus, admits a rational parameterization.\n\nThe Riemann–Hurwitz formula concerning (ramified) maps between Riemann surfaces or algebraic curves is a consequence of the Riemann–Roch theorem.\n\nClifford's theorem on special divisors is also a consequence of the Riemann–Roch theorem. It states that for a special divisor (i.e., such that ℓ(K − D) > 0) satisfying ℓ(D) > 0, the following inequality holds:, p. 109\n\n Generalizations of the Riemann–Roch theorem \nThe Riemann–Roch theorem for curves was proved for Riemann surfaces by Riemann and Roch in the 1850s and for algebraic curves by Friedrich Karl Schmidt in 1931 as he was working on perfect fields of finite characteristic. Under the hand of Peter Roquette:\nThe first main achievement of F. K. Schmidt is the discovery that the classical theorem of Riemann–Roch on compact Riemann surfaces can be transferred to function fields with finite base field. Actually, his proof of the Riemann–Roch theorem works for arbitrary perfect base fields, not necessarily finite.\nIt is foundational in the sense that the subsequent theory for curves tries to refine the information it yields (for example in the Brill–Noether theory).\n\nThere are versions in higher dimensions (for the appropriate notion of divisor, or line bundle). Their general formulation depends on splitting the theorem into two parts. One, which would now be called Serre duality, interprets the ℓ(K − D) term as a dimension of a first sheaf cohomology group; with ℓ(D) the dimension of a zeroth cohomology group, or space of sections, the left-hand side of the theorem becomes an Euler characteristic, and the right-hand side a computation of it as a degree corrected according to the topology of the Riemann surface.\n\nIn algebraic geometry of dimension two such a formula was found by the geometers of the Italian school; a Riemann–Roch theorem for surfaces was proved (there are several versions, with the first possibly being due to Max Noether). So matters rested before about 1950.\n\nAn n-dimensional generalisation, the Hirzebruch–Riemann–Roch theorem, was found and proved by Friedrich Hirzebruch, as an application of characteristic classes in algebraic topology; he was much influenced by the work of Kunihiko Kodaira. At about the same time Jean-Pierre Serre was giving the general form of Serre duality, as we now know it.\n\nAlexander Grothendieck proved a far-reaching generalization in 1957, now known as the Grothendieck–Riemann–Roch theorem. His work reinterprets Riemann–Roch not as a theorem about a variety, but about a morphism between two varieties. The details of the proofs were published by Borel & Serre in 1958.\n\nFinally a general version was found in algebraic topology, too. These developments were essentially all carried out between 1950 and 1960. After that the Atiyah–Singer index theorem opened another route to generalization.\n\nWhat results is that the Euler characteristic (of a coherent sheaf) is something reasonably computable. If one is interested, as is usually the case, in just one summand within the alternating sum, further arguments such as vanishing theorems must be brought to bear.\n\n Notes \n\nReferences\n\n Borel, Armand & Serre, Jean-Pierre (1958), Le théorème de Riemann–Roch, d'après Grothendieck, Bull.S.M.F. 86 (1958), 97–136.\n \n Grothendieck, Alexander, et al. (1966/67), Théorie des Intersections et Théorème de Riemann–Roch (SGA 6), LNM 225, Springer-Verlag, 1971.\n \n  See pages 208–219 for the proof in the complex situation. Note that Jost uses slightly different notation.\n , contains the statement for curves over an algebraically closed field. See section IV.1.\n \n . A good general modern reference.\n \n Vector bundles on Compact Riemann Surfaces, M. S. Narasimhan, pp. 5–6.\n \n \n \n \n Misha Kapovich, The Riemann–Roch Theorem (lecture note) an elementary introduction\n J. Gray, The Riemann–Roch theorem and Geometry, 1854–1914.\n Is there a Riemann–Roch for smooth projective curves over an arbitrary field? on MathOverflow\n\n See also \nKawasaki's Riemann–Roch formula\n\nCategory:Articles with inconsistent citation formats\nCategory:Theorems in algebraic geometry\nCategory:Geometry of divisors\nCategory:Topological methods of algebraic geometry\nCategory:Theorems in complex analysis\nCategory:Bernhard Riemann"
    },
    {
      "title": "Riemann–Roch theorem for surfaces",
      "url": "https://en.wikipedia.org/wiki/Riemann%E2%80%93Roch_theorem_for_surfaces",
      "text": "In mathematics, the Riemann–Roch theorem for surfaces describes the dimension of linear systems on an algebraic surface. The classical form of it was first given by , after preliminary versions of it were found by  and . The sheaf-theoretic version is due to Hirzebruch.\n\nStatement\nOne form of the Riemann–Roch theorem states that if D is a divisor on a non-singular projective surface then\n\nwhere χ is the holomorphic Euler characteristic, the dot . is the intersection number, and K is the canonical divisor. The constant χ(0) is the holomorphic Euler characteristic of the trivial bundle, and is equal to 1 + pa, where pa is the arithmetic genus of the surface. For comparison, the Riemann–Roch theorem for a curve states that χ(D) = χ(0) + deg(D).\n\nNoether's formula\n\nNoether's formula states that\n\nwhere χ=χ(0) is the holomorphic Euler characteristic, c12 = (K.K) is a Chern number and the self-intersection number of the canonical class K, and e = c2 is the topological Euler characteristic. It can be used to replace the \nterm χ(0) in the Riemann–Roch theorem with topological terms; this gives the Hirzebruch–Riemann–Roch theorem for surfaces.\n\nRelation to the Hirzebruch–Riemann–Roch theorem\nFor surfaces, the Hirzebruch–Riemann–Roch theorem is essentially the Riemann–Roch theorem for surfaces combined with the Noether formula. To see this, recall that for each divisor D on a surface there is an invertible sheaf L = O(D) such that the linear system of D is more or less the space of sections of L. \nFor surfaces the Todd class is , and the Chern character of the sheaf L is just , so the Hirzebruch–Riemann–Roch theorem states that\n\n \n\nFortunately this can be written in a clearer form as follows. First putting D = 0 shows that\n\n      (Noether's formula)\n\nFor invertible sheaves (line bundles) the second Chern class vanishes. The products of second cohomology classes can be identified with intersection numbers in the Picard group, and we get a more classical version of Riemann Roch for surfaces:\n\n \n\nIf we want, we can use Serre duality to express h2(O(D)) as h0(O(K − D)), but unlike the case of curves there is in general no easy way to write the h1(O(D)) term in a form not involving sheaf cohomology (although in practice it often vanishes).\n\nEarly versions\nThe earliest forms of the Riemann–Roch theorem for surfaces were often stated as an inequality rather than an equality, because there was no direct geometric description of first cohomology groups. \nA typical example is given by , which states that\n\nwhere\nr is the dimension of the complete linear system |D| of a divisor D (so r = h0(O(D)) −1)\nn is the virtual degree of D, given by the self-intersection number (D.D)\nπ is the virtual genus of D, equal to 1 + (D.D + K.D)/2\npa is the arithmetic genus χ(OF) − 1 of the surface\ni is the index of speciality of D, equal to dim H0(O(K − D)) (which by Serre duality is the same as dim H2(O(D))).\n\nThe difference between the two sides of this inequality was called the superabundance s  of the divisor D. \nComparing this inequality with the sheaf-theoretic version of the Riemann–Roch theorem shows that the superabundance of D is given by s = dim H1(O(D)). The divisor D was called regular if i = s = 0 (or in other words if all higher cohomology groups of O(D) vanish)  and superabundant if s > 0.\n\nReferences\n Topological Methods in Algebraic Geometry by Friedrich Hirzebruch \n\nCategory:Theorems in algebraic geometry\nCategory:Algebraic surfaces\nCategory:Topological methods of algebraic geometry"
    },
    {
      "title": "Schlessinger's theorem",
      "url": "https://en.wikipedia.org/wiki/Schlessinger%27s_theorem",
      "text": "In algebra, Schlessinger's theorem is a theorem in deformation theory introduced by  that gives conditions for a functor of artinian local rings to be pro-representable, refining an earlier theorem of Grothendieck.\n\nDefinitions\n\nΛ is a complete Noetherian local ring with residue field k, and C is the category of local Artinian Λ-algebras (meaning in particular that as modules over Λ they are finitely generated and Artinian) with residue field k.\n\nA small extension in C is a morphism Y→Z in C that is surjective with kernel a 1-dimensional vector space over k.\n\nA functor is called representable if it is of the form hX where hX(Y)=hom(X,Y) for some X, and is called pro-representable if it is of the form Y→lim hom(Xi,Y) for a filtered direct limit over i in some filtered ordered set.\n\nA morphism of functors F→G from C to sets is called smooth if whenever Y→Z is an epimorphism of C, the map from F(Y) to F(Z)×G(Z)G(Y) is surjective. This definition is closely related to the notion of a formally smooth morphism of schemes. If in addition the map between the tangent spaces of F and G is an isomorphism, then F is called a hull of G.\n\nGrothendieck's theorem\n\n showed that a functor from the category C of Artinian algebras to sets is pro-representable if and only if it preserves all finite limits. This condition is equivalent to asking that the functor preserves pullbacks and the final object. In fact Grothendieck's theorem applies not only to the category C of Artinian algebras, but to any category with finite limits whose objects are Artinian.\n\nBy taking the projective limit of the pro-representable functor in the larger category of linearly topologized local rings, one obtains a complete linearly topologized local ring representing the functor.\n\nSchlessinger's representation theorem\n\nOne difficulty in applying Grothendieck's theorem is that it can be hard to check that a functor preserves all pullbacks. Schlessinger showed that it is sufficient to check that the functor preserves pullbacks of a special form, which is often easier to check. Schlessinger's theorem also gives conditions under which the functor has a hull, even if it is not representable.\n\nSchessinger's theorem gives conditions for a set-valued functor F on C to be representable by a complete local Λ-algebra R with maximal ideal m such that R/mn is in C for all n.\n\nSchlessinger's theorem states that a functor from C to sets with F(k) a 1-element set is representable by a complete Noetherian local algebra if it has the following properties, and has a hull if it has the first three properties:\n \nH1: The map F(Y×XZ)→F(Y)×F(X)F(Z) is surjective whenever Z→X is a small extension in C and Y→X is some morphism in C.\nH2: The map in H1 is a bijection whenever Z→X is the small extension k[x]/(x2)→k.\nH3: The tangent space of F is a finite-dimensional vector space over k.\nH4: The map in H1 is a bijection whenever Y=Z is a small extension of X and the maps from Y and Z to X are the same.\n\nReferences\n\nCategory:Theorems in algebraic geometry"
    },
    {
      "title": "Serre–Tate theorem",
      "url": "https://en.wikipedia.org/wiki/Serre%E2%80%93Tate_theorem",
      "text": "In algebraic geometry, the Serre–Tate theorem,  says that  an abelian scheme and its p-divisible group have the same infinitesimal deformation theory. This was first proved by Serre when the reduction of the abelian variety is ordinary, using the Greenberg functor; then Tate gave a proof in the general case by a different method. Their proofs were not published, but they were summarized in the notes of the Lubin–Serre–Tate seminar (Woods Hole, 1964). Other proofs were published by Messing (1962) and Drinfeld (1976).\n\nReferences\n\n : see, vol.2, p.854, comments on Tate's letter from Jan.10, 1964.\n\nCategory:Abelian varieties\nCategory:Theorems in algebraic geometry"
    },
    {
      "title": "Serre's theorem on affineness",
      "url": "https://en.wikipedia.org/wiki/Serre%27s_theorem_on_affineness",
      "text": "In algebraic geometry, given an algebraic variety (or more generally scheme) X, Serre's theorem on affineness, after Jean-Pierre Serre, states that if\n(1) X is quasi-compact, and\n(2) for every quasi-coherent ideal sheaf I of OX, ,\nthen X is affine.\n\n References \nhttp://stacks.math.columbia.edu/tag/01XF\n\nCategory:Theorems in algebraic geometry"
    },
    {
      "title": "Stengle's Positivstellensatz",
      "url": "https://en.wikipedia.org/wiki/Stengle%27s_Positivstellensatz",
      "text": "In real semialgebraic geometry, Stengle's  (German for \"positive-locus-theorem\" – see Satz) characterizes polynomials that are positive on a semialgebraic set, which is defined by systems of inequalities of polynomials with real coefficients, or more generally, coefficients from any real closed field.\n\nIt can be thought of as an ordered analogue of Hilbert's Nullstellensatz. It was proved by French mathematiciam  and then rediscovered by the Canadian .\n\nStatement\n\nLet  be a real closed field, and  = { f1 ,f2 , ... , fm } and  = { g1 ,g2 , ... , gr } finite sets of polynomials over  in  variables. Let  be the semialgebraic set\n\nand define the preordering associated with  as the set\n\nwhere Σ2[1,…,] is the set of sum-of-squares polynomials. In other words, (, ) =  + , where  is the cone generated by  (i.e., the subsemiring of [1,…,] generated by  and arbitrary squares) and  is the ideal generated by . \n\nLet  ∈ [1,…,] be a polynomial. Krivine-Stengle Positivstellensatz states that\n\n(i)    if and only if  and  such that .\n\n(ii)   if and only if  such that  .\n\nThe weak  is the following variant of the . Let  be a real-closed field, and , , and  finite subsets of [1,…,]. Let  be the cone generated by , and  the ideal generated by . Then\n\nif and only if\n\n(Unlike , the \"weak\" form actually includes the \"strong\" form as a special case, so the terminology is a misnomer.)\n\n Variants \nStengle's Positivstellensatz have also the following refinements under additional assumptions. It should be remarked that Schmüdgen’s Positivstellensatz has a weaker assumption than Putinar’s Positivstellensatz, but the conclusion is also weaker.\n\n Schmüdgen's Positivstellensatz \nSuppose that . If the semialgebraic set  is compact, then each polynomial  that is strictly positive on  can be written as a polynomial in the defining functions of  with sums-of-squares coefficients, i.e. . Here  is said to be strictly positive on  if  for all .  Note that Schmüdgen's Positivstellensatz is stated for  and does not hold for arbitrary real closed fields.\n\n Putinar's Positivstellensatz \nDefine the quadratic module associated with  as the set \n\nAssume there exists L > 0  such that the polynomial  If   , then ∈ (,). \n\nSee also\n Positive polynomial\n\n Notes \n\nReferences\n\nCategory:Real algebraic geometry\nCategory:Algebraic varieties\nCategory:German words and phrases\nCategory:Theorems in algebraic geometry"
    },
    {
      "title": "Sumihiro's theorem",
      "url": "https://en.wikipedia.org/wiki/Sumihiro%27s_theorem",
      "text": "In algebraic geometry, Sumihiro's theorem, introduced by , states that a normal algebraic variety with an action of a torus can be covered by torus-invariant affine open subsets.\n\nThe \"normality\" in the hypothesis cannot be relaxed. The hypothesis that the group acting on the variety is a torus can also not be relaxed.http://mathoverflow.net/questions/94620/bialynicki-birula-decomposition-of-a-non-singular-quasi-projective-scheme/\n\n Notes \n\n References \n.\n\n External links \nhttp://arxiv.org/pdf/1504.06467.pdf\n\nCategory:Theorems in algebraic geometry"
    },
    {
      "title": "Tarski–Seidenberg theorem",
      "url": "https://en.wikipedia.org/wiki/Tarski%E2%80%93Seidenberg_theorem",
      "text": "In mathematics, the Tarski–Seidenberg theorem states that a set in (n + 1)-dimensional space defined by polynomial equations and inequalities can be projected down onto n-dimensional space, and the resulting set is still definable in terms of polynomial identities and inequalities.  The theorem—also known as the Tarski–Seidenberg projection property—is named after Alfred Tarski and Abraham Seidenberg. It implies that quantifier elimination is possible over the reals, that is that every formula constructed from polynomial equations and inequalities by logical connectors ∨ (or), ∧ (and), ¬ (not) and quantifiers ∀ (for all), ∃ (exists) is equivalent to a similar formula without quantifiers. An important consequence is the decidability of the theory of real-closed fields.\n\nAlthough the original proof of the theorem was constructive, the resulting algorithm has a computational complexity that is too high for using the method on a computer. George E. Collins introduced the algorithm of cylindrical algebraic decomposition, which allows quantifier elimination over the reals in double exponential time. This complexity is optimal, as there are examples where the output has a double exponential number of connected components. This algorithm is therefore fundamental, and it is widely used in computational algebraic geometry.\n\nStatement\n\nA semialgebraic set in Rn is a finite union of sets defined by a finite number of polynomial equations and inequalities, that is by a finite number of statements of the form\n\nand\n\nfor polynomials p and q.  We define a projection map π : Rn+1 → Rn by sending a point (x1,...,xn,xn+1) to (x1,...,xn).  Then the Tarski–Seidenberg theorem states that if X is a semialgebraic set in Rn+1 for some n > 1, then π(X) is a semialgebraic set in Rn.\n\nFailure with algebraic sets\n\nIf we only define sets using polynomial equations and not inequalities then we define algebraic sets rather than semialgebraic sets.  For these sets the theorem fails, i.e. projections of algebraic sets need not be algebraic.  As a simple example consider the hyperbola in R2 defined by the equation\n\nThis is a perfectly good algebraic set, but projecting it down by sending (x,y) in R2 to x in R produces the set of points satisfying .  This is a semialgebraic set, but it is not an algebraic set as the algebraic sets in R are R itself, the empty set and the finite sets.\n\nThis example shows also that, over the complex numbers, the projection of an algebraic set may be non-algebraic. Thus the existence of real algebraic sets with non-algebraic projections does not rely on the fact that the field of real numbers is not algebraically closed.\n\nRelation to structures\n\nThis result confirmed that semialgebraic sets in Rn form what is now known as an o-minimal structure on R.  These are collections of subsets Sn of Rn for each n ≥ 1 such that we can take finite unions and complements of the subsets in Sn and the result will still be in Sn, moreover the elements of S1 are simply finite unions of intervals and points.  The final condition for such a collection to be an o-minimal structure is that the projection map on the first n coordinates from Rn+1 to Rn must send subsets in Sn+1 to subsets in Sn.  The Tarski–Seidenberg theorem tells us this holds if Sn is the set of semialgebraic sets in Rn.\n\nSee also\n Decidability of first-order theories of the real numbers\n\nReferences\n\n \n \n \n\nExternal links\n Tarski–Seidenberg theorem at PlanetMath.org\n\nCategory:Real algebraic geometry\nCategory:Theorems in algebraic geometry"
    },
    {
      "title": "Tate's isogeny theorem",
      "url": "https://en.wikipedia.org/wiki/Tate%27s_isogeny_theorem",
      "text": "In mathematics, Tate's isogeny theorem, proved by , states that two abelian varieties over a finite field are isogeneous if and only if their Tate modules are isomorphic (as Galois representations).\n\nReferences\n\nCategory:Abelian varieties\nCategory:Theorems in algebraic geometry"
    },
    {
      "title": "Theorem of Bertini",
      "url": "https://en.wikipedia.org/wiki/Theorem_of_Bertini",
      "text": "In mathematics, the theorem of Bertini is an existence and genericity theorem for smooth connected hyperplane sections for smooth projective varieties over algebraically closed fields, introduced by Eugenio Bertini. This is the simplest and broadest of the \"Bertini theorems\" applying to a linear system of divisors; simplest because there is no restriction on the characteristic of the underlying field, while the extensions require characteristic 0.Hartshorne, Ch. III.10.\n\n Statement for hyperplane sections of smooth varieties\nLet X be a smooth quasi-projective variety over an algebraically closed field, embedded in a  projective space .\nLet  denote the complete system of hyperplane divisors in . Recall that it is the dual space  of  and is isomorphic to .\n\nThe theorem of Bertini states that the set of hyperplanes not containing X and with smooth intersection with X contains an open dense subset of the total system of divisors . The set itself is open if X is projective. If dim(X) ≥ 2, then these intersections (called hyperplane sections of X) are connected, hence irreducible.\n\nThe theorem hence asserts that a general hyperplane section not equal to X is smooth, that is: the property of smoothness is generic.\n\nOver an arbitrary field k, there is a dense open subset of the dual space  whose rational points define hyperplanes smooth hyperplane sections of X. When k is infinite, this open subset then has infinitely many rational points and there are infinitely many smooth hyperplane sections in X.\n\nOver a finite field, the above open subset may not contain rational points and in general there is no hyperplanes  with smooth intersection with X. However, if we take hypersurfaces of sufficientely big degrees, then the theorem of Bertini holds.Bjorn Poonen: Bertini Theorems over finite fields, Ann. of Math. 160 (2004).\n\nOutline of a proof\nWe consider the subfibration of the product variety  with fiber above  the linear system of hyperplanes that intersect X non-transversally at x.\n\nThe rank of the fibration in the product is one less than the codimension of , so that the total space has lesser dimension than  and so its projection is contained in a divisor of the complete system .\n\nGeneral statement\nOver  (or an algebraically closed field of characteristic 0), if X is a smooth quasi-projective variety, a general member of a linear system of divisors  on X is smooth away from the base locus of the system. This property fails in positive characteristics.\n\n Generalizations \nThe theorem of Bertini has been generalized in various ways. For example, a result due to Steven Kleiman asserts the following (cf. Kleiman's theorem): for a connected algebraic group G, and any homogeneous G-variety X, and two varieties Y and Z mapping to X, let Yσ be the variety obtained by letting σ ∈ G act on Y. Then, there is an open dense subscheme H of G such that for σ ∈ H,  is either empty or purely of the (expected) dimension dim Y + dim Z − dim X. If, in addition, Y and Z are smooth and the base field has characteristic zero, then H may be taken such that   is smooth for all , as well. The above theorem of Bertini is the special case where  is expressed as the quotient of SLn by the parabolic subgroup of upper triangular matrices, Z is a subvariety and Y is a hyperplane.\n\nTheorem of Bertini has also been generalized to discrete valuation domains or finite fields, or for étale coverings of X.\n\nThe theorem is often used for induction steps.\n\n Notes \n\n References \n \nBertini and his two fundamental theorems by Steven L. Kleiman, on the life and works of Eugenio Bertini\n\nCategory:Geometry of divisors\nCategory:Theorems in algebraic geometry"
    },
    {
      "title": "Theorem on formal functions",
      "url": "https://en.wikipedia.org/wiki/Theorem_on_formal_functions",
      "text": "In algebraic geometry, the theorem on formal functions states the following:\nLet  be a proper morphism of noetherian schemes with a coherent sheaf  on X. Let  be a closed subscheme of S defined by  and  formal completions with respect to  and . Then for each  the canonical (continuous) map:\n\nis an isomorphism of (topological) -modules, where\nThe left term is .\n\nThe canonical map is one obtained by passage to limit.\n\nThe theorem is used to deduce some other important theorems: Stein factorization and a version of Zariski's main theorem that says that a proper birational morphism into a normal variety is an isomorphism. Some other corollaries (with the notations as above) are:\n\nCorollary: For any , topologically,\n\nwhere the completion on the left is with respect to .\n\nCorollary: Let r be such that  for all . Then\n\nCorollay:The same argument as in the preceding corollary For each , there exists an open neighborhood U of s such that\n\nCorollary: If , then  is connected for all .\n\nThe theorem also leads to the Grothendieck existence theorem, which gives an equivalence between the category of coherent sheaves on a scheme and the category of coherent sheaves on its formal completion (in particular, it yields algebralizability.)\n\nFinally, it is possible to weaken the hypothesis in the theorem; cf. Illusie. According to Illusie (pg. 204), the proof given in EGA III is due to Serre. The original proof (due to Grothendieck) was never published.\n\n The construction of the canonical map \nLet the setting be as in the lede. In the proof one uses the following alternative definition of the canonical map.\n\nLet  be the canonical maps. Then we have the base change map of -modules\n.\nwhere  is induced by . Since  is coherent, we can identify  with . Since  is also coherent (as f is proper), doing the same identification, the above reads:\n.\nUsing  where  and , one also obtains (after passing to limit):\n\nwhere  are as before. One can verify that the composition of the two maps is the same map in the lede. (cf. EGA III-1, section 4)\n\n Notes \n\n References \nLuc Illusie, Topics in Algebraic Geometry\n\nCategory:Theorems in algebraic geometry"
    },
    {
      "title": "Torelli theorem",
      "url": "https://en.wikipedia.org/wiki/Torelli_theorem",
      "text": "In mathematics, the Torelli theorem, named after Ruggiero Torelli, is a classical result of algebraic geometry over the complex number field, stating that a non-singular projective algebraic curve (compact Riemann surface) C is determined by its Jacobian variety J(C), when the latter is given in the form of a principally polarized abelian variety. In other words, the complex torus J(C), with certain 'markings', is enough to recover C. The same statement holds over any algebraically closed field.James S. Milne, Jacobian Varieties, Theorem 12.1 in   From more precise information on the constructed isomorphism of the curves it follows that if the canonically principally polarized Jacobian varieties of curves of genus  are k-isomorphic for k any perfect field, so are the curves.James S. Milne, Jacobian Varieties, Corollary 12.2 in \n\nThis result has had many important extensions. It can be recast to read that a certain natural morphism, the period mapping, from the moduli space of curves of a fixed genus, to a moduli space of abelian varieties, is injective (on geometric points). Generalizations are in two directions. Firstly, to geometric questions about that morphism, for example the local Torelli theorem. Secondly, to other period mappings. A case that has been investigated deeply is for K3 surfaces (by Viktor S. Kulikov, Ilya Pyatetskii-Shapiro, Igor Shafarevich and Fedor Bogomolov)Compact fibrations with hyperkähler fibers and hyperkähler manifolds (by Misha Verbitsky, Eyal Markman and Daniel Huybrechts).Automorphisms of Hyperkähler manifolds\n\n Notes \n\nReferences\n\n \n \n\nCategory:Algebraic curves\nCategory:Abelian varieties\nCategory:Moduli theory\nCategory:Theorems in complex geometry\nCategory:Theorems in algebraic geometry"
    },
    {
      "title": "Torsion conjecture",
      "url": "https://en.wikipedia.org/wiki/Torsion_conjecture",
      "text": "In algebraic geometry and number theory, the torsion conjecture or uniform boundedness conjecture for abelian varieties states that the order of the torsion group of an abelian variety over a number field can be bounded in terms of the dimension of the variety and the number field. A stronger version of the conjecture is that the torsion is bounded in terms of the dimension of the variety and the degree of the number field.\n\nElliptic curves\nThe (strong) torsion conjecture was first posed by Andrew Ogg in 1973 has been completely resolved in the case of elliptic curves. Barry Mazur proved uniform boundedness for elliptic curves over the rationals. His techniques were generalized by  and , who obtained uniform boundedness for quadratic fields and number fields of degree at most 8 respectively. Finally, Loïc Merel () proved the conjecture for elliptic curves over any number field. The proof centers around a careful study of the rational points on classical modular curves. An effective bound for the size of the torsion group in terms of the degree of the number field was given by .\n\nMazur provided a complete list of possible torsion subgroups for rational elliptic curves. If Cn denotes the cyclic group of order n, then the possible torsion subgroups are Cn with 1 ≤ n ≤ 10, and also C12; and the direct sum of C2 with C2, C4, C6 or C8. In the opposite direction, all these torsion structures occur infinitely often over Q, since the corresponding modular curves are all genus zero curves with a rational point. A complete list of possible torsion groups is also available for elliptic curves over quadratic number fields, and there are substantial partial results for cubic and quartic number fields .\n\nReferences\n\nCategory:Abelian varieties\nCategory:Conjectures\nCategory:Diophantine geometry\nCategory:Theorems in number theory\nCategory:Theorems in algebraic geometry"
    },
    {
      "title": "Tsen's theorem",
      "url": "https://en.wikipedia.org/wiki/Tsen%27s_theorem",
      "text": "In mathematics, Tsen's theorem states that a function field K of an algebraic curve over an algebraically closed field is quasi-algebraically closed (i.e., C1). This implies that the Brauer group of any such field vanishes, and more generally that all the Galois cohomology groups H i(K, K*) vanish for i ≥ 1. This result is used to calculate the étale cohomology groups of an algebraic curve.\n \nThe theorem was published by Chiungtze C. Tsen in 1933.\n\nSee also\n Tsen rank\n\nReferences\n\n \n \n \n \n\nCategory:Theorems in algebraic geometry"
    },
    {
      "title": "Veblen–Young theorem",
      "url": "https://en.wikipedia.org/wiki/Veblen%E2%80%93Young_theorem",
      "text": "In mathematics, the Veblen–Young theorem, proved by , states that a projective space of dimension at least 3 can be constructed as the projective space associated to a vector space over a division ring.\n\nNon-Desarguesian planes give examples of 2-dimensional projective spaces that do not arise from vector spaces over division rings, showing that the restriction to dimension at least 3 is necessary.\n\nJacques Tits generalized the Veblen–Young theorem to Tits buildings, showing that those of rank at least 3 arise from algebraic groups.\n\n generalized the Veblen–Young theorem to continuous geometry, showing that a complemented modular lattice of order at least 4 is isomorphic to the principal right ideals of a von Neumann regular ring.\n\nStatement\n\nA projective space S can be defined abstractly as a set P (the set of points), together with a set L of subsets of P (the set of lines), satisfying these axioms :\n Each two distinct points p and q are in exactly one line.\n Veblen's axiom: If a, b, c, d are distinct points and the lines through ab and cd meet, then so do the lines through ac and bd.\n Any line has at least 3 points on it.\n\nThe Veblen–Young theorem states that  if the dimension of a projective space is at least 3 (meaning that there are two non-intersecting lines) then  the  projective space is isomorphic with the projective space of lines in a vector space  over some division ring K.\n\nReferences\n\nCategory:Theorems in projective geometry\nCategory:Theorems in algebraic geometry"
    },
    {
      "title": "Weber's theorem",
      "url": "https://en.wikipedia.org/wiki/Weber%27s_theorem",
      "text": "In mathematics, Weber's theorem, named after Heinrich Martin Weber, is a result on algebraic curves. It states the following.\n\n Consider two non-singular curves C and C′ having the same genus g > 1. If there is a rational correspondence φ between C and C′, then φ is a birational transformation.\n\nReferences\n \n \n\nExternal links\n \n\nCategory:Algebraic curves\nCategory:Theorems in algebraic geometry"
    },
    {
      "title": "Weil reciprocity law",
      "url": "https://en.wikipedia.org/wiki/Weil_reciprocity_law",
      "text": "In mathematics, the Weil reciprocity law is a result of André Weil holding in the function field K(C) of an algebraic curve C over an algebraically closed field K. Given functions f and g in K(C), i.e. rational functions on C, then\n\nf((g)) = g((f))\n\nwhere the notation has this meaning: (h) is the divisor of the function h, or in other words the formal sum of its zeroes and poles counted with multiplicity; and a function applied to a formal sum means the product (with multiplicities, poles counting as a negative multiplicity) of the values of the function at the points of the divisor. With this definition there must be the side-condition, that the divisors of f and g have disjoint support (which can be removed).\n\nIn the case of the projective line, this can be proved by manipulations with the resultant of polynomials.\n\nTo remove the condition of disjoint support, for each point P on C a local symbol\n\n(f, g)P\n\nis defined, in such a way that the statement given is equivalent to saying that the product over all P of the local symbols is 1. When f and g both take the values 0 or ∞ at P, the definition is essentially in limiting or removable singularity terms, by considering (up to sign)\n\nfagb\n\nwith a and b such that the function has neither a zero nor a pole at P. This is achieved by taking a to be the multiplicity of g at P, and −b the multiplicity of f at P. The definition is then\n\n(f, g)P =  (−1)ab fagb.\n\nSee for example Jean-Pierre Serre, Groupes algébriques et corps de classes, pp. 44–46, for this as a special case of a theory on mapping algebraic curves into commutative groups.\n\nThere is a generalisation of Serge Lang to abelian varieties (Lang, Abelian Varieties).\n\nReferences\nAndré Weil, Oeuvres Scientifiques I, p. 291 (in Lettre à Artin, a 1942 letter to Artin, explaining the 1940 Comptes Rendus note Sur les fonctions algébriques à corps de constantes finis)\n  for a proof in the Riemann surface case\n \n \n\nCategory:Algebraic curves\nCategory:Theorems in algebraic geometry"
    },
    {
      "title": "Zariski's connectedness theorem",
      "url": "https://en.wikipedia.org/wiki/Zariski%27s_connectedness_theorem",
      "text": "In algebraic geometry, Zariski's connectedness theorem (due to Oscar Zariski) says that under certain conditions the fibers of a morphism of varieties are connected. It is an extension of Zariski's main theorem to the case when the morphism of varieties need not be birational.\n\nZariski's connectedness theorem gives a rigorous version of the \"principle of degeneration\" introduced by Federigo Enriques, which says roughly that a limit of absolutely irreducible cycles is absolutely connected.\n\nStatement\n\nSuppose that f is a proper surjective morphism of varieties from X to Y such that the function field of Y is separably closed in that of X. Then Zariski's connectedness theorem says that the inverse image of any normal point of Y is connected. An alternative version says that if f is proper and f* OX = OY, then f is surjective and the inverse image of any point of Y is connected.\n\nReferences\n\nCategory:Theorems in algebraic geometry"
    },
    {
      "title": "Zariski's main theorem",
      "url": "https://en.wikipedia.org/wiki/Zariski%27s_main_theorem",
      "text": "In algebraic geometry, Zariski's main theorem, proved by , is a statement about the structure of birational morphisms stating roughly that there is only one branch at any normal point of a variety. It is the special case of Zariski's connectedness theorem when the two varieties are birational.\n\nZariski's main theorem can be stated in several ways which at first sight seem to be quite different, but are in fact deeply related. Some of the variations that have been called Zariski's main theorem are as follows:\nThe total transform of a normal fundamental point of a birational map has positive dimension. This is essentially Zariski's original form of his main theorem.\nA birational morphism with finite fibers to a normal variety is an isomorphism to an open subset. \nThe total transform of a normal point under a proper birational morphism is connected. \nA closely related theorem of Grothendieck describes the structure of quasi-finite morphisms of schemes, which implies Zariski's original main theorem.\nSeveral results in commutative algebra that imply the geometric form of Zariski's main theorem.\nA normal local ring is unibranch, which is a variation of the statement that the transform of a normal point is connected. \nThe local ring of a normal point of a variety is analytically normal. This is a strong form of the statement that it is unibranch.\n\nThe name \"Zariski's main theorem\" comes from the fact that Zariski labelled it as the \"MAIN THEOREM\" in  .\n\nZariski's main theorem for birational morphisms\n\nLet f be a birational mapping of algebraic varieties V and W. Recall that f is defined by a closed subvariety  (a \"graph\" of f) such that the projection on the first factor  induces an isomorphism between an open  and , and such that  is an isomorphism on U too. The complement of U in V is called a fundamental variety or indeterminancy locus, and an image of a subset of V under  is called a total transform of it.\n\nThe original statement of the  theorem in   reads:\nMAIN THEOREM: If W is an irreducible fundamental variety on V of a birational correspondence T between V and V′ and if T has no fundamental elements on V′ then — under the assumption that V is locally normal at W — each irreducible component of the transform T[W] is of higher dimension than W.\nHere T is essentially a morphism from V′ to V that is birational, W is a subvariety of the set where the inverse of T is not defined whose local ring is normal, and the transform T[W] means the inverse image of W under the morphism from V′ to V.\n\nHere are some variants of this theorem stated using more recent terminology.  calls the following connectedness statement \"Zariski's Main theorem\":\nIf f:X→Y is a birational projective morphism between noetherian integral schemes,  then the inverse image of every normal point of Y is connected.\nThe following consequence of it (Theorem V.5.2,loc.cit.) also goes under this name:\nIf f:X→Y is a birational transformation of projective varieties with Y normal, then the total transform of a fundamental point of f is connected and of dimension at least 1.\n\nExamples\n\nSuppose that V is a smooth variety of dimension greater than 1 and V′ is given by blowing up a point W on V. Then V is normal at W, and the component of the transform of W is a projective space, which has dimension greater than W as predicted by Zariski's original form of his main theorem.\nIn the previous example the transform of W was irreducible. It is easy to find examples where the total transform is reducible by blowing up other points on the transform. For example, if V′ is given by blowing up a point W on V and then blowing up another point on this transform, the total transform of W has 2 irreducible components meeting at a point. As predicted by Hartshorne's form of the main theorem, the total transform is connected and of dimension at least 1.\nFor an example where W is not normal and the conclusion of the main theorem fails, take V′ to be a smooth variety, and take V to be given by identifying two distinct points on V′, and take W to be the image of these two points. Then W is not normal, and the transform of W consists of two points, which is not connected and does not have positive dimension.\n\nZariski's main theorem for quasifinite morphisms\n\nIn EGA III, Grothendieck calls the following statement which does not involve connectedness a \"Main theorem\"  of Zariski :\nIf f:X→Y is a quasi-projective morphism of Noetherian schemes then the set of points that are isolated in their fiber is open in X. Moreover the induced scheme  of this set is isomorphic to  an open subset of a scheme that is finite over Y.\n\nIn EGA IV, Grothendieck observed that the last statement could be deduced from a more general theorem about the structure of quasi-finite morphisms, and the latter is often referred to as the \"Zariski's main theorem in the form of Grothendieck\".\nIt is well known that  open immersions and finite morphisms are quasi-finite. Grothendieck proved that under the hypothesis of separatedness all quasi-finite morphisms are compositions of such :\nif Y is a quasi-compact separated scheme and  is a separated, quasi-finite, finitely presented morphism  then there is a factorization into , where the first map is an open immersion and the second one is finite.\n\nThe relation between this theorem about quasi-finite morphisms and Théorème 4.4.3 of EGA III quoted above is that \nif f:X→Y is a projective morphism of varieties, then the set of points that are isolated in their fiber is quasifinite over Y. Then structure theorem for quasi-finite morphisms applies and yields the desired result.\n\nZariski's main theorem for commutative rings\n reformulated his main theorem in terms of commutative algebra as a statement about local rings.  generalized Zariski's formulation as follows: \nIf B is an algebra of finite type over a local Noetherian ring A, and n is a maximal ideal of B which is minimal among ideals of B whose  inverse image in A is the maximal ideal m of A, then there is a finite A-algebra A′ with a maximal ideal m′ (whose inverse image in A is m) such that the localization Bn is isomorphic to the A-algebra A′m′.\nIf in addition A and B are integral and have the same field of fractions, and A is integrally closed, then this theorem implies that A and B are equal. This is essentially Zariski's formulation of his main theorem in terms of commutative rings.\n\nZariski's main theorem: topological form\n\nA topological version of Zariski's main theorem says that if x is a (closed) point of a normal complex variety it is unibranch; in other words there are arbitrarily small neighborhoods U of x such that the set of non-singular points of U is connected .\n\nThe property of being normal is stronger than the property of being unibranch: for example, a cusp of a plane curve is unibranch but not normal.\n\nZariski's main theorem: power series form\n\nA formal power series version of Zariski's main theorem says that if x is a normal  point of a variety then it is analytically normal; in other words the completion of the local ring at x is a normal integral domain .\n\nSee also\n Deligne's connectedness theorem\n Fulton–Hansen connectedness theorem\n Grothendieck's connectedness theorem\n Stein factorization\n Theorem on formal functions\n\nReferences\n\n \n\n \n \n \n\n External links \nhttp://mathoverflow.net/questions/78696/is-there-an-intuitive-reason-for-zariskis-main-theorem/78741\n\nCategory:Theorems in algebraic geometry"
    },
    {
      "title": "Albert–Brauer–Hasse–Noether theorem",
      "url": "https://en.wikipedia.org/wiki/Albert%E2%80%93Brauer%E2%80%93Hasse%E2%80%93Noether_theorem",
      "text": "In algebraic number theory, the Albert–Brauer–Hasse–Noether theorem states that a central simple algebra over an algebraic number field K which splits over every completion Kv is a matrix algebra over K. The theorem is an example of a local-global principle in algebraic number theory and \nleads to a complete description of finite-dimensional division algebras over algebraic number fields in terms of their local invariants. It was proved independently by Richard Brauer, Helmut Hasse, and Emmy Noether and by Abraham Adrian Albert.\n\n Statement of the theorem \n\nLet A be a central simple algebra of rank d over an algebraic number field K. Suppose that for any valuation v, A splits over the corresponding local field Kv:\n\n \n\nThen A is isomorphic to the matrix algebra Md(K).\n\n Applications \n\nUsing the theory of Brauer group, one shows that two central simple algebras A and B over an algebraic number field K are isomorphic over K if and only if their completions Av and Bv are isomorphic over the completion Kv for every v.\n\nTogether with the Grunwald–Wang theorem, the Albert–Brauer–Hasse–Noether theorem implies that every central simple algebra over an algebraic number field is cyclic, i.e. can be obtained by an explicit construction from a cyclic field extension L/K .\n\n See also \n\n Class field theory\n Hasse norm theorem\n\nReferences\n\n \n \n\n \n \n Revised version — \n Albert, Nancy E. (2005), \"A Cubed & His Algebra, iUniverse, \n\n Notes \n\nCategory:Class field theory\nCategory:Theorems in algebraic number theory"
    },
    {
      "title": "Ankeny–Artin–Chowla congruence",
      "url": "https://en.wikipedia.org/wiki/Ankeny%E2%80%93Artin%E2%80%93Chowla_congruence",
      "text": "In number theory, the Ankeny–Artin–Chowla congruence is a result published in 1953 by N. C. Ankeny, Emil Artin and S. Chowla. It concerns the class number h of a real quadratic field of discriminant d > 0. If the fundamental unit of the field is\n\nwith integers t and u, it expresses in another form\n\nfor any prime number p > 2 that divides d. In case p > 3 it states that\n\nwhere    and    is the Dirichlet character for the quadratic field. For p = 3 there is a factor (1 + m) multiplying the LHS. Here\n\nrepresents the floor function of x.\n\nA related result is that if d=p is congruent to one mod four, then\n\nwhere Bn is the nth Bernoulli number.\n\nThere are some generalisations of these basic results, in the papers of the authors.\n\nReferences\n\nCategory:Theorems in algebraic number theory"
    },
    {
      "title": "Bauerian extension",
      "url": "https://en.wikipedia.org/wiki/Bauerian_extension",
      "text": "In mathematics, in the field of algebraic number theory, a Bauerian extension is a field extension of an algebraic number field which is characterized by the prime ideals with inertial degree one in the extension.\n\nFor a finite degree extension L/K of an algebraic number field K we define P(L/K) to be the set of primes p of K which have a factor P with inertial degree one (that is, the residue field of P has the same order as the residue field of p).\n\nBauer's theorem states that if M/K is a finite degree Galois extension, then P(M/K) ⊇ P(L/K) if and only if M ⊆ L.  In particular, finite degree Galois extensions N of K are characterised by set of prime ideals which split completely in N.\n\nAn extension F/K is Bauerian if it obeys Bauer's theorem: that is, for every finite extension L of K, we have P(F/K) ⊇ P(L/K) if and only if L contains a subfield K-isomorphic to F.\n\nAll field extensions of degree at most 4 over Q are Bauerian.Narkiewicz (1990) p.416\nAn example of a non-Bauerian extension is the Galois extension of Q by the roots of 2x5 − 32x + 1, which has Galois group S5.Narkiewicz (1990) p.394\n\nSee also\n Splitting of prime ideals in Galois extensions\n\nReferences\n\n  \n \n\nCategory:Theorems in algebraic number theory"
    },
    {
      "title": "Brauer–Siegel theorem",
      "url": "https://en.wikipedia.org/wiki/Brauer%E2%80%93Siegel_theorem",
      "text": "In mathematics, the Brauer–Siegel theorem, named after Richard Brauer and Carl Ludwig Siegel, is an asymptotic result on the behaviour of algebraic number fields, obtained by Richard Brauer and Carl Ludwig Siegel. It attempts to generalise the results known on the class numbers of imaginary quadratic fields, to a more general sequence of number fields\n\nIn all cases other than the rational field Q and imaginary quadratic fields, the regulator Ri of Ki must be taken into account, because Ki then has units of infinite order by Dirichlet's unit theorem. The quantitative hypothesis of the standard Brauer–Siegel theorem is that if Di is the discriminant of Ki, then\n\n \n\nAssuming that, and the algebraic hypothesis that Ki is a Galois extension of Q, the conclusion is that\n\n \n\nwhere hi is the class number of Ki. If one assumes that all the degrees  are bounded above by a uniform constant\nN, then one may drop the assumption of normality - this is what is actually proved in Brauer's paper. \n\nThis result is ineffective, as indeed was the result on quadratic fields on which it built. Effective results in the same direction were initiated in work of Harold Stark from the early 1970s.\n\nReferences\n Richard Brauer, On the Zeta-Function of Algebraic Number Fields, American Journal of Mathematics 69 (1947), 243–250.\n\nCategory:Analytic number theory\nCategory:Theorems in algebraic number theory"
    },
    {
      "title": "Chebotarev's density theorem",
      "url": "https://en.wikipedia.org/wiki/Chebotarev%27s_density_theorem",
      "text": "Chebotarev's density theorem in algebraic number theory describes statistically the splitting of primes in a given Galois extension K of the field  of rational numbers. Generally speaking, a prime integer will factor into several ideal primes in the ring of algebraic integers of K. There are only finitely many patterns of splitting that may occur. Although the full description of the splitting of every prime p in a general Galois extension is a major unsolved problem, the Chebotarev density theorem says that the frequency of the occurrence of a given pattern, for all primes p less than a large integer N, tends to a certain limit as N goes to infinity.  It was proved by Nikolai Chebotaryov in his thesis in 1922, published in .\n\nA special case that is easier to state says that if K is an algebraic number field which is a Galois extension of  of degree n, then the prime numbers that completely split in K have density \n\n1/n\n\namong all primes. More generally, splitting behavior can be specified by assigning to (almost) every prime number an invariant, its Frobenius element, which is a representative of a well-defined conjugacy class in the Galois group \n\nGal(K/Q).\n\nThen the theorem says that the asymptotic distribution of these invariants is uniform over the group, so that a conjugacy class with k elements occurs with frequency asymptotic to \n\nk/n.\n\n History and motivation \n\nWhen Carl Friedrich Gauss first introduced the notion of complex integers Z[i], he observed that the ordinary prime numbers may factor further in this new set of integers.  In fact, if a prime p is congruent to 1 mod 4, then it factors into a product of two distinct prime gaussian integers, or \"splits completely\"; if p is congruent to 3 mod 4, then it remains prime, or is \"inert\"; and if p is 2 then it becomes a product of the square of the prime (1+i) and the invertible gaussian integer -i; we say that 2 \"ramifies\". For instance, \n\n  splits completely;\n  is inert;\n  ramifies.\n\nFrom this description, it appears that as one considers larger and larger primes, the frequency of a prime splitting completely approaches 1/2, and likewise for the primes that remain primes in Z[i]. Dirichlet's theorem on arithmetic progressions demonstrates that this is indeed the case. Even though the prime numbers themselves appear rather erratically, splitting of the primes in the extension \n\n \n\nfollows a simple statistical law.\n\nSimilar statistical laws also hold for splitting of primes in the cyclotomic extensions, obtained from the field of rational numbers by adjoining a primitive root of unity of a given order. For example, the ordinary integer primes group into four classes, each with probability 1/4, according to their pattern of splitting in the ring of integers corresponding to the 8th roots of unity. \nIn this case, the field extension has degree 4 and is abelian, with the Galois group isomorphic to the Klein four-group. It turned out that the Galois group of the extension plays a key role in the pattern of splitting of primes. Georg Frobenius established the framework for investigating this pattern and proved a special case of the theorem. The general statement was proved by Nikolai Grigoryevich Chebotaryov in 1922.\n\n Relation with Dirichlet's theorem \n\nThe Chebotarev density theorem may be viewed as a generalisation of Dirichlet's theorem on arithmetic progressions. A quantitative form of Dirichlet's theorem states that if N≥2 is an integer and a is coprime to N, then the proportion of the primes p congruent to a mod N is asymptotic to 1/n, where n=φ(N) is the Euler totient function. This is a special case of the Chebotarev density theorem for the Nth cyclotomic field K. Indeed, the Galois group of K/Q is abelian and can be canonically identified with the group of invertible residue classes mod N. The splitting invariant of a prime p not dividing N is simply its residue class because the number of distinct primes into which p splits is φ(N)/m, where m is multiplicative order of p modulo N; hence by the Chebotarev density theorem, primes are asymptotically uniformly distributed among different residue classes coprime to N.\n\nFormulation\n\nIn their survey article,  give an earlier result of Frobenius in this area. Suppose K is a Galois extension of the rational number field Q, and P(t) a monic integer polynomial such that K is a splitting field of P. It makes sense to factorise P modulo a prime number p. Its 'splitting type' is the list of degrees of irreducible factors of P mod p, i.e. P factorizes in some fashion over the prime field Fp. If n is the degree of P, then the splitting type is a partition Π of n. Considering also the Galois group G of K over Q, each g in G is a permutation of the roots of P in K; in other words by choosing an ordering of α and its algebraic conjugates, G is faithfully represented as a subgroup of the symmetric group Sn. We can write g by means of its cycle representation, which gives a 'cycle type' c(g), again a partition of n.\n\nThe theorem of Frobenius states that for any given choice of Π the primes p for which the splitting type of P mod p is Π has a natural density δ, with δ equal to the proportion of g in G that have cycle type Π.\n\nThe statement of the more general Chebotarev theorem is in terms of the Frobenius element of a prime (ideal), which is in fact an associated conjugacy class C of elements of the Galois group G. If we fix C then the theorem says that asymptotically a proportion |C|/|G| of primes have associated Frobenius element as C. When G is abelian the classes of course each have size 1. For the case of a non-abelian group of order 6 they have size 1, 2 and 3, and there are correspondingly (for example) 50% of primes p that have an order 2 element as their Frobenius. So these primes have residue degree 2, so they split into exactly three prime ideals in a degree 6 extension of Q with it as Galois group.This particular example already follows from the Frobenius result, because G is a symmetric group. In general, conjugacy in G is more demanding than having the same cycle type.\n\nStatement\nLet L be a finite Galois extension of a number field K with Galois group G. Let X be a subset of G that is stable under conjugation. The set of primes v of K that are unramified in L and whose associated Frobenius conjugacy class Fv is contained in X has density\nSection I.2.2 of Serre\nThe statement is valid when the density refers to either the natural density or the analytic density of the set of primes.\n\nEffective Version\nThe Generalized Riemann hypothesis implies an effective version of the Chebotarev density theorem: if L/K is a finite Galois extension with Galois group G, and C a union of conjugacy classes of G, the number of unramified primes of K of norm below x with Frobenius conjugacy class in C is\n\nwhere the constant implied in the big-O notation is absolute, n is the degree of L over Q, and Δ its discriminant.\n\nThe effective form of Chebotarev's density theory becomes much weaker without GRH. Take L to be a finite Galois extension of Q with Galois group G and degree d. Take  to be a nontrivial irreducible representation of G of degree n, and take  to be the Artin conductor of this representation. Suppose that, for  a subrepresentation of  or ,  is entire; that is, the Artin conjecture is satisfied for all . Take  to be the character associated to . Then there is an absolute positive  such that, for ,\n\nwhere  is 1 if  is trivial and is otherwise 0, and where  is an exceptional real zero of ; if there is no such zero, the  term can be ignored. The implicit constant of this  expression is absolute. \nInfinite extensions\nThe statement of the Chebotarev density theorem can be generalized to the case of an infinite Galois extension L / K that is unramified outside a finite set S of primes of K (i.e. if there is a finite set S of primes of K such that any prime of K not in S is unramified in the extension L / K). In this case, the Galois group G of L / K is a profinite group equipped with the Krull topology. Since G is compact in this topology, there is a unique Haar measure μ on G. For every prime v of K not in S there is an associated Frobenius conjugacy class Fv. The Chebotarev density theorem in this situation can be stated as follows:\n\nLet X be a subset of G that is stable under conjugation and whose boundary has Haar measure zero. Then, the set of primes v of K not in S such that Fv ⊆ X has density\n\nThis reduces to the finite case when L / K is finite (the Haar measure is then just the counting measure).\n\nA consequence of this version of the theorem is that the Frobenius elements of the unramified primes of L are dense in G.\n\nImportant consequences\nThe Chebotarev density theorem reduces the problem of classifying Galois extensions of a number field to that of describing the splitting of primes in extensions. Specifically, it implies that as a Galois extension of K, L is uniquely determined by the set of primes of K that split completely in it.Corollary VII.13.10 of Neukirch A related corollary is that if almost all prime ideals of K split completely in L, then in fact L = K.Corollary VII.13.7 of Neukirch\n\nNotes\n\nReferences\n\n\t\t\n\nCategory:Theorems in algebraic number theory\nCategory:Analytic number theory"
    },
    {
      "title": "Dirichlet's unit theorem",
      "url": "https://en.wikipedia.org/wiki/Dirichlet%27s_unit_theorem",
      "text": "In mathematics, Dirichlet's unit theorem is a basic result in algebraic number theory due to Peter Gustav Lejeune Dirichlet. It determines the rank of the group of units in the ring  of algebraic integers of a number field . The regulator is a positive real number that determines how \"dense\" the units are.\n\nThe statement is that the group of units is finitely generated and has rank (maximal number of multiplicatively independent elements) equal to\n\nwhere  is the number of real embeddings and  the number of conjugate pairs of complex embeddings of . This characterisation of  and  is based on the idea that there will be as many ways to embed  in the complex number field as the degree ; these will either be into the real numbers, or pairs of embeddings related by complex conjugation, so that\n\n.\n\nNote that if  is Galois over  then either =0 or =0.\n\nOther ways of determining  and  are\n\n use the primitive element theorem to write , and then  is the number of conjugates of  that are real,  the number that are complex; in other words, if  is the minimal polynomial of  over , then  is the number of real roots and  is the number of non-real complex roots of  (which come in complex conjugate pairs);\n write the tensor product of fields  as a product of fields, there being  copies of  and  copies of .\n\nAs an example, if  is a quadratic field, the rank is 1 if it is a real quadratic field, and 0 if an imaginary quadratic field. The theory for real quadratic fields is essentially the theory of Pell's equation.\n\nThe rank is positive for all number fields besides  and imaginary quadratic fields, which have rank 0. The 'size' of the units is measured in general by a determinant called the regulator. In principle a basis for the units can be effectively computed; in practice the calculations are quite involved when  is large.\n\nThe torsion in the group of units is the set of all roots of unity of , which form a finite cyclic group. For a number field with at least one real embedding the torsion must therefore be only . There are number fields, for example most imaginary quadratic fields, having no real embeddings which also have  for the torsion of its unit group.\n\nTotally real fields are special with respect to units. If  is a finite extension of number fields with degree greater than 1 and\nthe units groups for the integers of  and  have the same rank then  is totally real and  is a totally complex quadratic extension. The converse holds too. (An example is  equal to the rationals and  equal to an imaginary quadratic field; both have unit rank 0.)\n\nThe theorem not only applies to the maximal order  but to any order {{math|O ⊂ OK}}.\n\nThere is a generalisation of the unit theorem by Helmut Hasse (and later Claude Chevalley) to describe the structure of the group of -units, determining the rank of the unit group in localizations of rings of integers. Also, the Galois module structure of  has been determined.\n\nThe regulator\n\nSuppose that  are a set of generators for the unit group modulo roots of unity. If  is an algebraic number, write  for the different embeddings into  or , and set  to 1 or 2 if the corresponding embedding is real or complex respectively. Then the  matrix whose entries are ,   has the property that the sum of any row is zero (because all units have norm 1, and the log of the norm is the sum of the entries in a row). This implies that the absolute value  of the determinant of the submatrix formed by deleting one column is independent of the column. The number  is called the regulator of the algebraic number field (it does not depend on the choice of generators ). It measures the \"density\" of the units: if the regulator is small, this means that there are \"lots\" of units.\n\nThe regulator has the following geometric interpretation. The map taking a unit  to the vector with entries  has an image in the -dimensional subspace of  consisting of all vectors whose entries have sum 0, and by Dirichlet's unit theorem the image is a lattice in this subspace. The volume of a fundamental domain of this lattice is .\n\nThe regulator of an algebraic number field of degree greater than 2 is usually quite cumbersome to calculate, though there are now computer algebra packages that can do it in many cases. It is usually much easier to calculate the product  of the class number  and the regulator using the class number formula, and the main difficulty in calculating the class number of an algebraic number field is usually the calculation of the regulator.\n\nExamples\nthumb|300px|right|A fundamental domain in logarithmic space of the group of units of the cyclic cubic field  obtained by adjoining to  a root of . If  denotes a root of , then a set of fundamental units is , where  and . The area of the fundamental domain is approximately 0.910114, so the regulator of  is approximately 0.525455.\nThe regulator of an imaginary quadratic field, or of the rational integers, is 1 (as the determinant of a 0 × 0 matrix is 1).\nThe regulator of a real quadratic field is the logarithm of its fundamental unit: for example, that of  is . This can be seen as follows. A fundamental unit is , and its images under the two embeddings into  are  and . So the  matrix is\n\nThe regulator of the cyclic cubic field , where  is a root of , is approximately 0.5255. A basis of the group of units modulo roots of unity is  where  and .\n\nHigher regulators\n\nA 'higher' regulator refers to a construction for a function on an algebraic -group with index  that plays the same role as the classical regulator does for the group of units, which is a group . A theory of such regulators has been in development, with work of Armand Borel and others. Such higher regulators play a role, for example, in the Beilinson conjectures, and are expected to occur in evaluations of certain -functions at integer values of the argument. See also Beilinson regulator.\n\nStark regulator\nThe formulation of Stark's conjectures led Harold Stark to define what is now called the Stark regulator, similar to the classical regulator as a determinant of logarithms of units, attached to any Artin representation.\n\n-adic regulator\nLet  be a number field and for each prime  of  above some fixed rational prime , let  denote the local units at  and let  denote the subgroup of principal units in . Set\n\n \n\nThen let  denote the set of global units  that map to  via the diagonal embedding of the global units in .\n\nSince  is a finite-index subgroup of the global units, it is an abelian group of rank . The -adic regulator is the determinant of the matrix formed by the -adic logarithms of the generators of this group. Leopoldt's conjecture'' states that this determinant is non-zero.Neukirch et al. (2008) p. 626–627\n\nSee also\nElliptic unit\nCyclotomic unit\nShintani's unit theorem\n\nNotes\n\nReferences\n \n\n \n\nCategory:Theorems in algebraic number theory"
    },
    {
      "title": "Ferrero–Washington theorem",
      "url": "https://en.wikipedia.org/wiki/Ferrero%E2%80%93Washington_theorem",
      "text": "In algebraic number theory, the Ferrero–Washington theorem, proved first by  and later by ,  states that Iwasawa's μ-invariant vanishes for cyclotomic Zp-extensions of abelian algebraic number fields.\n\nHistory\n introduced the μ-invariant of a Zp-extension and observed that it was zero in all cases he calculated.  used a computer to check that it vanishes for the cyclotomic Zp-extension of the rationals for all primes less than 4000. \n later conjectured that the μ-invariant vanishes for any Zp-extension, but shortly after  discovered examples of non-cyclotomic extensions of number fields with non-vanishing μ-invariant showing that his original conjecture was wrong. He suggested, however, that the conjecture might still hold for cyclotomic Zp-extensions.\n\n showed that the vanishing of the μ-invariant for cyclotomic Zp-extensions of the rationals is equivalent to certain congruences between Bernoulli numbers, and  showed that the μ-invariant vanishes in these cases by proving that these congruences hold.\n\nStatement\nFor a number field K we let Km denote the extension by pm-power roots of unity,  the union of the Km and A(p) the maximal unramified abelian p-extension of .  Let the Tate module \n\nThen Tp(K) is a pro-p-group and so a Zp-module.  Using class field theory one can describe Tp(K) as isomorphic to the inverse limit of the class groups Cm of the Km under norm.\n\nIwasawa exhibited Tp(K) as a module over the completion Zp and this implies a formula for the exponent of p in the order of the class groups Cm of the form\n\nThe Ferrero–Washington theorem states that μ is zero.\n\nReferences\n\n (And correction )\n\nCategory:Theorems in algebraic number theory"
    },
    {
      "title": "Gras conjecture",
      "url": "https://en.wikipedia.org/wiki/Gras_conjecture",
      "text": "In algebraic number theory, the Gras conjecture  relates the p-parts of the Galois eigenspaces of an ideal class group to the group of global units modulo cyclotomic units. It was proved by  as a corollary of their work on the main conjecture of Iwasawa theory.  later gave a simpler proof using Euler systems.\n\nReferences\n\nCategory:Theorems in algebraic number theory\nCategory:Conjectures that have been proved"
    },
    {
      "title": "Gross–Koblitz formula",
      "url": "https://en.wikipedia.org/wiki/Gross%E2%80%93Koblitz_formula",
      "text": "In mathematics, the Gross–Koblitz formula, introduced by  expresses a Gauss sum using a product of values of the p-adic gamma function. It is an analog of the Chowla–Selberg formula for the usual gamma function. It implies the Hasse–Davenport relation and generalizes the Stickelberger theorem.\n gave another proof of the Gross–Koblitz formula using Dwork's work, and \n gave an elementary proof.\n\nStatement\n\nThe Gross–Koblitz formula states that the Gauss sum τ can be given in terms of the p-adic gamma function Γp by\n\nwhere\n q is a power pf  of a prime p\nr is an integer with 0 ≤ r < q–1\n r(i) is the integer whose base p expansion is a cyclic permutation of the f digits of r by i positions. \n sp(r) is the sum of the digits of r in base p\n\nwhere the sum is over roots of 1 in the extension Qp(π)\nπ satisfies πp – 1 = –p\nζπ is the pth root of 1 congruent to 1+π mod π2\n\nReferences\n\n \n\nCategory:Theorems in algebraic number theory"
    },
    {
      "title": "Grunwald–Wang theorem",
      "url": "https://en.wikipedia.org/wiki/Grunwald%E2%80%93Wang_theorem",
      "text": "In algebraic number theory, the Grunwald–Wang theorem is a local-global principle stating that—except in some precisely defined cases—an element x in a number field K is an nth power in K if it is an nth power in the completion  for all but finitely many primes  of K. For example, a rational number is a square of a rational number if it is a square of a p-adic number for almost all primes p. The Grunwald–Wang theorem is an example of a local-global principle.\n\nIt was introduced by , but there was a mistake in this original version that was found and corrected by . The theorem considered by Grunwald and Wang was more general than the one stated above as they discussed the existence of cyclic extensions with certain local properties, and the statement about nth powers is a consequence of this.\n\n History \n\n, a student of Helmut Hasse, gave an incorrect proof of the erroneous statement that an element in a number field is an nth power if it is an nth power locally almost everywhere.  gave another incorrect proof of this incorrect statement. However  discovered the following counter-example: 16 is a p-adic 8th power for all odd primes p, but is not a rational or 2-adic 8th power. In his doctoral thesis  written under Emil Artin, Wang gave and proved the correct formulation of Grunwald's assertion, by describing the rare cases when it fails. This result is what is now known as the Grunwald–Wang theorem. The history of Wang's counterexample is discussed by \n\n Wang's counter-example \n\nGrunwald's original claim that an element that is an nth power almost everywhere locally is an nth power globally can fail in two distinct ways: the element can be an nth power almost everywhere locally but not everywhere locally, or it can be an nth power everywhere locally but not globally.\n\nAn element that is an nth power almost everywhere locally but not everywhere locally\n\nThe element 16 in the rationals is an 8th power at all places except 2, but is not an 8th power in the 2-adic numbers.\n\nIt is clear that 16 is not a 2-adic 8th power, and hence not a rational 8th power, since the 2-adic valuation of 16 is 4 which is not divisible by 8.\n\nGenerally, 16 is an 8th power in a field K if and only if the polynomial  has a root in K. Write\n\nThus, 16 is an 8th power in K if and only if 2, −2 or −1 is a square in K. Let p be any odd prime. It follows from the multiplicativity of the Legendre symbol that 2, −2 or −1 is a square modulo p. Hence, by Hensel's lemma, 2, −2 or −1 is a square in .\n\nAn element that is an nth power everywhere locally but not globally\n\n16 is not an 8th power in  although it is an 8th power locally everywhere (i.e. in  for all p). This follows from the above and the equality .\n\n A consequence of Wang's counterexample \n\nWang's counterexample has the following interesting consequence showing that one cannot always find a cyclic Galois extension of a given degree of a number field in which finitely many given prime places split in a specified way:\n\nThere exists no cyclic degree 8 extension  in which the prime 2 is totally inert (i.e., such that  is unramified of degree 8).\n\n Special fields \n\nFor any  let\n\nNote that the th cyclotomic field is\n\nA field is called s-special if it contains , but neither ,  nor .\n\n Statement of the theorem \n\nConsider a number field K and a natural number n. Let S be a finite (possibly empty) set of primes of K and put\n\nThe Grunwald–Wang theorem says that\n\nunless we are in the special case which occurs when the following two conditions both hold:\n\n  is s-special with an  such that  divides n.\n  contains the special set  consisting of those (necessarily 2-adic) primes  such that  is s-special.\n\nIn the special case the failure of the Hasse principle is finite of order 2: the kernel of\n\n \n\nis Z/2Z, generated by the element η.\n\n Explanation of Wang's counter-example \n\nThe field of rational numbers  is 2-special since it contains , but neither ,  nor . The special set is . Thus, the special case in the Grunwald–Wang theorem occurs when n is divisible by 8, and S contains 2. This explains Wang's counter-example and shows that it is minimal. It is also seen that an element in  is an nth power if it is a p-adic nth power for all p.\n\nThe field  is 2-special as well, but with . This explains the other counter-example above.See Chapter X of Artin–Tate.\n\nSee also\n\nThe Hasse norm theorem states that for cyclic extensions an element is a norm if it is a norm everywhere locally.\n\nNotes\n\nReferences\n\nCategory:Class field theory\nCategory:Theorems in algebraic number theory"
    },
    {
      "title": "Hasse norm theorem",
      "url": "https://en.wikipedia.org/wiki/Hasse_norm_theorem",
      "text": "In number theory, the Hasse norm theorem states that if L/K is a cyclic extension of number fields, then if a nonzero element of K is a local norm everywhere, then it is a global norm.\nHere to be a global norm means to be an element k of K such that there is an element l of L with ; in other words k is a relative norm of some element of the extension field L. To be a local norm means that for some prime p of K and some prime P of L lying over K, then k is a norm from LP; here the \"prime\" p can be an archimedean valuation, and the theorem is a statement about completions in all valuations, archimedean and non-archimedean.\n\nThe theorem is no longer true in general if the extension is abelian but not cyclic. Hasse gave the counterexample that 3 is a local norm everywhere for the extension  but is not a global norm. Serre and Tate showed that another counterexample is given by the field  where every rational square is a local norm everywhere but  is not a global norm.\n\nThis is an example of a theorem stating a local-global principle. \n\nThe full theorem is  due to . The special case when the degree n of the extension is 2 was proved by , and the special case when n is prime was proved by . \n\nThe Hasse norm theorem can be deduced from the theorem that an element of the Galois cohomology group H2(L/K) is trivial if it is trivial locally everywhere, which is in turn equivalent to the deep theorem that the first cohomology of the idele class group vanishes. This is true for all finite Galois extensions of number fields, not just cyclic ones. For cyclic extensions the group  H2(L/K) is isomorphic to the Tate cohomology group H0(L/K) which describes which elements are norms, so for cyclic extensions it becomes Hasse's theorem that an element is a norm if it is a local norm everywhere.\n\nSee also\n\nGrunwald–Wang theorem, about when an element that is a power everywhere locally is a power.\n\nReferences\n\n H. Hasse, \"A history of class field theory\", in J.W.S. Cassels and A. Frohlich (edd), Algebraic number theory, Academic Press, 1973.  Chap.XI.\n G. Janusz, Algebraic number fields, Academic Press, 1973.  Theorem V.4.5, p. 156\n\nCategory:Class field theory\nCategory:Theorems in algebraic number theory"
    },
    {
      "title": "Hasse–Arf theorem",
      "url": "https://en.wikipedia.org/wiki/Hasse%E2%80%93Arf_theorem",
      "text": "In mathematics, specifically in local class field theory, the Hasse–Arf theorem is a result concerning jumps of the upper numbering filtration of the Galois group of a finite Galois extension.  A special case of it when the residue fields are finite  was originally proved by Helmut Hasse,H. Hasse, Führer, Diskriminante und Verzweigunsgskörper relativ Abelscher Zahlkörper, J. Reine Angew. Math. 162 (1930), pp.169–184.H. Hasse, Normenresttheorie galoisscher Zahlkörper mit Anwendungen auf Führer und Diskriminante abelscher Zahlkörper, J. Fac. Sci. Tokyo 2 (1934), pp.477–498. and the general result was proved by Cahit Arf.\n\nStatement\n\nHigher ramification groups\n\nThe theorem deals with the upper numbered higher ramification groups of a finite abelian extension L/K.  So assume L/K is a finite Galois extension, and that vK is a discrete normalised valuation of K, whose residue field has characteristic p > 0, and which admits a unique extension to L, say w.  Denote by vL the associated normalised valuation ew of L and let  be the valuation ring of L under vL.  Let L/K have Galois group G and define the s-th ramification group of L/K for any real s ≥ −1 by\n\nSo, for example, G−1 is the Galois group G.  To pass to the upper numbering one has to define the function ψL/K which in turn is the inverse of the function ηL/K defined by\n\nThe upper numbering of the ramification groups is then defined by Gt(L/K) = Gs(L/K) where s = ψL/K(t).\n\nThese higher ramification groups Gt(L/K) are defined for any real t ≥ −1, but since vL is a discrete valuation, the groups will change in discrete jumps and not continuously.  Thus we say that t is a jump of the filtration {Gt(L/K) : t ≥ −1} if Gt(L/K) ≠ Gu(L/K) for any u > t.  The Hasse–Arf theorem tells us the arithmetic nature of these jumps.\n\nStatement of the theorem\nWith the above set up, the theorem states that the jumps of the filtration {Gt(L/K) : t ≥ −1} are all rational integers.Neukirch (1999) Theorem 8.9, p.68\n\n Example \nSuppose G is cyclic of order ,  residue characteristic and  be the subgroup of  of order . The theorem says that there exist positive integers  such that\n\n...\nSerre (1979) IV.3, p.76\n\nNon-abelian extensions\n\nFor non-abelian extensions the jumps in the upper filtration need not be at integers. Serre gave an example of a totally ramified extension with Galois group the quaternion group Q8 of order 8 with\nG0 = Q8\nG1 = Q8\nG2 = Z/2Z\nG3 = Z/2Z\nG4 = 1\nThe upper numbering then satisfies\nGn = Q8 for n≤1\nGn =  Z/2Z for 1<n≤3/2\nGn = 1 for 3/2<n\nso has a jump at the non-integral value n=3/2.\n\nNotes\n\nReferences\n\n \n\nCategory:Galois theory\nCategory:Theorems in algebraic number theory"
    },
    {
      "title": "Hasse's theorem on elliptic curves",
      "url": "https://en.wikipedia.org/wiki/Hasse%27s_theorem_on_elliptic_curves",
      "text": "Hasse's theorem on elliptic curves, also referred to as the Hasse bound, provides an estimate of the number of points on an elliptic curve over a finite field, bounding the value both above and below.\n\nIf N is the number of points on the elliptic curve E over a finite field with  q elements, then Helmut Hasse's result states that\n\nThat is, the interpretation is that N differs from q + 1, the number of points of the projective line over the same field, by an 'error term' that is the sum of two complex numbers, each of absolute value .\n\nThis result had originally been conjectured by Emil Artin in his thesis.  It was proven by Hasse in 1933, with the proof published in a series of papers in 1936.\n\nHasse's theorem is equivalent to the determination of the absolute value of the roots of the local zeta-function of E.  In this form it can be seen to be the analogue of the Riemann hypothesis for the function field associated with the elliptic curve.\n\n Hasse-Weil Bound \n\nA generalization of the Hasse bound to higher genus algebraic curves is the Hasse–Weil bound.  This provides a bound on the number of points on a curve over a finite field.  If the number of points on the curve C of genus g over the finite field  of order q is , then\n\nThis result is again equivalent to the determination of the absolute value of the roots of the local zeta-function of C, and is the analogue of the Riemann hypothesis for the function field associated with the curve.\n\nThe Hasse–Weil bound reduces to the usual Hasse bound when applied to elliptic curves, which have genus g=1.\n\nThe Hasse–Weil bound is a consequence of the Weil conjectures, originally proposed by André Weil in 1949 and proved by André Weil in the case of curves.\n\nSee also\nSato–Tate conjecture\nSchoof's algorithm\n\n Notes \n\n References \n \n \nChapter V of \n\nCategory:Elliptic curves\nCategory:Finite fields\nCategory:Theorems in algebraic number theory"
    },
    {
      "title": "Herbrand–Ribet theorem",
      "url": "https://en.wikipedia.org/wiki/Herbrand%E2%80%93Ribet_theorem",
      "text": "In mathematics, the Herbrand–Ribet theorem is a result on the class group of certain number fields. It is a strengthening of Ernst Kummer's theorem to the effect that the prime p divides the class number of the cyclotomic field of p-th roots of unity if and only if p divides the numerator of the n-th Bernoulli number Bn \nfor some n, 0 < n < p − 1. The Herbrand–Ribet theorem specifies what, in particular, it means when p divides such an Bn.\n\n Statement \nThe Galois group Δ of the cyclotomic field of pth roots of unity for an odd prime p, Q(ζ) with ζp = 1, consists of the p − 1 group elements σa, where . As a consequence of Fermat's little theorem, in the ring of p-adic integers  we have p − 1 roots of unity, each of which is congruent mod p to some number in the range 1 to p − 1; we can therefore define a Dirichlet character ω (the Teichmüller character) with values in  by requiring that for n relatively prime to p, ω(n) be congruent to n modulo p. The p part of the class group is a -module (since it is p-primary), hence a module over the group ring . We now define idempotent elements of the group ring for each n from 1 to p − 1, as\n\nIt is easy to see that  and  where  is the Kronecker delta. This allows us to break up the p part of the ideal class group G of Q(ζ) by means of the idempotents; if G is the ideal class group, then, letting Gn = εn(G), we have .\n\nThe Herbrand–Ribet theorem states that for odd n, Gn is nontrivial if and only if p divides the Bernoulli number Bp−n. \n\nThe theorem makes no assertion about even values of n, but there is no known p for which Gn is nontrivial for any even n: triviality for all p would be a consequence of Vandiver's conjecture.\n\n Proofs \nThe part saying p divides Bp−n if Gn is not trivial is due to Jacques Herbrand. The converse, that if p divides Bp−n then Gn is not trivial is due to Kenneth Ribet, and is considerably more difficult. By class field theory, this can only be true if there is an unramified extension of the field of pth roots of unity by a cyclic extension of degree p which behaves in the specified way under the action of Σ; Ribet proves this by actually constructing such an extension using methods in the theory of modular forms. A more elementary proof of Ribet's converse to Herbrand's theorem, a consequence of the theory of Euler systems, can be found in Washington's book.\n\n Generalizations \nRibet's methods were pushed further by Barry Mazur and Andrew Wiles in order to prove the main conjecture of Iwasawa theory, a corollary of which is a strengthening of the Herbrand–Ribet theorem: the power of p dividing Bp−n is exactly the power of p dividing the order of Gn.\n\nSee also\nIwasawa theory\n\nNotes\n\nCategory:Cyclotomic fields\nCategory:Theorems in algebraic number theory"
    },
    {
      "title": "Hermite–Minkowski theorem",
      "url": "https://en.wikipedia.org/wiki/Hermite%E2%80%93Minkowski_theorem",
      "text": "In mathematics, especially in algebraic number theory, the Hermite–Minkowski theorem states that for any integer N there are only finitely many number fields, i.e., finite field extensions K of the rational numbers Q, such that the discriminant of K/Q is at most N.  The theorem is named after Charles Hermite and Hermann Minkowski.\n\nThis theorem is a consequence of the estimate for the discriminant\n\n \n\nwhere n is the degree of the field extension, together with Stirling's formula for n!. This inequality also shows that the discriminant of any number field strictly bigger than Q is not ±1, which in turn implies that Q has no unramified extensions.\n\nReferences\n Section III.2\n\nCategory:Theorems in algebraic number theory"
    },
    {
      "title": "Hilbert–Speiser theorem",
      "url": "https://en.wikipedia.org/wiki/Hilbert%E2%80%93Speiser_theorem",
      "text": "In mathematics, the Hilbert–Speiser theorem is a result on cyclotomic fields, characterising those with a normal integral basis. More generally, it applies to any finite abelian extension of , which by the Kronecker–Weber theorem are isomorphic to subfields of cyclotomic fields.\n\nHilbert–Speiser Theorem. A finite abelian extension  has a normal integral basis if and only if it is tamely ramified over . \n\nThis is the condition that it should be a subfield of  where  is a squarefree odd number. This result was introduced by   in his Zahlbericht and by .\n\nIn cases where the theorem states that a normal integral basis does exist, such a basis may be constructed by means of Gaussian periods. For example if we take  a prime number ,  has a normal integral basis consisting of all the -th roots of unity other than . For a field  contained in it, the field trace can be used to construct such a basis in  also (see the article on Gaussian periods). Then in the case of  squarefree and odd,  is a compositum of subfields of this type for the primes  dividing  (this follows from a simple argument on ramification). This decomposition can be used to treat any of its subfields.\n\n proved a converse to the Hilbert–Speiser theorem: \n\nEach finite tamely ramified abelian extension  of a fixed number field  has a relative normal integral basis if and only if .\n\nReferences\n\nCategory:Cyclotomic fields\nCategory:Theorems in algebraic number theory"
    },
    {
      "title": "Hilbert's Theorem 90",
      "url": "https://en.wikipedia.org/wiki/Hilbert%27s_Theorem_90",
      "text": "In abstract algebra, Hilbert's Theorem 90 (or Satz 90) is an important result on cyclic extensions of fields (or to one of its generalizations) that leads to Kummer theory. In its most basic form, it states that if L/K is a cyclic extension of fields with Galois group G = Gal(L/K) generated by an element  and if  is an element of L of relative norm 1, then there exists  in L such that\n\nThe theorem takes its name from the fact that it is the 90th theorem in David Hilbert's famous Zahlbericht , although it is originally due to . Often a more general theorem due to  is given the name, stating that if L/K is a finite Galois extension of fields with Galois group G = Gal(L/K), then the first cohomology group is trivial:\n\n Examples \nLet L/K be the quadratic extension  The Galois group is cyclic of order 2, its generator  acting via conjugation:\n\nAn element  in L has norm . An element of norm one corresponds to a rational solution of the equation  or in other words, a point with rational coordinates on the unit circle. Hilbert's Theorem 90 then states that every such element y of norm one can be parametrized (with integral c, d) as\n\nwhich may be viewed as a rational parametrization of the rational points on the unit circle. Rational points  on the unit circle  correspond to Pythagorean triples, i.e. triples  of integers satisfying \n\nCohomology\nThe theorem can be stated in terms of group cohomology: if L× is the multiplicative group of any (not necessarily finite) Galois extension L of a field K with corresponding Galois group G, then\n\nA further generalization using non-abelian group cohomology states that if H is either the general or special linear group over L, then\n\nThis is a generalization since  Another generalization is \n\n \n\nfor X a scheme, and another one to Milnor K-theory plays a role in Voevodsky's proof of the Milnor conjecture.\n\nProof\n\nElementary\nLet  be cyclic of degree  and  generate . Pick any  of norm \n\nBy clearing denominators, solving  is the same as showing that  has eigenvalue . Extend this to a map of -vector spaces\n\nThe primitive element theorem gives  for some . Since  has minimal polynomial \n\nwe identify\n\n \n\nvia \n\n \n\nHere we wrote the second factor as a -polynomial in .\n\nUnder this identification, our map \n\nThat is to say under this map \n\n is an eigenvector with eigenvalue  iff  has norm .\n\nReferences\n\nChapter II of J.S. Milne, Class Field Theory, available at his website .\n\nCategory:Theorems in algebraic number theory"
    },
    {
      "title": "Kronecker–Weber theorem",
      "url": "https://en.wikipedia.org/wiki/Kronecker%E2%80%93Weber_theorem",
      "text": "In algebraic number theory, it can be shown that every cyclotomic field is an abelian extension of the rational number field Q, having Galois group of the form . The Kronecker–Weber theorem provides a partial converse: every finite abelian extension of Q is contained within some cyclotomic field. In other words, every algebraic integer whose Galois group is abelian can be expressed as a sum of roots of unity with rational coefficients. For example,\n  and \nThe theorem is named after Leopold Kronecker and Heinrich Martin Weber.\n\nField-theoretic formulation\nThe Kronecker–Weber theorem can be stated in terms of fields and field extensions.\nPrecisely, the Kronecker–Weber theorem states: every finite abelian extension of the rational numbers Q is a subfield of a cyclotomic field.\nThat is, whenever an algebraic number field has a Galois group over Q that is an abelian group, the field is a subfield of a field obtained by adjoining a root of unity to the rational numbers.\n\nFor a given abelian extension K of Q there is  a minimal cyclotomic field that contains it. The theorem allows one to define the conductor of K as the smallest integer n such that K lies inside the field generated by the n-th roots of unity. For example the quadratic fields have as conductor the absolute value of their discriminant, a fact generalised in class field theory.\n\nHistory\nThe theorem was first stated by  though his argument  was not complete for extensions of degree a power of 2. \n published a proof, but this had some gaps and errors that were pointed out and corrected by . The first complete proof was given by .\n\nGeneralizations\n proved the local Kronecker–Weber theorem which states that any abelian extension of a local field can be constructed using cyclotomic extensions and Lubin–Tate extensions.   ,  and  gave other proofs.\n\nHilbert's twelfth problem asks for generalizations of the Kronecker–Weber theorem to base fields other than the rational numbers, and asks for the analogues of the roots of unity for those fields.\n\nReferences\n\nCategory:Class field theory\nCategory:Cyclotomic fields\nCategory:Theorems in algebraic number theory"
    },
    {
      "title": "Landau prime ideal theorem",
      "url": "https://en.wikipedia.org/wiki/Landau_prime_ideal_theorem",
      "text": "In algebraic number theory, the prime ideal theorem is the number field generalization of the prime number theorem. It provides an asymptotic formula for counting the number of prime ideals of a number field K, with norm at most X.\n\nExample\nWhat to expect can be seen already for the Gaussian integers. There for any prime number p of the form 4n + 1, p factors as a product of two Gaussian primes of norm p. Primes of the form 4n + 3 remain prime, giving a Gaussian prime of norm p2. Therefore, we should estimate\n\nwhere r counts primes in the arithmetic progression 4n + 1, and r′ in the arithmetic progression 4n + 3. By the quantitative form of Dirichlet's theorem on primes, each of  r(Y) and r′(Y) is asymptotically\n\nTherefore, the 2r(X) term predominates, and is asymptotically\n\nGeneral number fields\nThis general pattern holds for number fields in general, so that the prime ideal theorem is dominated by the ideals of norm a prime number. As Edmund Landau proved in , for norm at most X the same asymptotic formula\n\nalways holds. Heuristically this is because the logarithmic derivative of the Dedekind zeta-function of K always has a simple pole with residue −1 at s = 1.\n\nAs with the Prime Number Theorem, a more precise estimate may be given in terms of the logarithmic integral function.  The number of prime ideals of norm ≤ X is\n\nwhere cK is a constant depending on K.\n\nSee also\n Abstract analytic number theory\n\nReferences\n \n \n \n\nCategory:Theorems in analytic number theory\nCategory:Theorems in algebraic number theory"
    },
    {
      "title": "Local Tate duality",
      "url": "https://en.wikipedia.org/wiki/Local_Tate_duality",
      "text": "In Galois cohomology, local Tate duality (or simply local duality) is a duality for Galois modules for the absolute Galois group of a non-archimedean local field. It is named after John Tate who first proved it. It shows that the dual of such a Galois module is the Tate twist of usual linear dual. This new dual is called the (local) Tate dual.\n\nLocal duality combined with Tate's local Euler characteristic formula provide a versatile set of tools for computing the Galois cohomology of local fields.\n\nStatement\nLet K be a non-archimedean local field, let Ks denote a separable closure of K, and let GK = Gal(Ks/K) be the absolute Galois group of K.\n\nCase of finite modules\nDenote by μ the Galois module of all roots of unity in Ks. Given a finite GK-module A of order prime to the characteristic of K, the Tate dual of A is defined as\n\n(i.e. it is the Tate twist of the usual dual A∗). Let Hi(K, A) denote the group cohomology of GK with coefficients in A. The theorem states that the pairing\n\ngiven by the cup product sets up a duality between Hi(K, A) and H2−i(K, A′) for i = 0, 1, 2. Since GK has cohomological dimension equal to two, the higher cohomology groups vanish.\n\nCase of p-adic representations\nLet p be a prime number. Let Qp(1) denote the p-adic cyclotomic character of GK (i.e. the Tate module of μ). A p-adic representation of GK is a continuous representation\n\nwhere V is a finite-dimensional vector space over the p-adic numbers Qp and GL(V) denotes the group of invertible linear maps from V to itself.Some authors use the term p-adic representation to refer to more general Galois modules. The Tate dual of V is defined as\n\n(i.e. it is the Tate twist of the usual dual V∗ = Hom(V, Qp)). In this case, Hi(K, V) denotes the continuous group cohomology of GK with coefficients in V. Local Tate duality applied to V says that the cup product induces a pairing\n\nwhich is a duality between Hi(K, V) and H2−i(K, V ′) for i = 0, 1, 2. Again, the higher cohomology groups vanish.\n\nSee also\nTate duality, a global version (i.e. for global fields)\n\nNotes\n\nReferences\n \n , translation of  Cohomologie Galoisienne, Springer-Verlag Lecture Notes 5 (1964).\n\nCategory:Theorems in algebraic number theory\nCategory:Galois theory\nCategory:Duality theories"
    },
    {
      "title": "Main conjecture of Iwasawa theory",
      "url": "https://en.wikipedia.org/wiki/Main_conjecture_of_Iwasawa_theory",
      "text": "In mathematics, the main conjecture of Iwasawa theory is a deep relationship between p-adic L-functions and ideal class groups of cyclotomic fields, proved by Kenkichi Iwasawa for primes satisfying the Kummer–Vandiver conjecture and  proved for all primes by\n. The Herbrand–Ribet theorem and the Gras conjecture are both easy consequences of the main conjecture.\nThere are several generalizations of the main conjecture, to totally real fields, CM fields, elliptic curves, and so on.\n\nMotivation\n\n was partly motivated by an analogy with Weil's description of the zeta function of an algebraic curve over a finite field in terms of eigenvalues of the Frobenius endomorphism on its Jacobian. In this analogy,\nThe action of the Frobenius corresponds to the action of the group Γ.\nThe Jacobian of a curve corresponds to a module X over Γ defined in terms of ideal class groups\nThe zeta function of a curve over a finite field corresponds to a p-adic L-function.\nWeil's theorem relating the eigenvalues of Frobenius to the zeros of the zeta function of the curve corresponds to Iwasawa's main conjecture relating the action of the Iwasawa algebra on X to zeros of the p-adic zeta function.\n\nHistory\n\nThe main conjecture of Iwasawa theory was formulated as an assertion that two methods of defining p-adic L-functions (by module theory, by interpolation) should coincide, as far as that was well-defined. This was proved by  for Q, and for all totally real number fields by . These proofs were modeled upon Ken Ribet's proof of the converse to Herbrand's theorem (the Herbrand–Ribet theorem).\n\nKarl Rubin found a more elementary proof of the Mazur–Wiles theorem by using Thaine's method and Kolyvagin's Euler systems, described in   and , and later proved other generalizations of the main conjecture for imaginary quadratic fields.Manin & Panchishkin (2007) p.246\n\nStatement\n\np is a prime number.\nFn is the field Q(ζ) where ζ is a root of unity of order pn+1.\nΓ is the largest subgroup of the absolute Galois group of F∞ isomorphic to the p-adic integers.\nγ is a topological generator of Γ\nLn is the p-Hilbert class field of Fn.\nHn is the Galois group Gal(Ln/Fn), isomorphic to the subgroup of elements of the ideal class group of Fn whose order is a power of p.\nH∞ is the inverse limit of the Galois groups Hn.\nV is the vector space H∞⊗ZpQp.\nω is the Teichmüller character.\nVi is the ωi eigenspace of V.\nhp(ωi,T) is the characteristic polynomial of γ acting on the vector space Vi\nLp is the p-adic L function with Lp(ωi,1–k) = –Bk(ωi–k)/k, where B is a generalized Bernoulli number.\nu is the unique p-adic number satisfying γ(ζ) = ζu for all p-power roots of unity ζ\nGp is the power series with Gp(ωi,us–1) = Lp(ωi,s)\n\nThe main conjecture of Iwasawa theory proved by Mazur and Wiles states that if i is an odd integer not congruent to 1 mod p–1 then the ideals of Zp[[T]] generated by hp(ωi,T) and Gp(ω1–i,T) are equal.\n\nThe proof of Iwasawa's main conjecture by Mazur-Wiles was later improved by Rubin using Kolyvagin's Euler Systems, see entry for Iwasawa theory.\n\nReferences\n\n \n\nCategory:Cyclotomic fields\nCategory:Theorems in algebraic number theory\nCategory:Conjectures"
    },
    {
      "title": "Mazur's control theorem",
      "url": "https://en.wikipedia.org/wiki/Mazur%27s_control_theorem",
      "text": "In number theory, Mazur's control theorem, introduced by ,  describes the behavior in Zp extensions of the Selmer group of an abelian variety over a number field.\n\nReferences\n\nCategory:Theorems in algebraic number theory"
    },
    {
      "title": "Minkowski's bound",
      "url": "https://en.wikipedia.org/wiki/Minkowski%27s_bound",
      "text": "In algebraic number theory, Minkowski's bound gives an upper bound of the norm of ideals to be checked in order to determine the class number of a number field K. It is named for the mathematician Hermann Minkowski.\n\nDefinition\nLet D be the discriminant of the field, n be the degree of K over , and  be the number of complex embeddings where  is the number of real embeddings. Then every class in the ideal class group of K contains an integral ideal of norm not exceeding Minkowski's bound\n\nMinkowski's constant for the field K is this bound MK.Pohst & Zassenhaus (1989) p.384\n\nProperties\nSince the number of integral ideals of given norm is finite, the finiteness of the class number is an immediate consequence, and further, the ideal class group is generated by the prime ideals of norm at most MK.\n\nMinkowski's bound may be used to derive a lower bound for the discriminant of a field K given n, r1 and r2.  Since an integral ideal has norm at least one, we have 1 ≤ MK, so that\n\nFor n at least 2, it is easy to show that the lower bound is greater than 1, so we obtain Minkowski's Theorem, that the discriminant of every number field, other than Q, is non-trivial.  This implies that the field of rational numbers has no unramified extension.\n\nProof\nThe result is a consequence of Minkowski's theorem. \n\n References \n\n  \n \n \n\nExternal links\n \nStevenhagen, Peter. Number Rings.\nThe Minkowski Bound at Secret Blogging Seminar\n\nCategory:Theorems in algebraic number theory\nCategory:Hermann Minkowski"
    },
    {
      "title": "Mordell–Weil theorem",
      "url": "https://en.wikipedia.org/wiki/Mordell%E2%80%93Weil_theorem",
      "text": "In mathematics, the Mordell–Weil theorem states that for an abelian variety A over a number field K, the group A(K) of K-rational points of A is a finitely-generated abelian group, called the Mordell–Weil group. The case with A an elliptic curve E and K the rational number field Q is Mordell's theorem, answering a question apparently posed by Henri Poincaré around 1901; it was proved by Louis Mordell in 1922. It is a foundational theorem of Diophantine geometry and the arithmetic of abelian varieties.\n\nHistory\nThe tangent-chord process (one form of addition theorem on a cubic curve) had been known as far back as the seventeenth century. The process of infinite descent of Fermat was well known, but Mordell succeeded in establishing the finiteness of the quotient group E(Q)/2E(Q) which forms a major step in the proof. Certainly the finiteness of this group is a necessary condition for E(Q) to be finitely-generated; and it shows that the rank is finite. This turns out to be the essential difficulty. It can be proved by direct analysis of the doubling of a point on E.\n\nSome years later André Weil took up the subject, producing the generalisation to Jacobians of higher genus curves over arbitrary number fields in his doctoral dissertation published in 1928. More abstract methods were required, to carry out a proof with the same basic structure. The second half of the proof needs some type of height function, in terms of which to bound the 'size' of points of A(K). Some measure of the co-ordinates will do; heights are logarithmic, so that (roughly speaking) it is a question of how many digits are required to write down a set of homogeneous coordinates. For an abelian variety, there is no a priori preferred representation, though, as a projective variety.\n\nBoth halves of the proof have been improved significantly, by subsequent technical advances: in Galois cohomology as applied to descent, and in the study of the best height functions (which are quadratic forms).\n\nFurther results\nThe theorem left unanswered a number of questions:\n\nCalculation of the rank. This is still a demanding computational problem, and does not always have effective solutions.\nMeaning of the rank: see Birch and Swinnerton-Dyer conjecture.\nFor a curve C in its Jacobian variety as A, can the intersection of C with A(K) be infinite? Because of Faltings's theorem, this is false unless C = A.\nIn the same context, can C contain infinitely many torsion points of A? Because of the Manin–Mumford conjecture, proved by Michel Raynaud, this is false unless it is the elliptic curve case.\n\nSee also\nArithmetic geometry\n\nReferences\n\nCategory:Diophantine geometry\nCategory:Elliptic curves\nCategory:Abelian varieties\nCategory:Theorems in algebraic number theory"
    },
    {
      "title": "Neukirch–Uchida theorem",
      "url": "https://en.wikipedia.org/wiki/Neukirch%E2%80%93Uchida_theorem",
      "text": "In mathematics, the Neukirch–Uchida theorem shows that all problems about algebraic number fields can be reduced to problems about their absolute Galois groups.\n showed that two algebraic number fields with the same absolute Galois group are isomorphic, and  strengthened this by proving Neukirch's conjecture that automorphisms of the algebraic number field correspond to outer automorphisms of its absolute Galois group.  extended the result to infinite fields that are finitely generated over prime fields.\n\nThe Neukirch–Uchida theorem is one of the foundational results of anabelian geometry, whose main theme is to reduce properties of geometric objects to properties of their fundamental groups, provided these fundamental groups are sufficiently non-abelian.\n\nReferences\n \n\n \n\nCategory:Theorems in algebraic number theory"
    },
    {
      "title": "Octic reciprocity",
      "url": "https://en.wikipedia.org/wiki/Octic_reciprocity",
      "text": "In number theory, octic reciprocity is a reciprocity law relating the residues of 8th powers modulo primes, analogous to the law of quadratic reciprocity.\n\nThere is a rational reciprocity law for 8th powers, due to Williams.  Define the symbol (x|p)k to be +1 if x is a k-th power modulo the prime p and -1 otherwise.  Let p and q be distinct primes congruent to 1 modulo 8, such that (p|q) = (q|p) = +1.  Let p = a2 + b2 = c2 + 2d2 and q = A2 + B2 = C2 + 2D2, with aA odd.  Then\n\nReferences\n\nCategory:Theorems in algebraic number theory"
    },
    {
      "title": "Ostrowski's theorem",
      "url": "https://en.wikipedia.org/wiki/Ostrowski%27s_theorem",
      "text": "In number theory, Ostrowski's theorem, due to Alexander Ostrowski (1916), states that every non-trivial absolute value on the rational numbers Q is equivalent to either the usual real absolute value or a -adic absolute value.\n\n Definitions \nRaising an absolute value to a power less than 1 always results in another absolute value. Two absolute values  and  on a field K are defined to be equivalent if there exists a real number  such that\n\nThe trivial absolute value on any field K is defined to be\n\nThe real absolute value on the rationals Q is the standard absolute value on the reals, defined to be\n\nThis is sometimes written with a subscript 1 instead of infinity.\n\nFor a prime number , the -adic absolute value on Q is defined as follows: any non-zero rational , can be written uniquely as , where  and  are integers not divisible by  and  is an integer; so we define\n\n Proof \n\nConsider a non-trivial absolute value on the rationals . We consider two cases,\n\n(i)  \n(ii) \n\nIt suffices for us to consider the valuation of integers greater than one. For, if we find  in  for which  for all naturals greater than one; then this relation trivially holds for 0 and 1, and for positive rationals\n\nand for negative rationals\n\n Case I: ∃n ∈ N   |n|∗ > 1 \nConsider the following calculation. Let  and  be natural numbers with . Expressing  in base  yields\n\nThen we see, by the properties of an absolute value:\n\nTherefore,\n\nHowever we have:\n\nwhich implies:\n\nNow choose  such that . Using this in the above ensures that  regardless of the choice of  (else  implying ). Thus for any choice of  above, we get\n\ni.e.\n\nBy symmetry, this inequality is an equality.\n\nSince  were arbitrary, there is a constant,  for which , i.e.  for all naturals . As per the above remarks, we easily see that for all rationals, , thus demonstrating equivalence to the real absolute value.\n\n Case II: ∀n ∈ N   |n|∗ ≤ 1 \nAs this valuation is non-trivial, there must be a natural number for which . Factorising this natural,\n\nyields  must be less than 1, for at least one of the prime factors . We claim than in fact, that this is so for only one.\n\nSuppose per contra that  are distinct primes with absolute value less than 1. First, let  be such that . By the Euclidean algorithm, there are  such that . This yields\n\na contradiction.\n\nSo we must have  for some , and  for . Letting\n\nwe see that for general positive naturals\n\nAs per the above remarks we see that  all rationals, implying the absolute value is equivalent to the -adic one.      \n\nOne can also show a stronger conclusion, namely that  is a nontrivial absolute value if and only if either  for some  or  for some .\n\n Another Ostrowski's theorem \nAnother theorem states that any field, complete with respect to an Archimedean absolute value, is (algebraically and topologically) isomorphic to either the real numbers or the complex numbers. This is sometimes also referred to as Ostrowski's theorem.Cassels (1986) p. 33\n\n See also \n Valuation (algebra)\n\n References \n\n \n \n\nCategory:Theorems in algebraic number theory"
    },
    {
      "title": "Principal ideal theorem",
      "url": "https://en.wikipedia.org/wiki/Principal_ideal_theorem",
      "text": "In mathematics, the principal ideal theorem of class field theory, a branch of algebraic number theory says that extending ideals gives a mapping on the class group of an algebraic number field to the class group of its Hilbert class field, which sends all ideal classes to the class of a principal ideal. The phenomenon has also been called principalization, or sometimes capitulation.\n\nFormal statement\nFor any algebraic number field K and any ideal I of the ring of integers of K, if L is the Hilbert class field of K, then\n\nis a principal ideal αOL, for OL the ring of integers of L and some element  α in it.\n\nHistory\n\nThe principal ideal theorem was conjectured by , and was the last remaining aspect of his program on class fields to be completed, in 1929.\n\n reduced the principal ideal theorem to a question about finite abelian groups: he showed that it would follow if the transfer from a finite group to its derived subgroup is trivial. This result was proved by .\n\nReferences\n\n \n \n\n  \n\nCategory:Ideals\nCategory:Group theory\nCategory:Homological algebra\nCategory:Theorems in algebraic number theory"
    },
    {
      "title": "Reflection theorem",
      "url": "https://en.wikipedia.org/wiki/Reflection_theorem",
      "text": "For reflection principles in set theory, see reflection principle.\n\nIn algebraic number theory, a reflection theorem or Spiegelungssatz (German for reflection theorem – see Spiegel and Satz) is one of a collection of theorems linking the sizes of different ideal class groups (or ray class groups), or the sizes of different isotypic components of a class group.  The original example is due to Ernst Eduard Kummer, who showed that the class number of the cyclotomic field , with p a prime number, will be divisible by p if the class number of the maximal real subfield  is.  Another example is due to Scholz.A. Scholz, Uber die Beziehung der Klassenzahlen quadratischer Korper zueinander, J. reine angew. Math., 166 (1932), 201-203.  A simplified version of his theorem states that if 3 divides the class number of a real quadratic field , then 3 also divides the class number of the imaginary quadratic field .\n\nLeopoldt's Spiegelungssatz\nBoth of the above results are generalized by Leopoldt's \"Spiegelungssatz\", which relates the p-ranks of different isotypic components of the class group of a number field considered as a module over the Galois group of a Galois extension.\n\nLet L/K be a finite Galois extension of number fields, with group G, degree prime to p and L containing the p-th roots of unity.  Let A be the p-Sylow subgroup of the class group of L.  Let φ run over the irreducible characters of the group ring Qp[G] and let Aφ denote the corresponding direct summands of A.  For any φ let q = pφ(1) and let the G-rank eφ be the exponent in the index\n\nLet ω be the character of G\n\nThe reflection (Spiegelung) φ* is defined by\n\nLet E be the unit group of K.  We say that ε is \"primary\" if  is unramified, and let E0 denote the group of primary units modulo Ep.  Let δφ denote the G-rank of the φ component of E0.\n\nThe Spiegelungssatz states that\n\nExtensions\nExtensions of this Spiegelungssatz were given by Oriat and Oriat-Satge, where class groups were no longer associated with characters of the Galois group of K/k, but rather by ideals in a group ring over the Galois group of K/k.  Leopoldt's Spiegelungssatz was generalized in a different direction by Kuroda, who extended it to a statement about ray class groups.  This was further developed into the very general \"T-S reflection theorem\" of Georges Gras.Georges Gras, Class Field Theory: From Theory to Practice, Springer-Verlag, Berlin, 2004, pp. 157–158.  Kenkichi Iwasawa also provided an Iwasawa-theoretic reflection theorem.\n\nReferences\n\n \n\nCategory:Theorems in algebraic number theory"
    },
    {
      "title": "Scholz's reciprocity law",
      "url": "https://en.wikipedia.org/wiki/Scholz%27s_reciprocity_law",
      "text": "In mathematics, Scholz's reciprocity law is a reciprocity law for quadratic residue symbols of real quadratic number fields discovered by  and rediscovered by .\n\nStatement\nSuppose that p and q are rational primes congruent to 1 mod 4 such that the Legendre symbol (p/q) is 1. Then the ideal (p) factorizes in the ring of integers of Q() as (p)=𝖕𝖕' and similarly (q)=𝖖𝖖' in the ring of integers of Q().\nWrite εp and εq for the fundamental units in these quadratic fields. Then Scholz's reciprocity law says that\n[εp/𝖖] = [εq/𝖕] \nwhere [] is the quadratic residue symbol in a quadratic number field.\n\nReferences\n\nCategory:Theorems in algebraic number theory"
    },
    {
      "title": "Shafarevich–Weil theorem",
      "url": "https://en.wikipedia.org/wiki/Shafarevich%E2%80%93Weil_theorem",
      "text": "In algebraic number theory, the Shafarevich–Weil theorem relates the fundamental class of a Galois extension of local or global fields to an extension of Galois groups. It was introduced by  for local fields and by  for global fields.\n\nStatement\n\nSuppose that F is a global field, K is a normal extension of F, and L is an abelian extension of K. Then the Galois group Gal(L/F) is an extension of the group Gal(K/F) by the abelian group Gal(L/K), and this extension corresponds to an element of the cohomology group H2(Gal(K/F), Gal(L/K)). On the other hand, class field theory gives a fundamental class in H2(Gal(K/F),IK) and a reciprocity law map from IK to Gal(L/K). The Shafarevich–Weil theorem states that the class of the extension  Gal(L/F) is the image of the fundamental class under the homomorphism of cohomology groups induced by the reciprocity law map .\n\nShafarevich stated his theorem for local fields in terms of division algebras rather than the fundamental class . In this case, with L the maximal abelian extension of K, the extension Gal(L/F) corresponds under the reciprocity map to the normalizer of K in a division algebra of degree [K:F] over F, and Shafarevich's theorem states that the Hasse invariant of this division algebra is 1/[K:F]. The relation to the previous version of the theorem is that division algebras correspond to elements of a second cohomology group (the Brauer group) and under this correspondence the division algebra with Hasse invariant 1/[K:F] corresponds to the fundamental class.\n\nReferences\n\n Reprinted in his collected works, pages 4–5\n , reprinted in volume I of his collected papers, \n\nCategory:Theorems in algebraic number theory"
    },
    {
      "title": "Shintani's unit theorem",
      "url": "https://en.wikipedia.org/wiki/Shintani%27s_unit_theorem",
      "text": "In mathematics, Shintani's unit theorem introduced by  is a refinement of Dirichlet's unit theorem and states that a subgroup of finite index of the totally positive units of a number field has a fundamental domain given by a rational polyhedric cone in the Minkowski space of the field .\n\nReferences\n\n \n\nExternal links\n Mathematical pictures by Paul Gunnells\n\nCategory:Theorems in algebraic number theory"
    },
    {
      "title": "Stark–Heegner theorem",
      "url": "https://en.wikipedia.org/wiki/Stark%E2%80%93Heegner_theorem",
      "text": "In number theory, the Baker–Heegner–Stark theorem calls this the Stark–Heegner theorem (cognate to Stark–Heegner points as in page xiii of ) but omitting Baker's name is atypical.  gratuitously adds Deuring and Siegel in his paper's title. states precisely which quadratic imaginary number fields admit unique factorisation in their ring of integers. It solves a special case of Gauss's class number problem of determining the number of imaginary quadratic fields that have a given fixed class number.\n\nLet Q denote the set of rational numbers, and let d be a non-square integer. Then Q() is a finite extension of Q of degree 2, called a quadratic extension. The class number of Q() is the number of equivalence classes of ideals of the ring of integers of Q(), where two ideals I and J are equivalent if and only if there exist principal ideals (a) and (b) such that (a)I = (b)J. Thus, the ring of integers of Q() is a principal ideal domain (and hence a unique factorization domain) if and only if the class number of Q() is equal to 1. The Baker–Heegner–Stark theorem can then be stated as follows:\n\nIf d < 0, then the class number of Q() is equal to 1 if and only if\n\n \nThese are known as the Heegner numbers.\n\nThis list is also written, replacing −1 with −4 and −2 with −8 (which does not change the field), as:, p. 93.\n\nwhere D is interpreted as the discriminant (either of the number field or of an elliptic curve with complex multiplication). This is more standard, as the D are then fundamental discriminants.\n\nHistory\nThis result was first conjectured by Gauss in Section 303 of his Disquisitiones Arithmeticae (1798).  It was essentially proven by Kurt Heegner in 1952, but Heegner's proof had some minor gaps and the theorem was not accepted until Harold Stark gave a complete proof in 1967, which had many commonalities to Heegner's work, but sufficiently many differences that Stark considers the proofs to be different. page 42 Heegner \"died before anyone really understood what he had done\".. Stark formally filled in the gap in Heegner's proof in 1969 (other contemporary papers produced various similar proofs by modular functions, but Stark concentrated on explicitly filling Heegner's gap).\n\nAlan Baker gave a completely different proof slightly earlier (1966) than Stark's work (or more precisely Baker reduced the result to a finite amount of computation, with Stark's work in his 1963/4 thesis already providing this computation), and won the Fields Medal for his methods. Stark later pointed out that Baker's proof, involving linear forms in 3 logarithms, could be reduced to only 2 logarithms, when the result was already known from 1949 by Gelfond and Linnik.\n\nStark's 1969 paper  also cited the 1895 text by Heinrich Martin Weber and noted that if Weber had \"only made the observation that the reducibility of [a certain equation] would lead to a Diophantine equation, the class-number one problem would have been solved 60 years ago\". Bryan Birch notes that Weber's book, and essentially the whole field of modular functions, dropped out of interest for half a century: \"Unhappily, in 1952 there was no one left who was sufficiently expert in Weber's Algebra to appreciate Heegner's achievement.\"\n\nDeuring, Siegel, and Chowla all gave slightly variant proofs by modular functions in the immediate years after Stark. Other versions in this genre have also cropped up over the years. For instance, in 1985, Monsur Kenku gave a proof using the Klein quartic (though again utilizing modular functions).. And again, in 1999, Imin Chen gave another variant proof by modular functions (following Siegel's outline).\n\nThe work of Gross and Zagier (1986)  combined with that of Goldfeld (1976) also gives an alternative proof.\n\nReal case\nOn the other hand, it is unknown whether there are infinitely many d > 0 for which Q() has class number 1. Computational results indicate that there are many such fields. Number Fields with class number one provides a list of some of these.\n\nNotes\n\nReferences\n\n.\n\nCategory:Theorems in algebraic number theory"
    },
    {
      "title": "Stickelberger's theorem",
      "url": "https://en.wikipedia.org/wiki/Stickelberger%27s_theorem",
      "text": "In mathematics, Stickelberger's theorem is a result of algebraic number theory, which gives some information about the Galois module structure of class groups of cyclotomic fields. A special case was first proven by Ernst Kummer (1847) while the general result is due to Ludwig Stickelberger (1890).\n\nThe Stickelberger element and the Stickelberger ideal\nLet  denote the th cyclotomic field, i.e. the extension of the rational numbers obtained by adjoining the th roots of unity to  (where  is an integer). It is a Galois extension of  with Galois group  isomorphic to the multiplicative group of integers modulo  . The Stickelberger element (of level  or of ) is an element in the group ring  and the Stickelberger ideal (of level  or of ) is an ideal in the group ring . They are defined as follows. Let  denote a primitive th root of unity. The isomorphism from  to  is given by sending  to  defined by the relation\n.\nThe Stickelberger element of level  is defined as\n\nThe Stickelberger ideal of level , denoted , is the set of integral multiples of  which have integral coefficients, i.e.\n\nMore generally, if  be any Abelian number field whose Galois group over  is denoted , then the Stickelberger element of  and the Stickelberger ideal of  can be defined. By the Kronecker–Weber theorem there is an integer  such that  is contained in . Fix the least such  (this is the (finite part of the) conductor of  over ). There is a natural group homomorphism  given by restriction, i.e. if , its image in  is its restriction to  denoted . The Stickelberger element of  is then defined as\n\nThe Stickelberger ideal of , denoted , is defined as in the case of , i.e.\n\nIn the special case where , the Stickelberger ideal  is generated by  as  varies over . This not true for general F., Lemma 6.9 and the comments following it\n\nExamples\nIf  is a totally real field of conductor , then\n\nwhere  is the Euler totient function and  is the degree of  over ℚ.\n\nStatement of the theorem\nStickelberger's Theorem\nLet  be an abelian number field. Then, the Stickelberger ideal of  annihilates the class group of .\n\nNote that  itself need not be an annihilator, but any multiple of it in  is.\n\nExplicitly, the theorem is saying that if  is such that\n\nand if  is any fractional ideal of , then\n\nis a principal ideal.\n\n See also \n\nGross–Koblitz formula\nHerbrand–Ribet theorem\nThaine's theorem\n\n Notes \n\n References \n \nBoas Erez, Darstellungen von Gruppen in der Algebraischen Zahlentheorie: eine Einführung\n \n \n\n External links \nPlanetMath page\n\nCategory:Cyclotomic fields\nCategory:Theorems in algebraic number theory"
    },
    {
      "title": "Takagi existence theorem",
      "url": "https://en.wikipedia.org/wiki/Takagi_existence_theorem",
      "text": "In class field theory, the Takagi existence theorem states that for any number field K there is a one-to-one inclusion reversing correspondence between the finite abelian extensions of K (in a fixed algebraic closure of K) and the generalized ideal class groups defined via a modulus of K. \n\nIt is called an existence theorem because a main burden of the proof is to show the existence of enough abelian extensions of K.\n\nFormulation\nHere a modulus (or ray divisor) is a formal finite product of the valuations (also called primes or places) of K with positive integer exponents. The archimedean valuations that might appear in a modulus include only those whose completions are the real numbers (not the complex numbers); they may be identified with orderings on K and occur only to exponent one.\n\nThe modulus m is a product of a non-archimedean (finite) part mf and an archimedean (infinite) part m∞.  The non-archimedean part mf is a nonzero ideal in the ring of integers OK of K and the archimedean part m∞ is simply a set of real embeddings of K.  Associated to such a modulus m are two groups of fractional ideals.  The larger one, Im, is the group of all fractional ideals relatively prime to m (which means these fractional ideals do not involve any prime ideal appearing in mf).  The smaller one, Pm, is the group of principal fractional ideals (u/v) where u and v are nonzero elements of OK which are prime to mf, u ≡ v mod mf, and u/v > 0 in each of the orderings of m∞.   (It is important here that in Pm, all we require is that some generator of the ideal has the indicated form.  If one does, others might not.  For instance, taking K to be the rational numbers, the ideal (3) lies in P4 because (3) = (−3) and −3 fits the necessary conditions.  But (3) is not in P4∞ since here it is required that the positive generator of the ideal is 1 mod 4, which is not so.) For any group H lying between Im and Pm, the quotient Im/H is called a generalized ideal class group.  \n\nIt is these generalized ideal class groups which correspond to abelian extensions of K by the existence theorem, and in fact are the Galois groups of these extensions. That generalized ideal class groups are finite is proved along the same lines of the proof that the usual ideal class group is finite, well in advance of knowing these are Galois groups of finite abelian extensions of the number field.\n\nA well-defined correspondence\nStrictly speaking, the correspondence between finite abelian extensions of K and generalized ideal class groups is not quite one-to-one. Generalized ideal class groups defined relative to different moduli can give rise to the same abelian extension of K, and this is codified a priori in a somewhat complicated equivalence relation on generalized ideal class groups.  \n\nIn concrete terms, for abelian extensions L of the rational numbers, this corresponds to the fact that an abelian extension of the rationals lying in one cyclotomic field also lies in infinitely many other cyclotomic fields, and for each such cyclotomic overfield one obtains by Galois theory a subgroup of the Galois group corresponding to the same field L.  \n\nIn the idelic formulation of class field theory, one obtains a precise one-to-one correspondence between abelian extensions and appropriate groups of ideles, where equivalent generalized ideal class groups in the ideal-theoretic language correspond to the same group of ideles.\n\nEarlier work\nA special case of the existence theorem is when m = 1 and H = P1.  In this case the generalized ideal class group is the ideal class group of K, and the existence theorem says there exists a unique abelian extension L/K with Galois group isomorphic to the ideal class group of K such that L is unramified at all places of K. This extension is called the Hilbert class field.  It was conjectured by David Hilbert to exist, and existence in this special case was proved by Furtwängler in 1907, before Takagi's general existence theorem. \n\nA further and special property of the Hilbert class field, not true of smaller abelian extensions of a number field, is that all ideals in a number field become principal in the Hilbert class field. It required Artin and Furtwängler to prove that principalization occurs.\n\nHistory\nThe existence theorem is due to Takagi, who proved it in Japan during the isolated years of World War I. He presented it at the International Congress of Mathematicians in 1920, leading to the development of the classical theory of class field theory during the 1920s. At Hilbert's request, the paper was published in Mathematische Annalen in 1925.\n\nSee also\nClass formation\n\nReferences\n Helmut Hasse, History of Class Field Theory,  pp. 266–279 in Algebraic Number Theory,  eds. J. W. S. Cassels and A. Fröhlich,  Academic Press 1967.   (See also the rich bibliography attached to Hasse's article.)\n\nCategory:Class field theory\nCategory:Theorems in algebraic number theory"
    },
    {
      "title": "Thaine's theorem",
      "url": "https://en.wikipedia.org/wiki/Thaine%27s_theorem",
      "text": "In mathematics, Thaine's theorem is an analogue of Stickelberger's theorem for real abelian fields, introduced by . Thaine's method has been used to shorten the proof of the Mazur–Wiles theorem , to prove that some Tate–Shafarevich groups are finite, and in the proof of Mihăilescu's theorem .\n\nFormulation\nLet  and  be distinct odd primes with  not dividing . Let  be the Galois group of  over , let  be its group of units, let  be the subgroup of cyclotomic units, and let  be its class group. If  annihilates  then it annihilates .\n\nReferences\n\n See in particular Chapter 14 (pp. 91–94) for the use of Thaine's theorem to prove Mihăilescu's theorem, and Chapter 16 \"Thaine's Theorem\" (pp. 107–115) for proof of a special case of Thaine's theorem.\n\n See in particular Chapter 15 (pp. 332–372) for Thaine's theorem (section 15.2) and its application to the Mazur–Wiles theorem.\nCategory:Cyclotomic fields\nCategory:Theorems in algebraic number theory"
    },
    {
      "title": "Yamamoto's reciprocity law",
      "url": "https://en.wikipedia.org/wiki/Yamamoto%27s_reciprocity_law",
      "text": "In mathematics, Yamamoto's reciprocity law is a reciprocity law related to class numbers of quadratic number fields, introduced by .\n\nReferences\n\nCategory:Theorems in algebraic number theory"
    },
    {
      "title": "Acyclic model",
      "url": "https://en.wikipedia.org/wiki/Acyclic_model",
      "text": "In algebraic topology, a discipline within mathematics, the acyclic models theorem can be used to show that two homology theories are isomorphic. The theorem was developed by topologists Samuel Eilenberg and Saunders MacLane.S. Eilenberg and S. Mac Lane (1953), \"Acyclic Models.\" Amer. J. Math. 75, pp.189–199  They discovered that, when topologists were writing proofs to establish equivalence of various homology theories, there were numerous similarities in the processes.  Eilenberg and MacLane then discovered the theorem to generalize this process.\n\nIt can be used to prove the Eilenberg–Zilber theorem; this leads to the idea of the model category.\n\nStatement of the theorem\nLet  be an arbitrary category and  be the category of chain complexes of -modules. Let  be covariant functors such that:\n  for .\n There are  for  such that  has a basis in , so  is a free functor.\n  is - and -acyclic at these models, which means that  for all  and all .\n\nThen the following assertions hold:Joeseph J. Rotman, An Introduction to Algebraic Topology (1988) Springer-Verlag  (See chapter 9, thm 9.12) \n Every natural transformation  induces a natural chain map .\n If  are natural transformations,  are natural chain maps as before and  for all models , then there is a natural chain homotopy between  and .\n In particular the chain map  is unique up to natural chain homotopy.\n\n Generalizations \n\n Projective and acyclic complexes \n\nWhat is above is one of the earliest versions of the theorem.  Another\nversion is the one that says that if  is a complex of\nprojectives in an abelian category and  is an acyclic\ncomplex in that category, then any map  extends to a chain map , unique up to\nhomotopy.\n\nThis specializes almost to the above theorem if one uses the functor category  as the abelian category. Free functors are projective objects in that category. The morphisms in the functor category are natural transformations, so the constructed chain maps and homotopies are all natural. The difference is that in the above version,  being acyclic is a stronger assumption than being acyclic only at certain objects.\n\nOn the other hand, the above version almost implies this version by letting  a category with only one object. Then the free functor  is basically just a free (and hence projective) module.  being acyclic at the models (there is only one) means nothing else than that the complex  is acyclic.\n\n Acyclic classes \n\nThere is a grand theorem that unifies both of the above.M. Barr, \"Acyclic Models\" (1999).M. Barr, Acyclic Models (2002) CRM monograph 17, American Mathematical Society .  Let  be an abelian category (for example,  or ). A class  of chain complexes over  will be called an acyclic class provided that:\n The 0 complex is in .\n The complex  belongs to  if and only if the suspension of  does.\n If the complexes  and  are homotopic and , then .\n Every complex in  is acyclic.\n If  is a double complex, all of whose rows are in , then the total complex of  belongs to .\n\nThere are three natural examples of acyclic classes, although doubtless others exist. The first is that of homotopy contractible complexes. The second is that of acyclic complexes. In functor categories (e.g. the category of all functors from topological spaces to abelian groups), there is a class of complexes that are contractible on each object, but where the contractions might not be given by natural transformations. Another example is again in functor categories but this time the complexes are acyclic only at certain objects.\n\nLet  denote the class of chain maps between complexes whose mapping cone belongs to . Although  does not necessarily have a calculus of either right or left fractions, it has weaker properties of having homotopy classes of both left and right fractions that permit forming the class  gotten by inverting the arrows in .\n\nLet  be an augmented endofunctor on , meaning there is given a natural transformation\n (the identity functor on ). We say that the chain complex  is -presentable if for each , the chain complex\n\nbelongs to . The boundary operator is given by\n.\nWe say that the chain complex functor  is -acyclic if the augmented chain complex\n belongs to .\n\nTheorem. Let  be an acyclic class and  the corresponding class of arrows in the category of chain complexes. Suppose that  is -presentable and  is -acyclic. Then any natural transformation  extends, in the category  to a natural transformation of chain functors  and this is\nunique in  up to chain homotopies. If we suppose, in addition, that  is -presentable, that  is -acyclic, and that  is an isomorphism, then  is homotopy equivalence.\n\n Example \nHere is an example of this last theorem in action.  Let  be the category of triangulable spaces and  be the category of abelian group valued functors on . Let\n be the singular chain complex functor and  be the simplicial chain complex functor. Let  be the functor that assigns to each space  the space\n.\nHere,  is the -simplex and this functor assigns to  the sum of as many copies of each -simplex as there are maps . Then let  be defined by . There is an obvious augmentation  and this induces one on . It can be shown that both  and  are both -presentable and -acyclic (the proof that  is presentable and acyclic is not entirely straightforward and uses a detour through simplicial subdivision, which can also be handled using the above theorem).  The class  is the class of homology equivalences. It is rather obvious that  and so we conclude that singular and simplicial homology are isomorphic on .\n\nThere are many other examples in both algebra and topology, some of which are described in \n\nReferences\n\n Schon, R. \"Acyclic models and excision.\" Proc. Amer. Math. Soc.'' 59(1) (1976) pp.167--168.\n\nCategory:Homological algebra\nCategory:Theorems in algebraic topology"
    },
    {
      "title": "Landweber exact functor theorem",
      "url": "https://en.wikipedia.org/wiki/Landweber_exact_functor_theorem",
      "text": "In mathematics, the Landweber exact functor theorem, named after Peter Landweber, is a theorem in algebraic topology. It is known that a complex orientation of a homology theory leads to a formal group law. The Landweber exact functor theorem (or LEFT for short) can be seen as a method to reverse this process: it constructs a homology theory out of a formal group law.\n\nStatement\nThe coefficient ring of complex cobordism is , where the degree of  is . This is isomorphic to the graded Lazard ring . This means that giving a formal group law F (of degree ) over a graded ring  is equivalent to giving a graded ring morphism . Multiplication by an integer  is defined inductively as a power series, by\n\n and \n\nLet now F be a formal group law over a ring . Define for a topological space X\n\nHere  gets its -algebra structure via F. The question is: is E a homology theory? It is obviously a homotopy invariant functor, which fulfills excision. The problem is that tensoring in general does not preserve exact sequences. One could demand that  be flat over , but that would be too strong in practice. Peter Landweber found another criterion:\n\nTheorem (Landweber exact functor theorem)\n For every prime p, there are elements  such that we have the following: Suppose that  is a graded -module and the sequence  is regular for , for every p and n. Then \n\nis a homology theory on CW-complexes.\n\nIn particular, every formal group law F over a ring  yields a module over  since we get via F a ring morphism .\n\nRemarks\nThere is also a version for Brown–Peterson cohomology BP. The spectrum BP is a direct summand of  with coefficients . The statement of the LEFT stays true if one fixes a prime p and substitutes BP for MU.\nThe classical proof of the LEFT uses the Landweber–Morava invariant ideal theorem: the only prime ideals of  which are invariant under coaction of  are the . This allows to check flatness only against the  (see Landweber, 1976).\nThe LEFT can be strengthened as follows: let  be the (homotopy) category of Landweber exact -modules and  the category of MU-module spectra M such that  is Landweber exact. Then the functor  is an equivalence of categories. The inverse functor (given by the LEFT) takes -algebras to (homotopy) MU-algebra spectra (see Hovey, Strickland, 1999, Thm 2.7).\n\nExamples\nThe archetypical and first known (non-trivial) example is complex K-theory K. Complex K-theory is complex oriented and has as formal group law . The corresponding morphism  is also known as the Todd genus. We have then an isomorphism\n \ncalled the Conner–Floyd isomorphism.\n\nWhile complex K-theory was constructed before by geometric means, many homology theories were first constructed via the Landweber exact functor theorem. This includes elliptic homology, the Johnson–Wilson theories  and the Lubin–Tate spectra .\n\nWhile homology with rational coefficients  is Landweber exact, homology with integer coefficients  is not Landweber exact. Furthermore, Morava K-theory K(n) is not Landweber exact.\n\nModern reformulation\nA module M over  is the same as a quasi-coherent sheaf  over , where L is the Lazard ring. If , then M has the extra datum of a  coaction. A coaction on the ring level corresponds to that  is an equivariant sheaf with respect to an action of an affine group scheme G. It is a theorem of Quillen that  and assigns to every ring R the group of power series \n. \nIt acts on the set of formal group laws  via \n.\nThese are just the coordinate changes of formal group laws. Therefore, one can identify the stack quotient  with the stack of (1-dimensional) formal groups  and  defines a quasi-coherent sheaf over this stack. Now it is quite easy to see that it suffices that M defines a quasi-coherent sheaf  which is flat over  in order that  is a homology theory. The Landweber exactness theorem can then be interpreted as a flatness criterion for  (see Lurie 2010).\n\nRefinements to -ring spectra\nWhile the LEFT is known to produce (homotopy) ring spectra out of , it is a much more delicate question to understand when these spectra are actually -ring spectra. As of 2010, the best progress was made by Jacob Lurie. If X is an algebraic stack and  a flat map of stacks, the discussion above shows that we get a presheaf of (homotopy) ring spectra on X. If this map factors over  (the stack of 1-dimensional p-divisible groups of height n) and the map  is etale, then this presheaf can be refined to a sheaf of -ring spectra (see Goerss). This theorem is important for the construction of topological modular forms.\n\nReferences\n \n \n .\n \n\nAlgebraic Topology"
    },
    {
      "title": "Andreotti–Frankel theorem",
      "url": "https://en.wikipedia.org/wiki/Andreotti%E2%80%93Frankel_theorem",
      "text": "In mathematics, the Andreotti–Frankel theorem, introduced by , states that if  is a smooth, complex affine variety of complex dimension  or, more generally, if  is any Stein manifold of dimension , then \n admits a Morse function with critical points of index at most n, and so  is homotopy equivalent to a CW complex of real dimension at most n. \n\nConsequently, if  is a closed connected complex submanifold of complex dimension , then  has the homotopy type of a CW complex of real dimension .\nTherefore\n\nand\n\nThis theorem applies in particular to any smooth, complex affine variety of dimension .\n\nReferences\n\n Chapter 7.\n\nCategory:Complex manifolds\nCategory:Homotopy theory\nCategory:Theorems in algebraic topology"
    },
    {
      "title": "Blakers–Massey theorem",
      "url": "https://en.wikipedia.org/wiki/Blakers%E2%80%93Massey_theorem",
      "text": "In mathematics, the first Blakers–Massey theorem, named after Albert Blakers and William S. Massey, gave vanishing conditions for certain triad homotopy groups. This connectivity result may also be expressed as that if X is the pushout of \n\n  \n\nand f is m-connected and g is n-connected, then the map of pairs\n\n \n\ninduces an isomorphism in relative homotopy groups in degrees  and a surjection in the next degree.\n\nHowever the third paper of Blakers and Massey in this area, referenced below, determines the critical, i.e., first non-zero, triad homotopy group as a tensor product, under a number of assumptions, including some simple connectivity. This condition and some dimension conditions are  relaxed in the Brown–Loday paper referenced below. Of course the algebraic result implies the connectivity result, since a tensor product is zero if one of the factors is zero. In the non simply connected case, one has to use the nonabelian tensor product introduced by Brown and Loday.\n\nThe triad connectivity result can be expressed in a number of other ways, for example  it says that the pushout square above behaves like a homotopy pullback up to dimension .\n\n Generalization to higher toposes \n\nThe generalization of the connectivity part of the theorem from traditional homotopy theory to any other infinity-topos with an infinity-site of definition was given by Charles Rezk in 2010.\n\n Fully formal proof \n\nIn 2013 a fairly short fully formal proof using homotopy type theory as a mathematical foundation and an Agda variant as a proof assistant was announced by Peter LeFanu Lumsdaine . It became theorem 8.10.2 of Homotopy Type Theory – Univalent Foundations of Mathematics. This induces an internal proof for any infinity-topos (i.e. without reference to a site of definition). In particular it gives a new proof of the original result.\n\nReferences\n\n \n \n \n  Theorem 6.4.1 \n Charles Rezk, prop. 8.16 in Toposes and homotopy toposes (2010) (pdf)\n\nCategory:Theorems in algebraic topology"
    },
    {
      "title": "Bloch's formula",
      "url": "https://en.wikipedia.org/wiki/Bloch%27s_formula",
      "text": "In algebraic K-theory, a branch of mathematics, Bloch's formula, introduced by Spencer Bloch for , states that the Chow group of a smooth variety X over a field is isomorphic to the cohomology of X with coefficients in the K-theory of the structure sheaf ; that is,\n\nwhere the right-hand side is the sheaf cohomology;  is the sheaf associated to the presheaf , U Zariski open subsets of X. The general case is due to Quillen.For a sketch of the proof, besides the original paper, see http://www-bcf.usc.edu/~ericmf/lectures/zurich/zlec5.pdf  For q = 1, one recovers . (see also Picard group.)\n\nThe formula for the mixed characteristic is still open.\n\n References \n\nDaniel Quillen: Higher algebraic K-theory: I. In: H. Bass (ed.): Higher K-Theories. Lecture Notes in Mathematics, vol. 341. Springer-Verlag, Berlin 1973. \n\nCategory:Algebraic K-theory\nCategory:Algebraic geometry\nCategory:Theorems in algebraic topology"
    },
    {
      "title": "Brown's representability theorem",
      "url": "https://en.wikipedia.org/wiki/Brown%27s_representability_theorem",
      "text": "In mathematics, Brown's representability theorem in homotopy theory, see pages 152–157 gives necessary and sufficient conditions for a contravariant functor F on the homotopy category Hotc of pointed connected CW complexes, to the category of sets Set, to be a representable functor.\n\nMore specifically, we are given\n\nF: Hotcop → Set,\n\nand there are certain obviously necessary conditions for F to be of type Hom(—, C), with C a pointed connected CW-complex that can be deduced from category theory alone.  The statement of the substantive part of the theorem is that these necessary conditions are then sufficient.  For technical reasons, the theorem is often stated for functors to the category of pointed sets; in other words the sets are also given a base point.\n\nBrown representability theorem for CW complexes\n\nThe representability theorem for CW complexes, due to Edgar H. Brown, is the following.  Suppose that:\n The functor F maps coproducts (i.e. wedge sums) in Hotc to products in Set: \n The functor F maps homotopy pushouts in Hotc to weak pullbacks.  This is often stated as a Mayer–Vietoris axiom: for any CW complex W covered by two subcomplexes U and V, and any elements u ∈ F(U), v ∈ F(V) such that u and v restrict to the same element of F(U ∩ V), there is an element w ∈ F(W) restricting to u and v, respectively.\nThen F is representable by some CW complex C, that is to say there is an isomorphism \nF(Z) ≅ HomHotc(Z, C)\nfor any CW complex Z, which is natural in Z in that for any morphism from Z to another CW complex Y the induced maps F(Y) → F(Z) and HomHot(Y, C) → HomHot(Z, C) are compatible with these isomorphisms.\n\nThe converse statement also holds: any functor represented by a CW complex satisfies the above two properties. This direction is an immediate consequence of basic category theory, so the deeper and more interesting part of the equivalence is the other implication.\n\nThe representing object C above can be shown to depend functorially on F: any natural transformation from F to another functor satisfying the conditions of the theorem necessarily induces a map of the representing objects. This is a consequence of Yoneda's lemma.\n\nTaking F(X) to be the singular cohomology group Hi(X,A) with coefficients in a given abelian group A, for fixed i > 0; then the representing space for F is the Eilenberg-MacLane space K(A, i). This gives a means of showing the existence of Eilenberg-MacLane spaces.\n\nVariants\n\nSince the homotopy category of CW-complexes is equivalent to the localization of the category of all topological spaces at the weak homotopy equivalences, the theorem can equivalently be stated for functors on a category defined in this way.\n\nHowever, the theorem is false without the restriction to connected pointed spaces, and an analogous statement for unpointed spaces is also false.\n\nA similar statement does, however, hold for spectra instead of CW complexes.  Brown also proved a general categorical version of the representability theorem, which includes both the version for pointed connected CW complexes and the version for spectra.\n\nA version of the representability theorem in the case of triangulated categories is due to Amnon Neeman. Together with the preceding remark, it gives a criterion for a (covariant) functor F: C → D between triangulated categories satisfying certain technical conditions to have a right adjoint functor. Namely, if C and D are triangulated categories with C compactly generated and F a triangulated functor commuting with arbitrary direct sums, then F is a left adjoint. Neeman has applied this to proving the Grothendieck duality theorem in algebraic geometry.\n\nJacob Lurie has proved a version of the Brown representability theorem for the homotopy category of a pointed quasicategory with a compact set of generators which are cogroup objects in the homotopy category. For instance, this applies to the homotopy category of pointed connected CW complexes, as well as to the unbounded derived category of a Grothendieck abelian category (in view of Lurie's higher-categorical refinement of the derived category).\n\nReferences\n\nCategory:Homotopy theory\nCategory:Category theory\nCategory:Representable functors\nCategory:Theorems in algebraic topology"
    },
    {
      "title": "Cellular approximation theorem",
      "url": "https://en.wikipedia.org/wiki/Cellular_approximation_theorem",
      "text": "In algebraic topology, in the cellular approximation theorem, a map between CW-complexes can always be taken to be of a specific type. Concretely, if X and Y are CW-complexes, and f : X → Y is a continuous map, then f is said to be cellular, if f takes the n-skeleton of X to the n-skeleton of Y for all n, i.e. if  for all n. The content of the cellular approximation theorem is then that any continuous map f : X → Y between CW-complexes X and Y is homotopic to a cellular map, and if f is already cellular on a subcomplex A of X, then we can furthermore choose the homotopy to be stationary on A. From an algebraic topological viewpoint, any map between CW-complexes can thus be taken to be cellular.\n\n Idea of proof \n\nThe proof can be given by induction after n, with the statement that f is cellular on the skeleton Xn. For the base case n=0, notice that every path-component of Y must contain a 0-cell. The image under f of a 0-cell of X can thus be connected to a 0-cell of Y by a path, but this gives a homotopy from f to a map which is cellular on the 0-skeleton of X.\n\nAssume inductively that f is cellular on the (n − 1)-skeleton of X, and let en  be an n-cell of X. The closure of en is compact in X, being the image of the characteristic map of the cell, and hence the image of the closure of en under f is also compact in Y. Then it is a general result of CW-complexes that any compact subspace of a CW-complex meets (that is, intersects non-trivially) only finitely many cells of the complex. Thus f(en) meets at most finitely many cells of Y, so we can take  to be a cell of highest dimension meeting f(en). If , the map f is already cellular on en, since in this case only cells of the n-skeleton of Y meets f(en), so we may assume that k > n. It is then a technical, non-trivial result (see Hatcher) that the restriction of f to  can be homotoped relative to Xn-1 to a map missing a point p ∈ ek. Since Yk − {p} deformation retracts onto the subspace Yk-ek, we can further homotope the restriction of f to  to a map, say, g, with the property that g(en) misses the cell ek of Y, still relative to Xn-1. Since f(en) met only finitely many cells of Y to begin with, we can repeat this process finitely many times to make  miss all cells of Y of dimension larger than n.\n\nWe repeat this process for every n-cell of X, fixing cells of the subcomplex A on which f is already cellular, and we thus obtain a homotopy (relative to the (n − 1)-skeleton of X and the n-cells of A) of the restriction of f to Xn to a map cellular on all cells of X of dimension at most n. Using then the homotopy extension property to extend this to a homotopy on all of X, and patching these homotopies together, will finish the proof. For details, consult Hatcher.\n\n Applications \n Some homotopy groups \n\nThe cellular approximation theorem can be used to immediately calculate some homotopy groups. In particular, if , then : Give  and  their canonical CW-structure, with one 0-cell each, and with one n-cell for  and one k-cell for . Any base-point preserving map f:→ is by the cellular approximation theorem homotopic to a constant map, whence .\n\n Cellular approximation for pairs \n\nLet f:(X,A)→(Y,B) be a map of CW-pairs, that is, f is a map from X to Y, and the image of  under f sits inside B. Then f is homotopic to a cellular map (X,A)→(Y,B). To see this, restrict f to A and use cellular approximation to obtain a homotopy of f to a cellular map on A. Use the homotopy extension property to extend this homotopy to all of X, and apply cellular approximation again to obtain a map cellular on X, but without violating the cellular property on A.\n\nAs a consequence, we have that a CW-pair (X,A) is n-connected, if all cells of  have dimension strictly greater than n: If , then any map →(X,A) is homotopic to a cellular map of pairs, and since the n-skeleton of X sits inside A, any such map is homotopic to a map whose image is in A, and hence it is 0 in the relative homotopy group .\nWe have in particular that  is n-connected, so it follows from the long exact sequence of homotopy groups for the pair  that we have isomorphisms → for all  and a surjection →.\n\n References \n \n\nCategory:Theorems in algebraic topology"
    },
    {
      "title": "Dold–Thom theorem",
      "url": "https://en.wikipedia.org/wiki/Dold%E2%80%93Thom_theorem",
      "text": "In algebraic topology, the Dold–Thom theorem, proved by , states that the homotopy group πi(SP(X)) of the infinite symmetric product SP(X) of a connected CW complex X is the i-th singular reduced homology group of X, usually denoted by  .\n\nReferences\n\nSpecific\n\n External links \nhttp://mathoverflow.net/questions/37647/the-dold-thom-theorem-for-infinity-categories\n\nCategory:Theorems in algebraic topology"
    },
    {
      "title": "Eilenberg–Ganea conjecture",
      "url": "https://en.wikipedia.org/wiki/Eilenberg%E2%80%93Ganea_conjecture",
      "text": "The Eilenberg–Ganea conjecture is a claim in algebraic topology.  It was formulated by Samuel Eilenberg and Tudor Ganea in 1957, in a short, but influential paper.  It states that if a group G has cohomological dimension 2, then it has a 2-dimensional Eilenberg–MacLane space .  For n different from 2, a group G of cohomological dimension n has an n-dimensional Eilenberg–MacLane space. It is also known that a group of cohomological dimension 2 has a 3-dimensional Eilenberg−MacLane space.\n\nIn 1997,  Mladen Bestvina and Noel Brady constructed a group G so that either G is a counterexample to the Eilenberg–Ganea conjecture, or there must be a counterexample to the Whitehead conjecture; in other words, not both conjectures can be true. \n\nReferences\n\nCategory:Conjectures\nCategory:Theorems in algebraic topology"
    },
    {
      "title": "Eilenberg–Ganea theorem",
      "url": "https://en.wikipedia.org/wiki/Eilenberg%E2%80%93Ganea_theorem",
      "text": "In mathematics, particularly in homological algebra and algebraic topology, the Eilenberg–Ganea theorem states for every finitely generated group G with certain conditions on its cohomological dimension (namely ), one can construct an aspherical CW complex X of dimension n whose fundamental group is G. The theorem is named after Polish mathematician Samuel Eilenberg and Romanian mathematician Tudor Ganea. The theorem was first published in a short paper in 1957 in the Annals of Mathematics.**\n\nDefinitions\nGroup cohomology: Let  be a group and let  be the corresponding Eilenberg−MacLane space. Then we have the following singular chain complex which is a free resolution of  over the group ring  (where  is a trivial -module):\n\nwhere  is the universal cover of  and  is the free abelian group generated by the singular -chains on .  The group cohomology of the group  with coefficient in a -module  is the cohomology of this chain complex with coefficients in , and is denoted by .\n\nCohomological dimension: A group  has cohomological dimension  with coefficients in  (denoted by ) if \n\nFact: If  has a projective resolution of length at most , i.e.,  as trivial  module has a projective resolution of length at most  if and only if  for all -modules  and for all .\n\nTherefore we have an alternative definition of cohomological dimension as follows,\n\nCohomological dimension of G with coefficient in Z is the smallest n (possibly infinity) such that G has a projective resolution of length n, i.e., Z has a projective resolution of length n as a trivial Z[G] module.\n\nEilenberg−Ganea theorem\nLet G be a finitely presented group and n ≥ 3 be an integer. Suppose cohomological dimension of G with coefficients in Z, i.e. cdZ(G) ≤ n.  Then there exists an n-dimensional  aspherical CW complex X such that the fundamental group of X is G i.e. π1(X) = G.\n\nConverse\nConverse of this theorem is an consequence of cellular homology, and the fact that every free module is projective.\n\nTheorem: Let X be an aspherical n-dimensional CW complex with π1(X) = G, then cdZ(G) ≤ n.\n\nRelated results and conjectures\nFor n = 1 the result is one of the consequences of Stallings theorem about ends of groups.* John R. Stallings, \"On torsion-free groups with infinitely many ends\", Annals of Mathematics 88 (1968), 312–334.   \n\nTheorem: Every finitely generated group of cohomological dimension one is free.\n\nFor  the statement is  known as Eilenberg–Ganea conjecture.\n\nEilenberg−Ganea Conjecture: If a group G has cohomological dimension 2 then there is a 2-dimensional aspherical CW complex X with .\n\nIt is known that given a group G with cdZ(G) = 2 there exists a 3-dimensional aspherical CW complex X with π1(X) = G.\n\n See also \n Eilenberg–Ganea conjecture\n Group cohomology\n Cohomological dimension\n Stallings theorem about ends of groups\n\n References \n\n.\nKenneth S. Brown, Cohomology of groups, Corrected reprint of the 1982 original,  Graduate Texts in Mathematics, 87, Springer-Verlag, New York, 1994. .  \n\nCategory:Homological algebra\nCategory:Theorems in algebraic topology"
    },
    {
      "title": "Eilenberg–Zilber theorem",
      "url": "https://en.wikipedia.org/wiki/Eilenberg%E2%80%93Zilber_theorem",
      "text": "In mathematics, specifically in algebraic topology, the Eilenberg–Zilber theorem is an important result in establishing the link between the homology groups of a product space  and those of the spaces  and . The theorem first appeared in a 1953 paper in the American Journal of Mathematics by Samuel Eilenberg and Joseph A. Zilber.  One possible route to a proof is the acyclic model theorem.\n\nStatement of the theorem\nThe theorem can be formulated as follows. Suppose  and  are topological spaces, Then we have the three chain complexes , , and . (The argument applies equally to the simplicial or singular chain complexes.) We also have the tensor product complex , whose differential is, by definition, \n\nfor  and ,  the differentials on ,.\n\nThen the theorem says that we have chain maps\n\nsuch that  is the identity and  is chain-homotopic to the identity. Moreover, the maps are natural in  and . Consequently the two complexes must have the same homology:\n\nAn important generalisation to the non-abelian case using crossed complexes is given in the paper by Andrew Tonks below. This give full details of a result on the (simplicial) classifying space of a crossed complex stated but not proved in the paper by Ronald Brown and Philip J. Higgins on classifying spaces.\n\nConsequences\nThe Eilenberg–Zilber theorem is a key ingredient in establishing the Künneth theorem, which expresses the homology groups  in terms of  and . In light of the Eilenberg–Zilber theorem, the content of the Künneth theorem consists in analysing how the homology of the tensor product complex relates to the homologies of the factors.\n\n See also \n Acyclic model\n\nReferences\n.\n.\n.\n.\n\nCategory:Homological algebra\nCategory:Theorems in algebraic topology"
    },
    {
      "title": "Freudenthal suspension theorem",
      "url": "https://en.wikipedia.org/wiki/Freudenthal_suspension_theorem",
      "text": "In mathematics, and specifically in the field of homotopy theory, the Freudenthal suspension theorem is the fundamental result leading to the concept of stabilization of homotopy groups and ultimately to stable homotopy theory.  It explains the behavior of simultaneously taking suspensions and increasing the index of the homotopy groups of the space in question. It was proved in 1937 by Hans Freudenthal.\n\nThe theorem is a corollary of the homotopy excision theorem.\n\nStatement of the theorem\nLet X be an n-connected pointed space (a pointed CW-complex or pointed simplicial set). The map\n\ninduces a map\n\non homotopy groups, where Ω denotes the loop functor and Σ denotes the reduced suspension functor. The suspension theorem then states that the induced map on homotopy groups is an isomorphism if k ≤ 2n and an epimorphism if k = 2n + 1.\n\nA basic result on loop spaces gives the relation\n\nso the theorem could otherwise be stated in terms of the map\n\nwith the small caveat that in this case one must be careful with the indexing.\n\nProof\n\nAs mentioned above, the Freudenthal suspension theorem follows quickly from homotopy excision; this proof is in terms of the natural map . If a space  is -connected, then the pair of spaces  is -connected, where  is the reduced cone over ; this follows from the relative homotopy long exact sequence. We can decompose  as two copies of , say , whose intersection is . Then, homotopy excision says the inclusion map: \n\n \n\ninduces isomorphisms on  and a surjection on . From the same relative long exact sequence,  and since in addition cones are contractible, \n\nPutting this all together, we get \n\n \n\nfor , i.e. , as claimed above; for  the left and right maps are isomorphisms, regardless of how connected  is, and the middle one is a surjection by excision, so the composition is a surjection as claimed.\n\nCorollary 1\n\nLet Sn denote the n-sphere and note that it is (n − 1)-connected so that the groups  stabilize for  by the Freudenthal theorem. These groups represent the kth stable homotopy group of spheres.\n\nCorollary 2\n\nMore generally, for fixed k ≥ 1, k ≤ 2n for sufficiently large n, so that any n-connected space X will have corresponding stabilized homotopy groups.  These groups are actually the homotopy groups of an object corresponding to X in the stable homotopy category.\n\nReferences\n.\n.\n\n.\n\nCategory:Homotopy theory\nCategory:Theorems in algebraic topology"
    },
    {
      "title": "Fundamental theorem of algebraic K-theory",
      "url": "https://en.wikipedia.org/wiki/Fundamental_theorem_of_algebraic_K-theory",
      "text": "In algebra, the fundamental theorem of algebraic K-theory describes the effects of changing the ring of K-groups from a ring R to  or . The theorem was first proved by Bass for  and was later extended to higher K-groups by Quillen.\n\nLet  be the algebraic K-theory of the category of finitely generated modules over a noetherian ring R; explicitly, we can take , where  is given by Quillen's Q-construction. If R is a regular ring (i.e., has finite global dimension), then  the i-th K-group of R.By definition, . This is an immediate consequence of the resolution theorem, which compares the K-theories of two different categories (with inclusion relation.)\n\nFor a noetherian ring R, the fundamental theorem states:\n(i) .\n(ii) .\n\nThe proof of the theorem uses the Q-construction. There is also a version of the theorem for the singular case (for ); this is the version proved in Grayson's paper.\n\n References \n\nDaniel Grayson, Higher algebraic K-theory II [after Daniel Quillen], 1976\n\nC. Weibel \"The K-book: An introduction to algebraic K-theory\"\n\nCategory:Algebraic K-theory\nCategory:Theorems in algebraic topology"
    },
    {
      "title": "Hairy ball theorem",
      "url": "https://en.wikipedia.org/wiki/Hairy_ball_theorem",
      "text": "thumb|A failed attempt to comb a hairy 3-ball (2-sphere), leaving a tuft at each pole\nthumb|A hairy doughnut (2-torus), on the other hand, is quite easily combable.\nthumb|A continuous tangent vector field on a 2-sphere with only one pole, in this case a dipole field with index 2. See also an animated version of this graphic.\nthumb|A hair whorl\n\nThe hairy ball theorem of algebraic topology (sometimes called the hedgehog theorem in Europe) states that there is no nonvanishing continuous tangent vector field on even-dimensional n-spheres. For the ordinary sphere, or 2‑sphere, if f is a continuous function that assigns a vector in R3 to every point p on a sphere such that f(p) is always tangent to the sphere at p, then there is at least one p such that f(p) = 0. The theorem was first stated by Henri Poincaré in the late 19th century, and first proven in 1912 by Luitzen Egbertus Jan Brouwer.Georg-August-Universität Göttingen \n\nThe theorem has been expressed colloquially as \"you can't comb a hairy ball flat without creating a cowlick\" or \"you can't comb the hair on a coconut\". \n\nCounting zeros\nEvery zero of a vector field has a non-zero) \"index\", and it can be shown that the sum of all of the indices at all of the zeros must be two, because the Euler characteristic of the 2-sphere is two. Therefore, there must be at least one zero. This is a consequence of the Poincaré–Hopf theorem. In the case of the torus, the Euler characteristic is 0; and it is possible to \"comb a hairy doughnut flat\". In this regard, it follows that for any compact regular 2-dimensional manifold with non-zero Euler characteristic, any continuous tangent vector field has at least one zero.\n\nCyclone consequences\n\nA meteorological application of this theorem involves considering the wind as a vector defined at every point continuously over the surface of a planet with an atmosphere. As an idealisation, take wind to be a two-dimensional vector, so that any vertical motion is ignored. One scenario, in which there is absolutely no wind, corresponds to a field of zero-vectors. But in the case where there is at least some wind, the Hairy Ball Theorem dictates that at all times there must be at least one point on a planet with no wind at all and therefore a tuft. This corresponds to the above statement that there will always be p such that f(p) = 0.\n\nIn a physical sense, this zero-wind point will be the center of a cyclone or anticyclone. Like the swirled hairs on the tennis ball, the wind will spiral around this zero-wind point - under the assumptions made, it cannot flow into or out of the point. Thus, given at least some wind on Earth, there must at all times be a cyclone or anticyclone somewhere. The center with zero wind can be arbitrarily large or small. Mathematical consistency dictates the wind forms a cyclonic wind pattern for at least one point on the planet, but this does not require the cyclone be a violent storm. \n\nThe assumptions break down in reality, as the air above the earth has multiple layers, but for each layer there must be a point with zero horizontal wind speed.\n\nApplication to computer graphics\nA common problem in computer graphics is to generate a non-zero vector in R3 that is orthogonal to a given non-zero one. There is no single continuous function that can do this for all non-zero vector inputs. This is a corollary of the hairy ball theorem. To see this, consider the given vector as the radius of a sphere and note that finding a non-zero vector orthogonal to the given one is equivalent to finding a non-zero vector that is tangent to the surface of that sphere where it touches the radius. However, the hairy ball theorem says there exists no continuous function that can do this for every point on the sphere (equivalently, for every given vector).\n\nLefschetz connection\nThere is a closely related argument from algebraic topology, using the Lefschetz fixed-point theorem. Since the Betti numbers of a 2-sphere are 1, 0, 1, 0, 0, ... the Lefschetz number (total trace on homology) of the identity mapping is 2. By integrating a vector field we get (at least a small part of) a one-parameter group of diffeomorphisms on the sphere; and all of the mappings in it are homotopic to the identity. Therefore, they all have Lefschetz number 2, also. Hence they have fixed points (since the Lefschetz number is nonzero). Some more work would be needed to show that this implies there must actually be a zero of the vector field. It does suggest the correct statement of the more general Poincaré-Hopf index theorem.\n\nCorollary\nA consequence of the hairy ball theorem is that any continuous function that maps an even-dimensional sphere into itself has either a fixed point or a point that maps onto its own antipodal point.  This can be seen by transforming the function into a tangential vector field as follows.\n\nLet s be the function mapping the sphere to itself, and let v be the tangential vector function to be constructed.  For each point p, construct the stereographic projection of s(p) with p as the point of tangency.  Then v(p) is the displacement vector of this projected point relative to p.  According to the hairy ball theorem, there is a p such that v(p) = 0, so that s(p) = p.\n\nThis argument breaks down only if there exists a point p for which s(p) is the antipodal point of p, since such a point is the only one that cannot be stereographically projected onto the tangent plane of p.\n\nHigher dimensions\nThe connection with the Euler characteristic χ suggests the correct generalisation: the 2n-sphere has no non-vanishing vector field for . The difference between even and odd dimensions is that, because the only nonzero Betti numbers of the m-sphere are b0 and bm, their alternating sum χ is 2 for m even, and 0 for m odd.\n\nSee also\nFixed-point theorem\nIntermediate value theorem\nVector fields on spheres\n\nNotes\n\nReferences\n \n\nFurther reading\n \n \n \n\nExternal links\n\nCategory:Differential topology\nCategory:Fixed points (mathematics)\nCategory:Theorems in algebraic topology"
    },
    {
      "title": "Hattori–Stong theorem",
      "url": "https://en.wikipedia.org/wiki/Hattori%E2%80%93Stong_theorem",
      "text": "In algebraic topology, the Hattori–Stong theorem, proved by  and ,  gives an isomorphism between the stable homotopy of a Thom spectrum and the primitive elements of its K-homology.\n\nReferences\n\nCategory:Theorems in algebraic topology"
    },
    {
      "title": "Hilton's theorem",
      "url": "https://en.wikipedia.org/wiki/Hilton%27s_theorem",
      "text": "In algebraic topology, Hilton's theorem, proved by ,  states that the loop space of a wedge of spheres is homotopy-equivalent to a product of loop spaces of spheres.\n\n showed more generally that the loop space of the suspension of a wedge of spaces can be written as an infinite product of loop spaces of suspensions of smash products.\n\nReferences\n\nCategory:1955 in mathematics\nCategory:Theorems in algebraic topology"
    },
    {
      "title": "Hirzebruch signature theorem",
      "url": "https://en.wikipedia.org/wiki/Hirzebruch_signature_theorem",
      "text": "In differential topology, an area of mathematics, the Hirzebruch signature theorem (sometimes called the Hirzebruch index theorem)\nis Friedrich Hirzebruch's 1954 result expressing the signature \nof a smooth compact oriented manifold by a linear combination of Pontryagin numbers called the \nL-genus.\nIt was used in the proof of the Hirzebruch–Riemann–Roch theorem.\n\nStatement of the theorem\nThe L-genus is the genus for the multiplicative sequence of polynomials\nassociated to the characteristic power series\n\nThe first two of the resulting L-polynomials are:\n\nBy taking for the  the Pontryagin classes  of the tangent bundle of a 4n dimensional smooth compact and oriented\nmanifold M one obtains the L-classes of M.\nHirzebruch showed that the n-th L-class of M evaluated on the fundamental class of M, , is equal to , the signature of M \n(i.e. the signature of the intersection form on the 2nth cohomology group of M ):\n\nSketch of proof of the signature theorem\nRené Thom had earlier proved that the signature was given by some linear combination of Pontryagin numbers, and Hirzebruch found the exact formula for this linear combination \nby introducing the notion of the genus of a multiplicative sequence. \n\nSince the rational oriented cobordism ring  is equal to\n\nthe polynomial algebra generated by the oriented cobordism classes \n of the even dimensional complex projective spaces,\nit is enough to verify that\n \nfor all i.\n\nGeneralizations\nThe signature theorem is a special case of the Atiyah–Singer index theorem for\nthe signature operator.\nThe analytic index of the signature operator equals the signature of the manifold, and its topological index is the L-genus of the manifold.\nBy the Atiyah–Singer index theorem these are equal.\n\nReferences\n\n F. Hirzebruch, The Signature Theorem. Reminiscences and recreation. Prospects in Mathematics, Annals of Mathematical Studies, Band 70, 1971, S. 3–31.\n \n\nCategory:Theorems in differential topology\nCategory:Theorems in algebraic topology"
    },
    {
      "title": "Homotopy excision theorem",
      "url": "https://en.wikipedia.org/wiki/Homotopy_excision_theorem",
      "text": "In algebraic topology, the homotopy excision theorem offers a substitute for the absence of excision in homotopy theory. More precisely, let  be an excisive triad with  nonempty, and suppose the pair  is ()-connected, , and the pair  is ()-connected, . Then the map induced by the inclusion \n\nis bijective for  and is surjective for . \n\nA nice geometric proof is given in the book by tom Dieck.T. tom Dieck, Algebraic Topology, EMS Textbooks in Mathematics, (2008).\n\nThis result should also be seen as a consequence of the Blakers–Massey theorem, the most general form of which, dealing with the non-simply-connected case.R. Brown and J.-L. Loday, Homotopical excision and Hurewicz theorems for n-cubes of spaces, Proc. London Math. Soc., (3) 54 (1987) 176-192.\n\nThe most important consequence is the Freudenthal suspension theorem.\n\n References \n\n Bibliography \n J.P. May, A Concise Course in Algebraic Topology, Chicago University Press.\n\nCategory:Homotopy theory\nCategory:Theorems in algebraic topology"
    },
    {
      "title": "Hurewicz theorem",
      "url": "https://en.wikipedia.org/wiki/Hurewicz_theorem",
      "text": "In mathematics, the Hurewicz theorem is a basic result of algebraic topology, connecting homotopy theory with homology theory via a map known as the Hurewicz homomorphism. The theorem is named after Witold Hurewicz, and generalizes earlier results of Henri Poincaré.\n\nStatement of the theorems\nThe Hurewicz theorems are a key link between homotopy groups and homology groups.\n\nAbsolute version\nFor any space X and positive integer k there exists a group homomorphism\n\ncalled the Hurewicz homomorphism from the k-th homotopy group to the k-th homology group (with integer coefficients), which for k = 1 and X path-connected is equivalent to the canonical abelianization map\n\nThe Hurewicz theorem states that if X is (n − 1)-connected, the Hurewicz map is an isomorphism for all k ≤ n when n ≥ 2 and abelianization for k = 1. In particular, this theorem says that the abelianization of the first homotopy group (the fundamental group) is isomorphic to the first homology group:\n\nThe first homology group therefore vanishes if X is path-connected and π1(X) is a perfect group.\n\nIn addition, the Hurewicz homomorphism is an epimorphism from  whenever X is (n − 1)-connected, for .* \n\nThe group homomorphism is given in the following way. Choose canonical generators . Then a homotopy class of maps  is taken to .\n\nRelative version\nFor any pair of spaces (X,A) and integer k > 1 there exists a homomorphism\n\nfrom relative homotopy groups to relative homology groups. The Relative Hurewicz Theorem states that if each of X, A are connected and the pair (X,A) is (n−1)-connected then Hk(X,A) = 0 for k < n and Hn(X,A) is obtained from πn(X,A) by factoring out the action of π1(A). This is proved in, for example,  by induction, proving in turn the absolute version and the Homotopy Addition Lemma.\n\nThis relative Hurewicz theorem is reformulated by  as a statement about the morphism \n\nThis statement is a special case of a homotopical excision theorem, involving induced modules for n > 2 (crossed modules if n = 2), which itself is deduced from a higher homotopy van Kampen theorem for relative homotopy groups, whose proof requires development of techniques of a cubical higher homotopy groupoid of a filtered space.\n\nTriadic version\nFor any triad of spaces (X;A,B) (i.e. space X and subspaces A,B) and integer k > 2 there exists a homomorphism\n\nfrom triad homotopy groups to triad homology groups. Note that \n\nThe Triadic Hurewicz Theorem states that if X, A, B, and C = A∩B are connected, the pairs (A,C), (B,C) are respectively (p−1)-, (q−1)-connected, and the triad (X;A,B) is p+q−2 connected, then Hk(X;A,B) = 0 for k < p+q−2 and Hp+q−1(X;A) is obtained from πp+q−1(X;A,B) by factoring out the action of π1(A∩B) and the generalised Whitehead products. The proof of this theorem uses a higher homotopy van Kampen type theorem for triadic homotopy groups, which requires a notion of the fundamental catn-group of an n-cube of spaces.\n\nSimplicial set version\nThe Hurewicz theorem for topological spaces can also be stated for n-connected simplicial sets satisfying the Kan condition., III.3.6, 3.7\n\nRational Hurewicz theorem\n\nRational Hurewicz theorem: Let X be a simply connected topological space with  for . Then the Hurewicz map \n\ninduces an isomorphism for  and a surjection for .\n\nNotes\n\nReferences\n \n\n \n \n \n\n \n \n\nCategory:Homotopy theory\nCategory:Homology theory\nCategory:Theorems in algebraic topology"
    },
    {
      "title": "Karoubi conjecture",
      "url": "https://en.wikipedia.org/wiki/Karoubi_conjecture",
      "text": "In mathematics, the Karoubi conjecture is a conjecture by  that the  algebraic and topological K-theories coincide on  C* algebras spatially tensored with the algebra of compact operators. It was proved by .\n\nReferences\n\nCategory:Operator algebras\nCategory:K-theory\nCategory:Theorems in algebraic topology"
    },
    {
      "title": "Künneth theorem",
      "url": "https://en.wikipedia.org/wiki/K%C3%BCnneth_theorem",
      "text": "In mathematics, especially in homological algebra and algebraic topology, a Künneth theorem, also called a Künneth formula, is a statement relating the homology of two objects to the homology of their product. The classical statement of the Künneth theorem relates the singular homology of two topological spaces X and Y and their product space . In the simplest possible case the relationship is that of a tensor product, but for applications it is very often necessary to apply certain tools of homological algebra to express the answer.\n\nA Künneth theorem or Künneth formula is true in many different homology and cohomology theories, and the name has become generic. These many results are named for the German mathematician Hermann Künneth.\n\n Singular homology with coefficients in a field \nLet X and Y be two topological spaces.  In general one uses singular homology; but if X and Y happen to be CW complexes, then this can be replaced by cellular homology, because that is isomorphic to singular homology. The simplest case is when the coefficient ring  for homology is a field F. In this situation, the Künneth theorem (for singular homology) states that for any integer k,\n\n.\n\nFurthermore, the isomorphism is a natural isomorphism. The map from the sum to the homology group of the product is called the cross product. More precisely, there is a cross product operation by which an i-cycle on X and a j-cycle on Y can be combined to create an  -cycle on ; so that there is an explicit linear mapping defined from the direct sum to .\n\nA consequence of this result is that the Betti numbers, the dimensions of the homology with  coefficients, of  can be determined from those of X and Y. If  is the generating function of the sequence of Betti numbers  of a space Z, then\n\n \n\nHere when there are finitely many Betti numbers of X and Y, each of which is a natural number rather than , this reads as an identity on Poincaré polynomials. In the general case these are formal power series with possibly infinite coefficients, and have to be interpreted accordingly. Furthermore, the above statement holds not only for the Betti numbers but also for the generating functions of the dimensions of the homology over any field. (If the integer homology is not torsion-free, then these numbers may differ from the standard Betti numbers.)\n\n Singular homology with coefficients in a principal ideal domain \nThe above formula is simple because vector spaces over a field have very restricted behavior. As the coefficient ring becomes more general, the relationship becomes more complicated. The next simplest case is the case when the coefficient ring is a principal ideal domain. This case is particularly important because the integers  are a PID.\n\nIn this case the equation above is no longer always true. A correction factor appears to account for the possibility of torsion phenomena. This correction factor is expressed in terms of the Tor functor, the first derived functor of the tensor product.\n\nWhen R is a PID, then the correct statement of the Künneth theorem is that for any topological spaces X and Y there are natural short exact sequences\n\nFurthermore, these sequences split, but not canonically.\n\n Example \nThe short exact sequences just described can easily be used to compute the homology groups with integer coefficients of the product  of two real projective planes, in other words, . These spaces are CW complexes. Denoting the homology group   by  for brevity's sake, one knows from a simple calculation with cellular homology that \n, \n,\n for all other values of i. \nThe only non-zero Tor group (torsion product) which can be formed from these values of  is \n.\nTherefore, the Künneth short exact sequence reduces in every degree to an isomorphism, because there is a zero group in each case on either the left or the right side in the sequence. The result is\n\nand all the other homology groups are zero.\n\n The Künneth spectral sequence \nFor a general commutative ring R, the homology of X and Y is related to the homology of their product by a  Künneth spectral sequence \n \nIn the cases described above, this spectral sequence collapses to give an isomorphism or a short exact sequence.\n\n Relation with homological algebra, and idea of proof \nThe chain complex of the space X × Y is related to the chain complexes of X and Y by a natural quasi-isomorphism\n\nFor singular chains this is the theorem of Eilenberg and Zilber. For cellular chains on CW complexes, it is a straightforward isomorphism.  Then the homology of the tensor product on the right is given by the spectral Künneth formula of homological algebra.See final chapter of \n\nThe freeness of the chain modules means that in this geometric case it is not necessary to use any hyperhomology or total derived tensor product.\n\nThere are analogues of the above statements for singular cohomology and sheaf cohomology. For sheaf cohomology on an algebraic variety, Alexander Grothendieck found six spectral sequences relating the possible hyperhomology groups of two chain complexes of sheaves and the hyperhomology groups of their tensor product. (EGA III2, Théorème 6.7.3.).\n\n Künneth theorems in generalized homology and cohomology theories \nThere are many generalized (or \"extraordinary\") homology and cohomology theories for topological spaces. K-theory and cobordism are the best-known. Unlike ordinary homology and cohomology, they typically cannot be defined using chain complexes. Thus Künneth theorems can not be obtained by the above methods of homological algebra.  Nevertheless, Künneth theorems in just the same form have been proved in very many cases by various other methods.  The first were Michael Atiyah's Künneth theorem for complex K-theory and Pierre Conner and Edwin E. Floyd's result in cobordism.  A general method of proof emerged, based upon a homotopical theory of modules over highly structured ring spectra.  The homotopy category of such modules closely resembles the derived category in homological algebra.\n\n References \n\n External links \n\nCategory:Homological algebra\nCategory:Theorems in algebraic topology"
    },
    {
      "title": "Lefschetz fixed-point theorem",
      "url": "https://en.wikipedia.org/wiki/Lefschetz_fixed-point_theorem",
      "text": "In mathematics, the Lefschetz fixed-point theorem is a formula that counts the fixed points of a continuous mapping from a compact topological space X to itself  by means of traces of the induced mappings on the homology groups of X. It is named after Solomon Lefschetz, who first stated it in 1926.\n\nThe counting is subject to an imputed multiplicity at a fixed point called the fixed point index. A weak version of the theorem is enough to show that a mapping without any fixed point must have rather special topological properties (like a rotation of a circle).\n\nFormal statement\nFor a formal statement of the theorem, let\n\nbe a continuous map from a compact triangulable space  to itself. Define the Lefschetz number  of  by \n\nthe alternating (finite) sum of the matrix traces of the linear maps induced by  on , the singular homology groups of  with rational coefficients. \n\nA simple version of the Lefschetz fixed-point theorem states: if\n\nthen  has at least one fixed point, i.e., there exists at least one x in  such that .  In fact, since the Lefschetz number has been defined at the homology level, the conclusion can be extended to say that any map homotopic to  has a fixed point as well.\n\nNote however that the converse is not true in general:  may be zero even if f has fixed points.\n\n Sketch of a proof \nFirst, by applying the simplicial approximation theorem, one shows that if  has no fixed points, then (possibly after subdividing X)  is homotopic to a fixed-point-free simplicial map (i.e., it sends each simplex to a different simplex).  This means that the diagonal values of the matrices of the linear maps induced on the simplicial chain complex of X must be all be zero.  Then one notes that, in general, the Lefschetz number can also be computed using the alternating sum of the matrix traces of the aforementioned linear maps (this is true for almost exactly the same reason that the Euler characteristic has a definition in terms of homology groups; see below for the relation to the Euler characteristic).  In the particular case of a fixed-point-free simplicial map, all of the diagonal values are zero, and thus the traces are all zero.\n\n Lefschetz–Hopf theorem \nA stronger form of the theorem, also known as the Lefschetz–Hopf theorem, states that, if  has only finitely many fixed points, then \n\nwhere  is the set of fixed points of , and  denotes the index of the fixed point x., Proposition VII.6.6. From this theorem one deduces the Poincaré–Hopf theorem for vector fields.\n\nRelation to the Euler characteristic\nThe Lefschetz number of the identity map on a finite CW complex can be easily computed by realizing that each  can be thought of as an identity matrix, and so each trace term is simply the dimension of the appropriate homology group. Thus the Lefschetz number of the identity map is equal to the alternating sum of the Betti numbers of the space, which in turn is equal to the Euler characteristic . Thus we have\n\nRelation to the Brouwer fixed point theorem\nThe Lefschetz fixed point theorem generalizes the Brouwer fixed point theorem, which states that every continuous map from the n-dimensional closed unit disk  to  must have at least one fixed point. \n\nThis can be seen as follows:  is compact and triangulable, all its homology groups except  are zero, and every continuous map  induces the identity map , whose trace is one; all this together implies that  is non-zero for any continuous map .\n\nHistorical context\nLefschetz presented his fixed point theorem in . Lefschetz's focus was not on fixed points of maps, but rather on what are now called coincidence points of maps. \n\nGiven two maps f and g from an orientable manifold X to an orientable manifold Y of the same dimension, the Lefschetz coincidence number of f and g is defined as\n\nwhere  is as above,  is the homomorphism induced by  on the cohomology groups with rational coefficients, and  and  are the Poincaré duality isomorphisms for X and Y, respectively.\n\nLefschetz proved that if the coincidence number is nonzero, then f and g have a coincidence point. He noted in his paper that letting  and letting g be the identity map gives a simpler result, which we now know as the fixed point theorem.\n\n Frobenius \nLet  be a variety defined over the finite field  with  elements and let  be the lift of  to the algebraic closure of . The Frobenius endomorphism of  (often the geometric Frobenius, or just the Frobenius), denoted by  , maps a point with coordinates  to the point with coordinates . Thus the fixed points of  are exactly the points of  with coordinates in ; the set of such points is denoted by .  The Lefschetz trace formula holds in this context, and reads:\n\nThis formula involves the trace of the Frobenius on the étale cohomology, with compact supports, of  with values in the field of -adic numbers, where  is a prime coprime to . \n\nIf  is smooth and equidimensional, this formula can be rewritten in terms of the arithmetic Frobenius , which acts as the inverse of  on cohomology:\n\nThis formula involves usual cohomology, rather than cohomology with compact supports.\n\nThe Lefschetz trace formula can also be generalized to algebraic stacks over finite fields.\n\nSee also\n\nFixed point theorems\nLefschetz zeta function\nHolomorphic Lefschetz fixed-point formula\n\nNotes\n\nReferences\n \n \n\nExternal links\n \n\nCategory:Fixed-point theorems\nCategory:Continuous mappings\nCategory:Theorems in algebraic topology"
    },
    {
      "title": "Leray–Hirsch theorem",
      "url": "https://en.wikipedia.org/wiki/Leray%E2%80%93Hirsch_theorem",
      "text": "In mathematics, the Leray–Hirsch theorem is a basic result on the algebraic topology of fiber bundles. It is named after Jean Leray and Guy Hirsch, who independently proved it in the late 1940s. It can be thought of as a mild generalization of the Künneth formula, which computes the cohomology of a product space as a tensor product of the cohomologies of the direct factors. It is a very special case of the Leray spectral sequence.\n\nStatement\n\nSetup\nLet \nbe a fibre bundle with fibre . Assume that for each degree , the singular cohomology rational vector space\n\nis finite-dimensional, and that the inclusion \n\ninduces a surjection in rational cohomology \n.\nConsider a section of this surjection \n, \nby definition, this map satisfies \n.\n\nThe Leray–Hirsch isomorphism\nThe Leray–Hirsch theorem states that the linear map \n\nis an isomorphism of -modules.\n\nStatement in coordinates\nIn other words, if for every , there exist classes\n\nthat restrict, on each fiber , to a basis of the cohomology in degree , the map given below is then an isomorphism of  modules.\n\nwhere  is a basis for  and thus, induces a basis  for \n\nNotes\n\nCategory:Fiber bundles\nCategory:Theorems in algebraic topology"
    },
    {
      "title": "Milnor conjecture",
      "url": "https://en.wikipedia.org/wiki/Milnor_conjecture",
      "text": "In mathematics, the Milnor conjecture was a proposal by  of a description of the Milnor K-theory (mod 2) of a general field F with characteristic different from 2, by means of the Galois (or equivalently étale) cohomology of F with coefficients in Z/2Z. It was proved by .\n\nStatement of the theorem\nLet F be a field of characteristic different from 2. Then there is an isomorphism\n\nfor all n ≥ 0, where KM denotes the Milnor ring.\n\nAbout the proof\nThe proof of this theorem by Vladimir Voevodsky uses several ideas developed by Voevodsky, Alexander Merkurjev, Andrei Suslin, Markus Rost, Fabien Morel, Eric Friedlander, and others, including the newly minted theory of motivic cohomology (a kind of substitute for singular cohomology for algebraic varieties) and the motivic Steenrod algebra.\n\nGeneralizations\nThe analogue of this result for primes other than 2 was known as the Bloch–Kato conjecture.  Work of Voevodsky and Markus Rost yielded a complete proof of this conjecture in 2009; the result is now called the norm residue isomorphism theorem.\n\nReferences\n \n \n \n \n \n\nFurther reading\n \n\nCategory:K-theory\nCategory:Conjectures that have been proved\nCategory:Theorems in algebraic topology"
    },
    {
      "title": "Nilpotence theorem",
      "url": "https://en.wikipedia.org/wiki/Nilpotence_theorem",
      "text": "In algebraic topology, the nilpotence theorem gives a condition for an element of the coefficient ring of a ring spectrum to be nilpotent, in terms of complex cobordism.  It was conjectured by  and proved by .\n\nNishida's theorem\n\n showed that elements of positive degree of the homotopy groups of spheres are nilpotent. This is a special case of the nilpotence theorem.\n\nReferences\n\n .\n Open online version.\n\n Further reading \nhttp://mathoverflow.net/questions/116663/connection-of-xn-spectra-to-formal-group-laws\n\nCategory:Homotopy theory\nCategory:Theorems in algebraic topology"
    },
    {
      "title": "Peterson–Stein formula",
      "url": "https://en.wikipedia.org/wiki/Peterson%E2%80%93Stein_formula",
      "text": "In mathematics, the Peterson–Stein formula, introduced by ,  describes the Spanier–Whitehead dual of a secondary cohomology operation.\n\nReferences\n\nCategory:Theorems in algebraic topology"
    },
    {
      "title": "Seifert–van Kampen theorem",
      "url": "https://en.wikipedia.org/wiki/Seifert%E2%80%93van_Kampen_theorem",
      "text": "In mathematics, the Seifert–van Kampen theorem of algebraic topology (named after Herbert Seifert and Egbert van Kampen), sometimes just called van Kampen's theorem,  expresses the structure of the fundamental group of a topological space  in terms of the fundamental groups of two open, path-connected subspaces that cover . It can therefore be used for computations of the fundamental group of spaces that are constructed out of simpler ones.\n\n Van Kampen's theorem for fundamental groupsR. Brown, Groupoids and Van Kampen's theorem,  Proc. London Math. Soc. (3) 17 (1967) 385–401. http://planetmath.org/?method=src&from=objects&name=VanKampensTheorem&op=getobj \n\nLet X be a topological space which is the union of two open and path connected subspaces U1, U2. Suppose U1 ∩ U2 is path connected and nonempty, and let x0 be a point in U1 ∩ U2 that will be used as the base of all fundamental groups. The inclusion maps of U1 and U2 into X induce group homomorphisms  and . Then X is path connected and  and  form a commutative pushout diagram:\n\n750px\n\nthe natural morphism k is an isomorphism, that is, the fundamental group of X is the free product of the fundamental groups of U1 and U2 with amalgamation of . pg. 252, Theorem 10.1.\n\nUsually the morphisms induced by inclusion in this theorem are not themselves injective, and the more precise version of the statement is in terms of pushouts of groups.\n\n Van Kampen's theorem for fundamental groupoids \nUnfortunately, the theorem as given above does not compute the fundamental group of the circle, which is the most important basic example in algebraic topology. The reason is that the circle cannot be realised as the union of two open sets with connected intersection. This problem can be resolved by working with the fundamental groupoid  on a set A of base points, chosen according to the geometry of the situation. Thus for the circle, one uses two base points.http://planetmath.org/vankampenstheorem R. Brown, Groupoids and Van Kampen's theorem, Proc. London Math. Soc. (3) 17 (1967) 385–401.\n\nThis groupoid consists of homotopy classes relative to the end points of paths in X joining points of A ∩ X. In particular, if X is a contractible space, and A consists of two distinct points of X, then  is easily seen to be isomorphic to the groupoid often written  with two vertices and exactly one morphism between any two vertices. This groupoid plays a role in the theory of groupoids analogous to that of the group of integers in the theory of groups.Ronald Brown. \"Groupoids in Mathematics\". http://groupoids.org.uk/gpdsweb.html The groupoid  also allows for groupoids a notion of homotopy: it is a unit interval object in the category of groupoids.\n\nthumb|A connected union of two non connected spaces, with set of base points\n\nThe category of groupoids admits all colimits, and in particular all pushouts.\n\nTheorem. Let the topological space X be covered by the interiors of two subspaces X1, X2 and let A be a set which meets each path component of X1, X2 and X0 = X1 ∩ X2. Then A meets each path component of X and the diagram P of morphisms induced by inclusion\n240px\nis a pushout diagram in the category of groupoids.R. Brown. Topology and Groupoids., Booksurge PLC (2006). http://groupoids.org.uk/topgpds.html\n\nThis theorem  gives the transition from topology to algebra, in determining completely the fundamental groupoid ; one then has to use algebra and combinatorics to determine a fundamental group at some basepoint.\n\nOne interpretation of the theorem is that it computes homotopy 1-types. To see its utility, one can easily find cases where X is connected but is the union of the interiors of two subspaces, each with say 402 path components and whose intersection has say 1004 path components. The interpretation of this theorem as a calculational tool for \"fundamental groups\" needs some development of 'combinatorial groupoid theory'.http://planetmath.org/?method=src&from=objects&name=VanKampensTheorem&op=getobj  P.J. Higgins, Categories and Groupoids, van Nostrand, 1971, Reprints of Theory and Applications of Categories, No. 7 (2005),pp 1–195.R. Brown, Topology and Groupoids., Booksurge PLC (2006). This theorem implies the calculation of the  fundamental group of the circle as the group of integers, since the group of integers is obtained from the groupoid  by identifying, in the category of groupoids, its two vertices.\n\nThere is a version of the last theorem when X is covered by the union of the interiors of a family  of subsets.Ronald Brown, Philip J. Higgins and Rafael Sivera. Nonabelian Algebraic Topology: filtered spaces, crossed complexes, cubical homotopy groupoids, European Mathematical Society Tracts vol 15, August, 2011.Higher-dimensional, generalized van Kampen theorems (HD-GVKT) http://planetphysics.org/encyclopedia/HDGvKTVanKampenTheorems.html\n\nThe conclusion is that if A meets each path component of all 1,2,3-fold intersections of the sets , then A meets all path components of X and the diagram\n\nof morphisms induced by inclusions is a coequaliser in the category of groupoids.\n\n Equivalent formulations \nIn the language of combinatorial group theory, if  is a topological space;  and  are open, path connected subspaces of ;  is nonempty and path-connected; and ; then  is the free product with amalgamation of  and , with respect to the (not necessarily injective) homomorphisms  and .  Given group presentations:\n\nthe amalgamation can be presented pg. 253, Theorem 10.3. as\n\nIn category theory,  is the pushout, in the category of groups, of the diagram:\n\nExamples\n 2-Sphere \nOne can use Van Kampen's theorem to calculate fundamental groups for topological spaces that can be decomposed into simpler spaces. For example, consider the sphere . Pick open sets  and  where n and s denote the north and south poles respectively. Then we have the property that A, B and A ∩ B are open path connected sets. Thus we can see that there is a commutative diagram including A ∩ B into A and B and then another inclusion from A and B into  and that there is a corresponding diagram of homomorphisms between the fundamental groups of each subspace. Applying Van Kampen's theorem gives the result\n\nHowever A and B are both homeomorphic to R2 which is simply connected, so both A and B have trivial fundamental groups. It is clear from this that the fundamental group of  is trivial.\n\n Wedge Sum of Spaces \nGiven two based spaces  and  we can form their wedge  by taking the quotient of  by identifying their two basepoints. Since the fundamental group of a point is trivial, the Van Kampen theorem shows that\n\nis an isomorphism of groups.\n\n Orientable Genus g Surfaces \n\nA more complicated example is the calculation of the fundamental group of a genus n orientable surface S, otherwise known as the genus n surface group. One can construct S using its standard fundamental polygon. For the first open set A, pick a disk within the center of the polygon. Pick B to be the complement in S of the center point of A. Then the intersection of A and B is an annulus, which is known to be homotopy equivalent to (and so has the same fundamental group as) a circle. Then , which is the integers, and . Thus the inclusion of  into  sends any generator to the trivial element. However, the inclusion of  into  is not trivial. In order to understand this, first one must calculate . This is easily done as one can deformation retract B (which is S with one point deleted) onto the edges labeled by\n\nThis space is known to be the wedge sum of 2n circles (also called a bouquet of circles), which further is known to have fundamental group isomorphic to the free group with 2n generators, which in this case can be represented by the edges themselves: . We now have enough information to apply Van Kampen's theorem. The generators are the loops  (A is simply connected, so it contributes no generators) and there is exactly one relation:\n\nUsing generators and relations, this group is denoted\n\nGeneralizations\nAs explained above, this theorem was  extended by Ronald Brown to the non-connected case by using the fundamental groupoid  on a set A of base points.  The theorem for arbitrary covers, with the restriction that A meets all threefold intersections of the sets of the cover, is given in the paper by Brown and Abdul Razak Salleh.Brown, Ronald and Razak Salleh, Abdul, \"A van Kampen theorem for unions of nonconnected spaces\". Archiv der Mathematik (Basel) 42 (1984), no. 1, 85–88.  The theorem and  proof for the fundamental group, but using some groupoid methods, are also given in  J. Peter May's book.May, J. Peter, \"A Concise Introduction to Algebraic Topology\", chapter 2, (1999)   The version that allows more than two overlapping sets but with A a singleton is also given in Allen Hatcher's book below, theorem 1.20.\n\nApplications of the fundamental groupoid on a set of base points to the Jordan curve theorem, covering spaces, and orbit spaces are given in Ronald Brown's book.Brown, Ronald, \"Topology and Groupoids\", Booksurge, (2006) In the case of orbit spaces, it is convenient to take A to include all the fixed points of the action. An example here is the conjugation action on the circle.\n\nReferences to higher-dimensional versions of the theorem which yield some information on homotopy types are given in an article on higher-dimensional group theories and groupoids.Ronald Brown. \"Higher-dimensional group theory\" . 2007. http://www.bangor.ac.uk/~mas010/hdaweb2.htm Thus a 2-dimensional van Kampen theorem which computes nonabelian second relative homotopy groups was given by Ronald Brown and Philip J. Higgins.Brown, Ronald and Higgins, Philip J. \"On the connection between the second relative homotopy groups of some related spaces, Proceedings of the London Mathematical Society (3) 36 (1978), 193-212.</ref> A full account and extensions to all dimensions are given by Brown, Higgins, and Rafael Sivera,Brown, Ronald, Higgins, Philip J., and Sivera, Rafael, \"Nonabelian algebraic topology: filtered spaces, crossed complexes, cubical homotopy groupoids\", EMS Tracts in Mathematics vol 15, 20011. http://groupoids.org.uk/nonab-a-t.html while an extension to n-cubes of spaces is given by Ronald Brown and Jean-Louis Loday.<ref>Brown, Ronald and Loday, Jean-Louis, \"Van Kampen theorems for diagrams of spaces,  Topology 26 (1987), 311–334.\n\nFundamental groups also appear in algebraic geometry and are the main topic of Alexander Grothendieck's first Séminaire de géométrie algébrique (SGA1). A version of van Kampen's theorem appears there, and is proved along quite different lines than in algebraic topology, namely by descent theory. A similar proof works in algebraic topology.Douady, Adrien and Douady, Régine, \"Algèbre et théories galoisiennes\", Cassini (2005)\n\nSee also\n Higher-dimensional algebra\n Higher category theory\n Pseudocircle\n Ronald Brown (mathematician)\n\n Notes \n\nReferences\n Allen Hatcher, Algebraic topology. (2002) Cambridge University Press, Cambridge, xii+544 pp.  and \n Peter May, A Concise Course in Algebraic Topology. (1999) University of Chicago Press,  (Section 2.7 provides a category-theoretic presentation of the theorem as a colimit in the category of groupoids).\n Higher-dimensional algebra\n Ronald Brown, Groupoids and Van Kampen's theorem, Proc. London Math. Soc. (3) 17 (1967) 385-401.\n  Mathoverflow discussion on many base points\n Ronald Brown, Topology and groupoids (2006) Booksurge LLC \n R. Brown and A. Razak, A van Kampen theorem for unions of non-connected  spaces, Archiv. Math. 42 (1984) 85-88. (This paper gives probably the optimal version of the theorem, namely  the groupoid version of the theorem for an arbitrary open cover and a set of base points which meets every path component of every 1-.2-3-fold intersections of the sets of the cover.) \n P.J. Higgins, Categories and groupoids (1971) Van Nostrand Reinhold\n Ronald Brown, Higher-dimensional group theory (2007) (Gives a broad view of higher-dimensional van Kampen theorems involving multiple groupoids).\n Seifert, H., Konstruction drei dimensionaler geschlossener Raume. Berichte Sachs. Akad. Leipzig, Math.-Phys. Kl.  (83) (1931) 26–66.\nE. R. van Kampen. On the connection between the fundamental groups of some related spaces. American Journal of Mathematics, vol. 55 (1933), pp. 261–267.\n Brown, R., Higgins, P. J, On the connection between the second relative homotopy groups of some related spaces,  Proc. London Math.  Soc. (3) 36 (1978) 193–212.\nBrown, R., Higgins, P. J. and  Sivera, R.. 2011, EMS Tracts in Mathematics Vol.15 (2011) Nonabelian Algebraic Topology: filtered spaces, crossed complexes, cubical homotopy groupoids; (The first of three Parts discusses the applications of the 1- and 2-dimensional versions of the Seifert–van Kampen Theorem. The latter allows calculations of nonabelian second relative homotopy groups, and in fact of homotopy 2-types. The second part applies a Higher Homotopy van Kampen Theorem for crossed complexes, proved in Part III.)\n \n R. Brown,  H. Kamps, T. Porter : A homotopy double groupoid of a Hausdorff space II: a van Kampen theorem', Theory and Applications of Categories,  14 (2005) 200–220.\n Dylan G.L. Allegretti, Simplicial Sets and van Kampen's Theorem (Discusses generalized versions of van Kampen's theorem applied to topological spaces and simplicial sets).\n R. Brown and J.-L. Loday, ``Van Kampen theorems for diagrams of spaces'',  Topology 26 (1987) 311–334.\n\nCategory:Homotopy theory\nCategory:Higher category theory\nCategory:Category theory\nCategory:Theorems in algebraic topology"
    },
    {
      "title": "Serre–Swan theorem",
      "url": "https://en.wikipedia.org/wiki/Serre%E2%80%93Swan_theorem",
      "text": "In the mathematical fields of topology and K-theory, the Serre–Swan theorem, also called Swan's theorem, relates the geometric notion of vector bundles to the algebraic concept of projective modules and gives rise to a common intuition throughout mathematics: \"projective modules over commutative rings are like vector bundles on compact spaces\".\n\nThe two precise formulations of the theorems differ somewhat. The original theorem, as stated by Jean-Pierre Serre in 1955, is more algebraic in nature, and concerns vector bundles on an algebraic variety over an algebraically closed field (of any characteristic). The complementary variant stated by Richard Swan in 1962 is more analytic, and concerns (real, complex, or quaternionic) vector bundles on a smooth manifold or Hausdorff space.\n\n Differential geometry \nSuppose M is a smooth manifold (not necessarily compact), and a E is a smooth vector bundle over M. Then Γ(E), the space of smooth sections of E, is a module over C∞(M) (the commutative algebra of smooth real-valued functions on M). Swan's theorem states that this module is finitely generated and projective over C∞(M). In other words, every vector bundle is a direct summand of some trivial bundle:  for some k. The theorem can be proved by constructing a bundle epimorphism from a trivial bundle  This can be done by, for instance, exhibiting sections s1...sk with the property that for each point p, {si(p)} span the fiber over p. \n\nWhen M is connected, the converse is also true: every finitely generated projective module over C∞(M) arises in this way from some smooth vector bundle on M. Such a module can be viewed as a smooth function f on M with values in the n × n idempotent matrices for some n. The fiber of the corresponding vector bundle over x is then the range of f(x). If M is not connected, the converse does not hold unless one allows for vector bundles of non-constant rank (which means admitting manifolds of non-constant dimension). For example, if M is a zero-dimensional 2-point manifold, the module  is finitely-generated and projective over  but is not free, and so cannot correspond to the sections of any (constant-rank) vector bundle over M (all of which are trivial).\n\nAnother way of stating the above is that for any connected smooth manifold M, the section functor Γ from the category of smooth vector bundles over M to the category of finitely generated, projective C∞(M)-modules is full, faithful, and essentially surjective. Therefore the category of smooth vector bundles on M is equivalent to the category of finitely generated, projective C∞(M)-modules. Details may be found in .\n\n Topology \nSuppose X is a compact Hausdorff space, and C(X) is the ring of continuous real-valued functions on X. Analogous to the result above, the category of real vector bundles on X is equivalent to the category of finitely generated projective modules over C(X). The same result holds if one replaces \"real-valued\" by \"complex-valued\" and \"real vector bundle\" by \"complex vector bundle\", but it does not hold if one replace the field by a totally disconnected field like the rational numbers.\n\nIn detail, let Vec(X) be the category of complex vector bundles over X, and let ProjMod(C(X)) be the category of finitely generated projective modules over the C*-algebra C(X). There is a functor Γ : Vec(X) → ProjMod(C(X)) which sends each complex vector bundle E over X to the C(X)-module Γ(X, E) of sections. If  is a morphism of vector bundles over X then  and it follows that\n\ngiving the map \n\nwhich respects the module structure . Swan's theorem asserts that the functor Γ is an equivalence of categories.\n\nAlgebraic geometry\nThe analogous result in algebraic geometry, due to  applies to vector bundles in the category of affine varieties.  Let X be an affine variety with structure sheaf  and  a coherent sheaf of  -modules on X.  Then  is the sheaf of germs of a finite-dimensional vector bundle if and only if  the space of sections of  is a projective module over the commutative ring \n\n References \n\n.\n.\n.\n\n.\n\nCategory:Commutative algebra\nCategory:Theorems in algebraic topology\nCategory:Differential topology\nCategory:K-theory"
    },
    {
      "title": "Simplicial approximation theorem",
      "url": "https://en.wikipedia.org/wiki/Simplicial_approximation_theorem",
      "text": "In mathematics, the simplicial approximation theorem is a foundational result for algebraic topology, guaranteeing that continuous mappings can be (by a slight deformation) approximated by ones that are piecewise of the simplest kind. It applies to mappings between spaces that are built up from simplices—that is, finite simplicial complexes. The general continuous mapping between such spaces can be represented approximately by the type of mapping that is (affine-) linear on each simplex into another simplex, at the cost (i) of sufficient barycentric subdivision of the simplices of the domain, and (ii) replacement of the actual mapping by a homotopic one.\n\nThis theorem was first proved by L.E.J. Brouwer, by use of the Lebesgue covering theorem (a result based on compactness). It served to put the homology theory of the time—the first decade of the twentieth century—on a rigorous basis, since it showed that the topological effect (on homology groups) of continuous mappings could in a given case be expressed in a finitary way. This must be seen against the background of a realisation at the time that continuity was in general compatible with the pathological, in some other areas. This initiated, one could say, the era of combinatorial topology.\n\nThere is a further simplicial approximation theorem for homotopies, stating that a homotopy between continuous mappings can likewise be approximated by a combinatorial version.\n\nFormal statement of the theorem\n\nLet  and  be two simplicial complexes. A simplicial mapping  is called a simplicial approximation of a continuous function  if for every point ,  belongs to the minimal closed simplex of  containing the point . If  is a simplicial approximation to a continuous map , then the geometric realization of ,  is necessarily homotopic to .\n\nThe simplicial approximation theorem states that given any continuous map  there exists a natural number  such that for all  there exists a simplicial approximation  to  (where  denotes the barycentric subdivision of , and  denotes the result of applying barycentric subdivision  times.)\n\nReferences\n\nCategory:Continuous mappings\nCategory:Simplicial sets\nCategory:Theorems in algebraic topology"
    },
    {
      "title": "Snaith's theorem",
      "url": "https://en.wikipedia.org/wiki/Snaith%27s_theorem",
      "text": "In algebraic topology, a branch of mathematics, Snaith's theorem, introduced by Victor Snaith, identifies the complex K-theory spectrum with the localization of the suspension spectrum of  away from the Bott element.\n\n References \nFor a proof, see http://people.fas.harvard.edu/~amathew/snaith.pdf\nVictor Snaith, Algebraic Cobordism and K-theory, Mem. Amer. Math. Soc. no 221 (1979)\n\n External links \n\nCategory:Theorems in algebraic topology\nCategory:K-theory"
    },
    {
      "title": "Stallings–Zeeman theorem",
      "url": "https://en.wikipedia.org/wiki/Stallings%E2%80%93Zeeman_theorem",
      "text": "In mathematics, the Stallings–Zeeman theorem is a result in algebraic topology, used in the proof of the Poincaré conjecture for dimension greater than or equal to five. It is named after the mathematicians John R. Stallings and Christopher Zeeman.\n\nStatement of the theorem\nLet M be a finite simplicial complex of dimension dim(M) = m ≥ 5. Suppose that M has the homotopy type of the m-dimensional sphere Sm and that M is locally piecewise linearly homeomorphic to m-dimensional Euclidean space Rm. Then M is homeomorphic to Sm under a map that is piecewise linear except possibly at a single point x. That is, M \\ {x} is piecewise linearly homeomorphic to Rm.\n\nReferences\n  \n  \n\nCategory:Theorems in algebraic topology"
    },
    {
      "title": "Universal coefficient theorem",
      "url": "https://en.wikipedia.org/wiki/Universal_coefficient_theorem",
      "text": "In algebraic topology, universal coefficient theorems   establish relationships between homology and cohomology theories. For instance,  the integral homology theory of a topological space , and its homology with coefficients in any abelian group  are related as follows: the integral homology groups\n\ncompletely determine the groups\n\nHere  might be the simplicial homology or more general singular homology theory: the result itself is a pure piece of homological algebra about chain complexes of free abelian groups. The form of the result is that other coefficients  may be used, at the cost of using a Tor functor.\n\nFor example it is common to take  to be , so that coefficients are modulo 2. This becomes straightforward in the absence of 2-torsion in the homology. Quite generally, the result indicates the relationship that holds between the Betti numbers  of  and the Betti numbers  with coefficients in a field . These can differ, but only when the characteristic of  is a prime number  for which there is some -torsion in the homology.\n\nStatement of the homology case \nConsider the tensor product of modules . The theorem states there is a short exact sequence\n\nFurthermore, this sequence splits, though not naturally. Here  is a map induced by the bilinear map .\n\nIf the coefficient ring  is , this is a special case of the Bockstein spectral sequence.\n\nUniversal coefficient theorem for cohomology\nLet  be a module over a principal ideal domain  (e.g.,  or a field.)\n\nThere is also a universal coefficient theorem for cohomology involving the Ext functor, which asserts that there is a natural short exact sequence\n\nAs in the homology case, the sequence splits, though not naturally.\n\nIn fact, suppose\n\nand define:\n\nThen  above is the canonical map:\n\nAn alternative point-of-view can be based on representing cohomology via Eilenberg–MacLane space where the map  takes a homotopy class of maps from  to  to the corresponding homomorphism induced in homology. Thus, the Eilenberg–MacLane space is a weak right adjoint to the homology functor.\n\n Example: mod 2 cohomology of the real projective space\nLet , the real projective space. We compute the singular cohomology of  with coefficients in .\n\nKnowing that the integer homology is given by:\n\nWe have , so that the above exact sequences yield\n\nIn fact the total cohomology ring structure is\n\nCorollaries\nA special case of the theorem is computing integral cohomology. For a finite CW complex ,  is finitely generated, and so we have the following decomposition.\n\nwhere  are the Betti numbers of  and  is the torsion part of . One may check that\n\nand\n\nThis gives the following statement for integral cohomology:\n\nFor  an orientable, closed, and connected -manifold, this corollary coupled with Poincaré duality gives that .\n\n Notes \n\nReferences\nAllen Hatcher, Algebraic Topology, Cambridge University Press, Cambridge, 2002. . A modern, geometrically flavored introduction to algebraic topology. The book is available free in PDF and PostScript formats on the author's homepage.\n \n\n External links \nhttp://math.stackexchange.com/questions/767864/universal-coefficient-theorem-with-ring-coefficients/768481#768481\n\nCategory:Homological algebra\nCategory:Theorems in algebraic topology"
    }
  ]
}