{"title": "A Course of Modern Analysis", "url": "https://en.wikipedia.org/wiki/A_Course_of_Modern_Analysis", "text": "A Course of Modern Analysis: an introduction to the general theory of infinite processes and of analytic functions; with an account of the principal transcendental functions (colloquially known as Whittaker and Watson) is a landmark textbook on mathematical analysis written by E. T. Whittaker and G. N. Watson, first published by Cambridge University Press in 1902. (The first edition was Whittaker's alone; it was in later editions with Watson that this book is best known.)\n\nIts first, second, third, and the fourth, last edition were published in 1902, 1915, 1920, and 1927, respectively. Since then, it has continuously been reprinted and still in print today.\n\nThe book is notable for being the standard reference and textbook for a generation of Cambridge mathematicians including Littlewood and G. H. Hardy. Mary Cartwright studied it as preparation for her final honours on the advice of fellow student V.C. Morton, later Professor of Mathematics at Aberystwyth University. But its reach was much further than just the Cambridge school; André Weil in his obituary of the French mathematician Jean Delsarte noted that Delsarte always had a copy on his desk.\n\nToday, the book retains much of its original appeal. Some idiosyncratic but interesting problems from the salad days of the Cambridge Mathematical Tripos are to be found in the exercises. It is terse, yet readable by the motivated student. It conforms to high standards of mathematical rigour, while compressing much actual formulaic information also.\n\nThe book was one of the earliest to use decimal numbering for its sections, an innovation the authors attribute to Giuseppe Peano.\n\n Contents \nBelow is the contens of the fourth edition:\n\nPart I. The Process of Analysis\n\nPart II. The Transcendental Functions\n\nSee also\nBateman Manuscript Project\n\nReferences\n\nE. T. Whittaker and G. N. Watson. A Course of Modern Analysis. Cambridge University Press; 4th edition (January 2, 1927). \n\nExternal links\n A Course of Modern Analysis at Cambridge University Press (4 e. 1927, reissued 1996)\nFirst edition (1902) at Google Books\n\nCategory:1902 books\nCategory:Mathematics textbooks\nCategory:Mathematical analysis"}
{"title": "Absoluteness", "url": "https://en.wikipedia.org/wiki/Absoluteness", "text": "In mathematical logic, a formula is said to be absolute if it has the same truth value in each of some class of structures (also called models).  Theorems about absoluteness typically establish relationships between the absoluteness of formulas and their syntactic form. \n\nThere are two weaker forms of partial absoluteness. If the truth of a formula in each substructure N of a structure M follows from its truth in M, the formula is downward absolute. If the truth of a formula in a structure N implies its truth in each structure M extending N, the formula is upward absolute.\n\nIssues of absoluteness are particularly important in set theory and model theory, fields where multiple structures are considered simultaneously. In model theory, several basic results and definitions are motivated by absoluteness. In set theory, the issue of which properties of sets are absolute is well studied. The Shoenfield absoluteness theorem, due to Joseph Shoenfield (1961), establishes the absoluteness of a large class of formulas between a model of set theory and its constructible universe, with important methodological consequences. The absoluteness of large cardinal axioms is also studied, with positive and negative results known.\n\n In model theory \n\nIn model theory, there are several general results and definitions related to absoluteness. A fundamental example of downward absoluteness is that universal sentences (those with only universal quantifiers) that are true in a structure are also true in every substructure of the original structure. Conversely, existential sentences are upward absolute from a structure to any structure containing it. \n\nTwo structures are defined to be elementarily equivalent if they agree about the truth value of all sentences in their shared language, that is, if all sentences in their language are absolute between the two structures. A theory is defined to be model complete if whenever M  and N are models of the theory and M is a substructure of N, then M is an elementary substructure of N.\n\n In set theory \n\nA major part of modern set theory involves the study of different models of ZF and ZFC. It is crucial for the study of such models to know which properties of a set are absolute to different models. It is common to begin with a fixed model of set theory and only consider other transitive models containing the same ordinals as the fixed model. \n\nCertain properties are absolute to all transitive models of set theory, including the following (see Jech (2003 sec. I.12) and Kunen (1980 sec. IV.3)). \n x is the empty set.\n x is an ordinal.\n X is a finite ordW"}
